000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.  CNP08Z.
000300*****************************************************************
000400*                   DEADHEAD EMPLOYEE PROGRAM
000500*****************************************************************
000600*  DATE   INITIAL  LOG#   DESCRIPTION
000700*-------- ------- ------  ---------------------------------------
000800*10/30/90   ERW           CICS CONVERSION.
000900*12/20/93   LMB           UNAVAILABLE STATUS MODIFICATIONS.
001000*05/12/95   LMB           NEW WSLOCODE FOR WAITING TURN
001100*06/22/95   PLS           FOR FASTSLOW SPAREBOARDS, USE THE FLAG
001200*                         FROM DECISION TABLE PROCESSING TO
001300*                         DETERMINE ROAD VS. YARD.
001400*07/25/95   FHK           CHANGE SVC-FI AND SPCL-QUAL-FI TO SE
001500*09/18/95   MMM  CNC0009  NEW RESTRICTION CONTROL PROCESSING
001600*                         ADDED.
001700*12/15/95   PLS  CNC0108  ADDED NEW REJECT FUNCTION - RJNW.
001800*12/22/95   PLS  CNC0110  DISPLAY MTOD PREVIOUS DUTY.
001900*10/22/96   RCW  C-326    POPULATE P917-TRAIN ON YARD ASGN
002000*                         MISSED CALLS.
002100*04/03/97   JES  CNC0113  CHANGE RUN-MILES TO COME FROM TABLE 525
002200*03/18/98   LMB  CNC0134  IF DEADHEADING AN EMPLOYEE TO AN
002300*                         ASSIGNMENT, AND THE PERSON IS CURRENTLY
002400*                         WORKING AN ASSIGNED JOB IN AN AREA THAT
002500*                         PERMITS QUICK TIE, LINK TO 922 TO QUICK
002600*                         TIE THE PERSON BEFORE DEADHEADING HIM.
002700*                         DISPLAY MESSAGE IF PERSON PRESENTED HAS
002800*                         OUTSTANDING QUICK TIES.
002900*03/25/98   AMF  CNC0155  ENHANCED TRACKING CHANGES.
003000*04/06/98   WLW           ADD HELP
003100*09/18/98   WLC  C371     FIX FILL PROCESS
003200*12/03/98   GBJ           YEAR 2000 SWEEP.
003300*01/13/99   GBJ           LEAP-YEAR 2000 SWEEP.
003400*04/23/99   NJB           ADDED FREEKB
003500*06/01/99   AJK  CNC0216  STATUS/REASON CODE ENHANCEMENT.
003600*12/15/99   GER  CNC0259  ADD IC CALL FUNCTIONS.
003700*01/04/00   MOO  CNC0183  ADD RJHS & REST STATUS FUNCTIONS.
003800*03/24/00   AJK  CNC0275  ADD MERGER CLASSIFICATION LOGIC.
003900*03/25/00   MOO  CNC0183  ADD CHANGES FOR FROZEN INFO.
004000*04/28/00   GER  CNC0283  DECISION DH-LEAD TIME.
004100*
004200*02/21/01   TJR           CORRECT SCREEN PROBLEMS WHEN GOING OFF/
004300*                         COMMING BACK FROM PF10-BROWSE. DO FIND
004400*                         ON TJR 2/21/2001. COMMENT OUT THE
004500*                         FOLLOWING FIELDS, WERE NOT BEING USED
004600*                         02 UPDATE-FLAG
004700*                            88  UPDATE-OK
004800*                            88  NO-UPDATE >ALSO COMMENT OUT THIS
004900*                                           FIELD IN THE CODE
005000*                          COMMENT OUT THE LAST PERFORM STMT IN
005100*                          P4100-PROCESS-CALL-FUNCTION.
005200*10/08/01   AJK  CNC0331  MANDATORY REST/HOURS OF SERVICE ENH.
005300*02/27/02   SAM  C519     ADDED EDIT FOR ASSIGNMENT QUALIFICATIONS
005400*03/14/03   JAJ  CNC0331B MANDATORY REST/HOS ADDENDUM B.
005500*04/24/03   SAM  CNC0331  SEND EFFECTIVE DATE/TIME IN THE P923-
005600*                         ORDER-DATE/TIME FIELDS.
005700*03/31/04   NRL  CNC0331F RECOMPILE.
005800*04/05/04   AJK  CNC0331G MANDATORY REST/HOS ENH. - ADD CALLBACK
005900*                         LOGIC.
006000*08/17/04   TRK  C519     PROBLEM WITH CHECKING CREW PROFILE QUAL
006100*04/21/05   AJK  CNC0386E RECOMPILE FOR COPYBOOK CHANGES.
006200*01/26/07   AJK           GETTING SUBSCRIPT-OUT-OF-BOUND ERROR
006300*                         WHEN CHECKING ASSIGNMENT QUALS -
006400*                         ASGN-QUAL-ARRAY-MAX = 6, BUT CNTL QUAL
006500*                         TABLE IS ONLY 5.
006600*08/29/08   RAL  CNC0331E IMPOSED REST STARTS AT 6401, NOT 6400
006700*01/22/08   JLH  C755     PASS THE ORIGINAL START TIME TO P923,
006800*                         NOT THE ADJUSTED START TIME
006900*02/13/08   AJK  C753     ORDER TIME SHOULD BE DISPLAYED IN THE
007000*                         TIMEZONE OF THE TRCN PROFILE SELECTED,
007100*                         NOT BASED ON PSTCA-TIME-ZONE.
007200*02/04/09   JES  CNC0436B LINK TO CNPS52 FOR TELEPHONE INFO AND
007300*                         LEAD-TIME.
007400*05/04/09   RZP  CNC0484  CALL PS94 TO GET THE TOTAL HOS AND LIMBO
007500*                         TIME
007600*05/22/09   AJK  CNC0484  ADDED PS94-TIME-ZONE LOGIC
007700*06/26/09   SXK  CNC0484  SHOW 'HOUR' IN THE FUNCTION FIELD WHEN
007800*                         EMP EXCEEDS MONTHLY HOS OR LIMBO LIMITS
007900*07/08/09   JES  CNC0436B IVR OUT-DIAL
008000*07/09/09   BLD  CNC0436B MORE IVR OUT-DIAL
008100*07/15/09   JES  CNC0436B DISPLAY OF SHORT CALL
008200*07/27/09   RXS  CNC0484  PHASE II CHANGES.
008300*07/28/09   SZV  CNC0484  POPULATE HST KEY FOR PROCESSING PS94
008400*                         HST FUNCTIONALITY.
008500*08/06/09   JES  CNC0436B IVR CALL TO DELAY LINK TO 920 UNTIL
008600*                         CNP0ER. ADD 03A AND 04S FROM ROUTINES.
008700*08/14/09   BLD  CNC0436B IVR OUT-DIAL - ADD VCAN FUNCTION
008800*09/21/09   JES  CNC0436B #779 ADD SHORT-CALL-FLAG PASS TO 0ES.
008900*09/28/09   JES  CNC0436B COMMENT OUT PS52-DISPLAY-ONLY SET.
009000*09/29/09   JES  CNC0436B #779 CHANGE FLAG TO SHORT-CALL-REQ.
009100*                         #823 SET UP FURTHER-NOTICE FLAG FROM
009200*                         DECISION TABLE.
009300*10/08/09   JES  CNC0436B #846 IVR-CALL ALLOWED WITH NOT-NOTIFIED
009400*                         (LAYOFF-CODE-2 = '1')
009500*10/16/09   CXJ  CNC0484  POPULATE HST KEY WITH THE CURRENT ASGN.
009600*10/19/09   JES  CNC0436B #892 ADDED P08CA-RESUB-FLAG AND SENT TO
009700*                         CNP0ES THRU P0ESCOMM.
009800*11/03/09   JES  #957     CHANGE CALLBACK MSG WHEN BOTH QTIE AND
009900*                         CBCK EXIST.
010000*11/04/09   RXS C841      POPULATE THE MASTER DIST/SUB DISTRICT
010100*                         IF EMP IS TO-PLACE FOR HST KEY
010200*12/02/09   BLD  CNC0436B #1035 - RETURN TO THE CALLING PROGRAM
010300*                         UPON EXIT.
010400*12/04/09   JES  CNC0436B #1035 - SET P08CA-ORDER-VX UPON COMING
010500*                         FROM 03A OR 04S.
010600*02/24/10   SZV  C853     POPULATE P925-ASGN-CC BEFORE P925 CALL
010700*06/03/10   JES  CNC0436M USE OF VCLL WILL NOT BE ALLOWED WHEN
010800*                         EMPLOYEE UNDER UDR/MTOD.
010900*09/29/10   BLD  #1368    DISPLAY MSG WHEN IVR MASTER SWITCH OFF
011000*10/14/10   JES  #1448    FIND PROPER TIME-ZONE TO SEND TO P927.
011100*10/14/10   JES  #1367    DO NOT ALLOW FUNCTION RJH.
011200*11/02/10   JES  #1474    IF CALLBACK (CBCK), UPDATE VRUINFO WITH
011300*                         VRU-SHORT-CALLED.
011400*11/11/10   JES  #        UNDO HARDCODE OF 'VCLL'.
011500*11/29/10   JES  #1501    DO NOT SEND 0ES SHORT CALL REQ IF THE
011600*                         CALCULATED TIME IS GREATER THAN CURRENT.
011700*12/13/10   JES  #1497    SPACE P08ZCA-SAVE-CBCK-FLAG
011800*12/14/10   JES  #1490    DO NOT OVERWRITE THE TASK-CALL-ORDER-
011900*                         DATE-TIME (VIA 927) WITH SHORT-CALL-TM
012000*12/28/10   JES  #1503    CHANGE THE TEST FOR NOT-RESTED VCLL EDIT
012100*                         TO USE SHORTCALL DATE-TIME.
012200*02/04/11   JES  #1529    ADD PERSONAL REST TO THE NOT-RESTED VCLL
012300*                         EDIT.
012400*11/02/12   KXD  CNC0531  INCLUDED YARDMASTER CRAFT CODES TO
012500*                         CONVERT TO THE MASTER CRAFT CODE.
012600*02/18/15   AXK  C1067    ADD FUNCTION 'RJNR'
012700*05/12/15   MFO  C1067    USE SPAREBOARD MISS CALL CONTROL.
012800*09/29/15   MFO  CNC0572  ADDITIONAL SPECIAL QUALIFICATIONS
012900*09/30/15   BLD  C1100    DO NOT DELETE TRACKING WHEN ON-DUTY
013000*                         RECORD EXISTS.
013100*11/03/15   MFO  C1105    PRESENT NEXT EMP AFTER MISS CALL FUNC
013200*03/18/16   RXB  C1122    ADD EDIT FOR ORDER TIME MAXIMUM 24 HRS
013300*                         IN FUTURE FROM LOCAL TIME.
013400*04/18/18   MFO  C1193    REMOVE 64/7 EDIT SETTING YELLOW STATUS
013500*05/08/18   MFO  C1194    ONLY RESET EMPLOYEES SHORT CALL LEAD
013600*                         TIME WHEN IVR CALL OR MANUAL CALL.
013700*02/27/23   SXP  CNC0598  WRR PH-1: NO NEED OF MTOY AND MTOR
013800*03/28/23   SXP  CNC0600  WRR PH-2: NEW HOS OVERIDE FUNC HOSO
013900*04/10/23   NXA  CNC0600  ADD UNDISTURBED REST UNTIL MESSAGE
014000*04/23/23   RRS  CNLD-133 CALL TO P919 FOR NATURAL RESET
014100*05/05/23   DXC  CNLD-207 ADD EMP WILL RESET SHORLTY MSG AND
014200*                         PROHIBIT CALL WHEN P925-LOCAL-LT-RESET.
014300*05/13/23   RKW  CNC0600  CNLD-209  MODIFY COLORS FOR NEW SCHEME
014400*                         CNLD-230 ADD 7DAY LOOK BACK AND ERT
013910*06/06/23   RJA  CNLD-244 RENAMED P925-ORDR-LT-RESET;
013910*                      #3 EMPLOYEES SHOULD BE RESTED FOR ON-DUTY
      *                         TIME (PER EARLIER SPEC THEY NEEDED TO BE
      *                         RESTED FOR ORDER TIME)
      *06/20/23   DXC  CNLD-257 7/28 DAYS MESSAGE CHANGE
      *06/29/23   RJA  CNLD-259 E95 DUEBACK IS END OF MSTR3-SYSTEM-UD2,
      *                         BUT EMP CANNOT BE PUT ON-DUTY UNTIL
      *                         AFTER MSTR3-SYSTEM-RESET-BRK.
      *07/18/23   SXP  CNLD-265 COMPARE PERS REST WITH ORDER-LEAD TIME
      *07/19/23   SXP  CNLD-245 BLOCK CALL IF USHR > LOCAL TIME
      *11/01/23   RJA  CNLD-285 INITIALIZE WS-EMP-UNDST-REST-FLAG
      *               /CNLD-286            WS-REST-US-STATUS-FLAG
      *                                    WS-SAVE-UD-DTTM
      *08/12/24   RJA  CNLD-302 REMOVED P920-ASGN-OUTPOST FLAG AS IT'S
      *                         REDUNDANT.
009000*08/16/24   RJA  CNLD-309 MTOY AND MTOR ARE OBSOLETE.
014500*****************************************************************
014600 ENVIRONMENT DIVISION.
014700 CONFIGURATION SECTION.
014800 SOURCE-COMPUTER.  IBM-9370.
014900 OBJECT-COMPUTER.  IBM-9370.
015000 DATA DIVISION.
015100 WORKING-STORAGE SECTION.
015200 01  FILLER                          PIC X(009) VALUE 'PGM08Z WS'.
015300 01  P08ZCOMM-LGTH                   PIC S9(04) COMP   VALUE +320.
015400
015500 01  WS-SUBSCRIPTS.
015600     05  T                           PIC S9(04) COMP VALUE +0.
015700     05  I                           PIC 9(002) COMP VALUE ZEROS.
015800     05  SUBA                        PIC 9(002) COMP VALUE ZEROS.
015900     05  SUB                         PIC 99 VALUE ZEROES.
016000     05  SUB1                        PIC 99 VALUE ZEROES.
016100     05  SUB2                        PIC 99 VALUE ZEROES.
016200*CNC0572 - BEG
016300     05  SUB3                        PIC 99 VALUE ZEROES.
016400*CNC0572 - END
016500     05  SUB4                        PIC 9(001) VALUE ZEROS.
016600     05  SUB4-ALPHA REDEFINES SUB4   PIC X(001).
016700*CNC0572 - BEG
016800***  05  ASGN-QUAL-ARRAY-MAX         PIC 9  VALUE 6.
016900     05  ASGN-QUAL-ARRAY-MAX         PIC 9  VALUE 8.
017000*CNC0572 - BEG
017100     05  QUAL-ARRAY-MAX              PIC 9  VALUE 5.
017200
017300
017400 01  WS-TIME-CALC.
017500     05  TIMEA                       PIC S9(05) COMP-3 VALUE +0.
017600
017700 01  WS-FLAGS.
017800     05  SCREEN-FLAG                 PIC X(001) VALUE '0'.
017900         88  CONTINUE-SCREEN                    VALUE '0'.
018000         88  CREATE-SCREEN                      VALUE '1'.
018100         88  SEND-BUFFER                        VALUE '2'.
018200***  05  UPDATE-FLAG                 PIC X(001) VALUE '0'.
018300***      88  UPDATE-OK                          VALUE '0'.
018400***      88  NO-UPDATE                          VALUE '1'.
018500     05  NORMAL-ASGNMT-FLAG          PIC X(001) VALUE SPACES.
018600         88  NORM-ASGN-UFP                      VALUE 'U'.
018700         88  NORM-ASGN-XB                       VALUE 'X'.
018800         88  NORM-ASGN-AJ                       VALUE 'A'.
018900     05  TEMPORARY-ASGNMT-FLAG       PIC X(001) VALUE SPACES.
019000         88  TEMP-ASGN-UFP                      VALUE 'U'.
019100         88  TEMP-ASGN-XB                       VALUE 'X'.
019200         88  TEMP-ASGN-AJ                       VALUE 'A'.
019300     05  TEMP-ASGN-XB-AUG-FLAG       PIC X(001) VALUE SPACES.
019400         88  TEMP-ASGN-XB-AUG                   VALUE 'Y'.
019500     05  ON-DUTY-ASGNMT-FLAG         PIC X(001) VALUE SPACES.
019600         88  ON-DUTY-UFP                        VALUE 'U'.
019700         88  ON-DUTY-AJ                         VALUE 'A'.
019800     05  ON-DUTY-OUT-TOWN-CODE       PIC X(10) VALUE '9999999999'.
019900         88  OUT-TOWN                          VALUE '0000000000'.
020000     05  DONE-CODE                   PIC X(001) VALUE '0'.
020100         88  DONE                               VALUE '1'.
020200     05  WS-ASSOCIATED-TURN-FLAG     PIC 9(001) VALUE ZEROS.
020300         88  ASSOCIATED-TURN                    VALUE 1.
020400     05  WS-EN-FI-MARRIED-FLAG       PIC X(001) VALUE ' '.
020500         88  EN-FI-MARRIED                      VALUE 'Y'.
020600     05  WS-CO-BK-MARRIED-FLAG       PIC X(001) VALUE ' '.
020700         88  CO-BK-MARRIED                      VALUE 'Y'.
020800     05  ASGN-DONE-CODE              PIC 9(001) VALUE ZEROS.
020900         88  ASGN-DONE                          VALUE 1.
021000     05  GET-FIRST-TEMP-EMP-CODE     PIC X(001) VALUE '0'.
021100         88  GET-FIRST-TEMP-EMP                 VALUE '1'.
021200     05  ERRORS-FLAG                 PIC X(001) VALUE '0'.
021300         88  NO-ERRORS                          VALUE '0'.
021400         88  ERRORS-FOUND                       VALUE '1'.
021500     05  CHECK-VALID-MODE            PIC 9(001) VALUE ZEROS.
021600         88  VALID-MODE                         VALUES 1 THRU 8.
021700     05  MERG-ASSIGN                 PIC X(001) VALUE '0'.
021800         88  UFP-ASGN                           VALUE '1'.
021900         88  AJ-ASGN                            VALUE '2'.
022000     05  FOUND-QUAL-FLAG             PIC X  VALUE SPACES.
022100         88  QUAL-FOUND              VALUE 'Y'.
022200     05  QUAL-SEARCH-FLAG            PIC X  VALUE SPACES.
022300         88  QUAL-SEARCH-DONE        VALUE 'Y'.
022400     05  EMP-QUAL-FLAG               PIC X  VALUE SPACES.
022500         88  EMP-QUALIFIED           VALUE ' '.
022600         88  EMP-NOT-QUALIFIED       VALUE '1'.
022700         88  EMP-QUAL-EXPIRED        VALUE '2'.
022800     05  WS-TIME-FLAG                PIC  X(001) VALUE '0'.
022900         88  TIME-NOT-DONE                       VALUE '0'.
023000         88  TIME-DONE                           VALUE '1'.
023100*
023200     05  WS-US-DOM-FLAG              PIC X(001) VALUE SPACES.
023300         88  WS-US-DOM-YES                      VALUE 'Y'.
023400     05  WS-EMP-RESTED-FLAG          PIC X(001) VALUE SPACES.
023500         88  WS-EMP-RESTED-YES                  VALUE 'Y'.
023600         88  WS-EMP-RESTED-NO                   VALUE 'N'.
023700     05  WS-WESTERN-DIVN-FLAG        PIC X(001) VALUE ' '.
023800         88  WS-WESTERN-DIVN                    VALUE 'Y'.
023900*C1067 - 05/12/15 - BEG
024000     05  FIND-MC-CODE-FLAG           PIC X(001) VALUE 'Y'.
024100         88  FIND-MC-CODE                       VALUE 'Y'.
024200         88  DONT-FIND-MC-CODE                  VALUE 'N'.
024300*C1067 - 05/12/15 - END
024400*CNC0598-B
024500     05  WS-CAN-WRR-FLAG             PIC X(001) VALUE ' '.
024600         88  WS-CAN-WRR-NEW                     VALUE 'N'.
024700         88  WS-CAN-WRR-OLD                VALUE 'O', ' '.
024800*CNC0598-E
024900*CNC0598-NXA-B
025000     05  WS-EMP-UNDST-REST-FLAG      PIC X(001) VALUE 'N'.
025100         88  WS-EMP-UNDST-REST                  VALUE 'Y'.
025200     05  WS-MSTR3-FOUND-FLAG         PIC X(001) VALUE 'N'.
025300         88  WS-MSTR3-REC-FOUND                 VALUE 'Y'.
025400         88  WS-MSTR3-NOT-FOUND                 VALUE 'N'.
025500*CNC0598-NXA-E
025600*CNLD-230-B
025700     05  WS-REASON-FOR-RED           PIC X(001) VALUE ' '.
      *CNLD-259 B CNC0600
               88  WS-RFR-LEAD-IN-SYS-UD              VALUE 'U'.
               88  WS-RFR-OD-IN-SYS-RB                VALUE 'S'.
      *CNLD-259 E
025800         88  WS-RFR-7DAY-RND-ERT                VALUE 'R'.
025900         88  WS-RFR-7DAY-ERT                    VALUE 'E'.
026000         88  WS-RFR-7DAY-HRS                    VALUE 'H'.
      *CNLD-257-DXC-B
026100*        88  WS-RFR-60-192-ERT                  VALUE 'L'.
026200*        88  WS-RFR-60-192-HRS                  VALUE '6'.
               88  WS-RFR-60-ERT                      VALUE 'L'.
               88  WS-RFR-192-ERT                     VALUE 'N'.
               88  WS-RFR-60-HRS                      VALUE '6'.
               88  WS-RFR-192-HRS                     VALUE '7'.
      *CNLD-257-DXC-E
026300         88  WS-RFR-MTOD                        VALUE 'M'.
      *CNLD-265
026300         88  WS-RFR-PERS                        VALUE 'P'.
026400*CNLD-230-E
026500*
026600
026700 01  WS-MISC.
026800     05  WS-HOLD-CC                  PIC X(02)  VALUE SPACES.
026900     05  SAVE-CC                     PIC X(02)  VALUE SPACES.
027000     05  WRK-TIME.
027100         10  WRK-HR                  PIC  9(002) VALUE ZEROS.
027200             88 VALID-HR                         VALUE 0 THRU 23.
027300         10  WRK-MN                  PIC  9(002) VALUE ZEROS.
027400             88 VALID-MN                         VALUE 0 THRU 59.
027500     05  WS-TOTAL-HOURS-X.
027600         10  WS-TOTAL-HOURS          PIC 9(05)   VALUE ZEROES.
027700     05  WS-TOTAL-MINUTES-X.
027800         10  WS-TOTAL-MINUTES        PIC 9(03)   VALUE ZEROES.
027900     05  WS-64-TOT-TIME-ON-DUTY      PIC 9(007)  VALUE ZEROES.
028000     05  FILLER REDEFINES WS-64-TOT-TIME-ON-DUTY.
028100         10  WS-64-TOT-HRS-ON-DUTY   PIC 9(005).
028200         10  WS-64-TOT-MNS-ON-DUTY   PIC 9(002).
028300     05  WS-TIME-ZONE                PIC X(001)  VALUE SPACES.
028400     05  WS-TZ-DIST                  PIC X(002)  VALUE SPACES.
028500     05  WS-TZ-SUB-DIST              PIC X(002)  VALUE SPACES.
028600     05  WS-TELEPHONE-NBRS.
028700         10  WS-TELEPHONE-ENTRY OCCURS 3.
028800             15  WS-TELEPHONE-NBR.
028900                 20  WS-TELEPHONE-AREA     PIC X(3).
029000                 20  FILLER                PIC X.
029100                 20  WS-TELEPHONE-PREFIX   PIC X(3).
029200                 20  FILLER                PIC X.
029300                 20  WS-TELEPHONE-SUFFIX   PIC X(4).
029400                 20  FILLER                PIC X.
029500             15  WS-TELEPHONE-CODE-AREA.
029600                 20  WS-TELEPHONE-CODE     PIC X(01).
029700                 20  FILLER                PIC X.
029800             15  WS-TELEPHONE-COMMENT-AREA.
029900                 20  WS-TELEPHONE-COMMENTS PIC X(10).
030000                 20  FILLER                PIC X.
030100         10  WS-TELEPHONE-FILLER           PIC X(02).
030200     05  WS-IVR-CALL-PROF                  PIC X(08).
030300     05  WS-MISC-LIMBO-TM.
030400         10 WS-LIMBO-TM1             PIC X(1) VALUE SPACES.
030500         10 WS-LIMBO-TM2             PIC X(5) VALUE SPACES.
030600     05  WS-MISC-TOT-TM.
030700         10 WS-TOT-TM1               PIC X(1) VALUE SPACES.
030800         10 WS-TOT-TM2               PIC X(5) VALUE SPACES.
030900     05  WS-MISC-CONSEC-STARTS.
031000         10 WS-CONSEC-STARTS         PIC X(2) VALUE SPACES.
031100     05  WS-SHORT-CALL-REQ           PIC X(004) VALUE SPACES.
031200     05  WS-SHORT-FLAG               PIC X(001) VALUE SPACES.
031300         88  WS-SHORT-LEAD                      VALUE 'L'.
031400         88  WS-SHORT-CALL                      VALUE 'C'.
243700*CNLD-302  B  COMMENTING
031500**CNC0600
031600*     05  WS-ASGN-OUTPOST             PIC X VALUE SPACES.
243700*CNLD-302  E
243700
031700*CNLD-230-B
031800     05 WS-RFR-MSG                   PIC X(004) VALUE SPACES.
031900*CNLD-230-E
      *CNLD-245-B
006000     05 WS-SAVE-UD-DTTM              PIC 9(010) VALUE ZEROS.
006000     05 WS-REST-US-STATUS-FLAG       PIC X(001) VALUE SPACES.
014400        88  WS-EMP-US-STATUS-RED        VALUE 'R'.
014500        88  WS-EMP-US-STATUS-YELLOW     VALUE 'Y'.
014600        88  WS-EMP-US-STATUS-GREEN      VALUE 'G'.
      *CNLD-245-E
032000
032100 01  WORK-ASGN-QUAL-AREA.
032200     02  WORK-ASGN-QUAL    OCCURS 10.
032300         06  FILLER                       PIC X(04).
032400
032500 01  WORK-CNTLKEY.
032600     02  WK-CNTL-REC-TYPE                PIC XX.
032700     02  WK-CNTL-DIST                    PIC XX.
032800     02  WK-CNTL-SUB-DIST                PIC XX.
032900     02  WK-CNTL-ASSIGN.
033000         03  WK-CNTL-AJ-JOB-NO.
033100             04  WK-CNTL-AJ-1-4          PIC X(4).
033200             04  WK-CNTL-AJ-5-6          PIC XX.
033300         03  FILLER                      PIC X(3).
033400     02  WK-CNTL-XB REDEFINES
033500         WK-CNTL-ASSIGN.
033600         03  WK-CNTL-XB-CODE             PIC XX.
033700         03  FILLER                      PIC X(7).
033800     02  WK-CNTL-UFP REDEFINES
033900         WK-CNTL-ASSIGN.
034000         03  WK-CNTL-POOL                PIC XX.
034100         03  WK-CNTL-POOL-TYPE           PIC X.
034200         03  FILLER                      PIC X(6).
034300     02  WK-CNTL-ASSIGN-QUAL
034400         REDEFINES WK-CNTL-ASSIGN.
034500         03  WK-CNTL-ASGN-QUAL-TYPE      PIC X.
034600         03  WK-CNTL-ASGN-QUAL.
034700             04  WK-CNTL-ASGN-QUAL-1-2   PIC X(2).
034800             04  WK-CNTL-ASGN-QUAL-3-4   PIC X(2).
034900             04  WK-CNTL-ASGN-QUAL-5-6   PIC X(2).
035000             04  WK-CNTL-ASGN-QUAL-7-8   PIC X(2).
035100     02  WK-CNTL-ASSIGN-QUAL-TAB
035200         REDEFINES WK-CNTL-ASSIGN.
035300         03  WK-CNTL-ASGN-TYPE           PIC X.
035400         03  WK-CNTL-ASGN-POSITION OCCURS 6 TIMES.
035500             04  WK-CNTL-ASGN-POS        PIC X.
035600         03  WK-CNTL-FILLER              PIC XX.
035700     02  FILLER                          PIC X(5).
035800
035900*C1067 - 05/12/15 - BEG
036000 01  WK-CNTL-MC-CNTLKEY.
036100     02  WK-CNTL-MC-REC-TYPE         PIC X(002).
036200     02  WK-CNTL-MC-KEY.
036300         03  WK-CNTL-MC-CODE         PIC X(004).
036400         03  WK-CNTL-MC-TYPE-SVC     PIC X(002).
036500         03  WK-CNTL-MC-DIST         PIC X(002).
036600         03  WK-CNTL-MC-SDIST        PIC X(002).
036700         03  WK-CNTL-MC-XB           PIC X(002).
036800         03  WK-CNTL-MC-CONS         PIC X(002).
036900         03  FILLER                  PIC X(004).
037000*C1067 - 05/12/15 - END
037100 01  WS-ADJUSTED-DATE-TIME.
037200     05  WS-ADJUSTED-CC              PIC X(002) VALUE SPACES.
037300     05  WS-ADJUSTED-DATE            PIC X(006) VALUE SPACES.
037400     05  WS-ADJUSTED-TIME.
037500         10  WS-ADJUSTED-HR          PIC X(002) VALUE SPACES.
037600         10  WS-ADJUSTED-MN          PIC X(002) VALUE SPACES.
037700
037800 01  WS-SHORT-CALL-DATE-TIME.
037900     05  WS-SHORT-CALL-CC        PIC X(002) VALUE SPACES.
038000     05  WS-SHORT-CALL-DATE      PIC X(006) VALUE SPACES.
038100     05  WS-SHORT-CALL-TIME.
038200         10  WS-SHORT-CALL-HR    PIC X(002) VALUE SPACES.
038300         10  WS-SHORT-CALL-MN    PIC X(002) VALUE SPACES.
038400
038500 01  DEFAULT-LEAD-TIME               PIC X(4)   VALUE ZEROES.
038600
038700*C1067-BEG
038800*01  WS-FUNCTION-TABLE-SIZE          PIC S9(04) COMP VALUE +26.
038900 01  WS-FUNCTION-TABLE-SIZE          PIC S9(04) COMP VALUE +27.
039000*C1067-END
039100 01  WS-FUNCTION-TABLE.
039200     05  FILLER                      PIC X(025)
039300         VALUE 'CALL A NORMAL CALL       '.
039400     05  FILLER                      PIC X(025)
039500         VALUE 'FILL A 1ST VACANCY FILL  '.
039600     05  FILLER                      PIC X(025)
039700         VALUE 'OFF  A LAYOFF            '.
039800     05  FILLER                      PIC X(025)
039900         VALUE 'RJSU A REJECT EMP SUPV   '.
040000*C1067-BEG
040100     05  FILLER                      PIC X(025)
040200         VALUE 'RJNR A REJECT EMP NOT RES'.
040300*C1067-END
040400     05  FILLER                      PIC X(025)
040500         VALUE 'RJNW A REJECT NO WORK    '.
040600     05  FILLER                      PIC X(025)
040700         VALUE 'RJRT A REJECT RESTRICTION'.
040800     05  FILLER                      PIC X(025)
040900         VALUE 'HELP A MANUAL OVERRIDE   '.
041000     05  FILLER                      PIC X(025)
041100         VALUE 'RJNQ A REJECT EMP NO QUAL'.
041200     05  FILLER                      PIC X(025)
041300         VALUE 'ATBU A ATTEMPT BUSY      '.
041400     05  FILLER                      PIC X(025)
041500         VALUE 'ATNA A ATTEMPT NO ANSWER '.
041600     05  FILLER                      PIC X(025)
041700         VALUE 'CDSP A CALL DH SEP PVT AU'.
041800     05  FILLER                      PIC X(025)
041900         VALUE 'CDSC A CALL DH SEP CAB   '.
042000     05  FILLER                      PIC X(025)
042100         VALUE 'CDCP A COMBINE/DH/SVC PVT'.
042200     05  FILLER                      PIC X(025)
042300         VALUE 'CDCC A COMBINE/DH/SVC CAB'.
042400     05  FILLER                      PIC X(025)
042500         VALUE 'RJHS A REJECT HRS SERVICE'.
042600     05  FILLER                      PIC X(025)
042700         VALUE 'REST A DISPLAY HRS SVC   '.
042800     05  FILLER                      PIC X(025)
042900         VALUE 'CBCK A CALLBACK          '.
043000     05  FILLER                      PIC X(025)
043100         VALUE 'VCLL U IVR CALL          '.
043200     05  FILLER                      PIC X(025)
043300         VALUE 'VAOT U IVR CALL OVERTIME '.
043400     05  FILLER                      PIC X(025)
043500         VALUE 'VDSP U IVR-CLL DH SEP PVT'.
043600     05  FILLER                      PIC X(025)
043700         VALUE 'VDSC U IVR-CLL DH SEP CAB'.
043800     05  FILLER                      PIC X(025)
043900         VALUE 'VDCP U IVR-COMB/DH/SV PVT'.
044000     05  FILLER                      PIC X(025)
044100         VALUE 'VDCC U IVR-COMB/DH/SV CAB'.
044200     05  FILLER                      PIC X(025)
044300         VALUE 'HOS  A DISPLAY HOS INFO  '.
044400     05  FILLER                      PIC X(025)
044500         VALUE 'VCAN U IVR-CANCEL DH HOME'.
044600     05  FILLER                      PIC X(025)
044700*CNC0600-B
044800*        VALUE '                         '.
044900         VALUE 'HOSO A HOS OVERRIDE RULE '.
045000*CNC0600-E
045100 01  FILLER REDEFINES WS-FUNCTION-TABLE.
045200*C1067-BEG
045300*    05  WS-FUNC-ARRAY                          OCCURS 26 TIMES.
045400     05  WS-FUNC-ARRAY                          OCCURS 27 TIMES.
045500*C1067-END
045600         10  WS-FUNC-CODE            PIC X(004).
045700         10  FILLER                  PIC X(001).
045800         10  WS-FUNC-USAGE           PIC X(001).
045900             88  UFP-USAGE                   VALUE 'A', 'U', 'R'.
046000             88  LOCAL-USAGE                 VALUE 'A', 'O', 'R'.
046100             88  YARD-USAGE                  VALUE 'A', 'Y'.
046200             88  ROAD-USAGE                  VALUE 'A', 'R'.
046300             88  ALL-USAGE                   VALUE 'A'.
046400         10  FILLER                  PIC X(001).
046500         10  WS-FUNC-DESC            PIC X(018).
046600
046700 01  ENTER-INFO-MSG.
046800     05  FILLER                      PIC X(048) VALUE
046900         'PLEASE ENTER DEADHEAD ASSIGNMENT INFORMATION'.
047000
047100 01  IVR-FUNCTION-LINE               PIC X(059) VALUE
047200     'VCLL-VAOT-VDSP-VDSC-VDCP-VDCC-VCAN                        '.
047300 01  X-TIME-CENT.
047400     05  X-CE                        PIC 9(002) VALUE ZEROS.
047500     05  X-TIME-DATE.
047600         10  X-YR                    PIC 9(002) VALUE ZEROS.
047700         10  X-MO                    PIC 9(002) VALUE ZEROS.
047800         10  X-DY                    PIC 9(002) VALUE ZEROS.
047900     05  X-HR-MN.
048000         10  X-HR                    PIC 9(002) VALUE ZEROS.
048100         10  X-MN                    PIC 9(002) VALUE ZEROS.
048200 01  FILLER REDEFINES X-TIME-CENT.
048300     05  X-CCYY                      PIC 9(004).
048400     05  FILLER                      PIC 9(008).
048500
048600 01  WORK-DATE-TIME-CENT.
048700     05  WORK-CENT                   PIC 9(002) VALUE ZEROS.
048800     05  WORK-DATE-TIME.
048900         10  WORK-DATE.
049000             15  WORK-YR             PIC 9(002) VALUE ZEROS.
049100             15  WORK-MO             PIC 9(002) VALUE ZEROS.
049200             15  WORK-DY             PIC 9(002) VALUE ZEROS.
049300         10  WORK-TIME.
049400             15  WORK-HR             PIC 9(002) VALUE ZEROS.
049500             15  WORK-MN             PIC 9(002) VALUE ZEROS.
049600
049700 01  CONV-TIME.
049800     05  CONV-DATE.
049900         10  CONV-YR                 PIC 9(002) VALUE ZEROS.
050000         10  CONV-MO                 PIC 9(002) VALUE ZEROS.
050100         10  CONV-DY                 PIC 9(002) VALUE ZEROS.
050200     05  CONV-HR-MN.
050300         10  CONV-HR                 PIC 9(002) VALUE ZEROS.
050400         10  CONV-MN                 PIC 9(002) VALUE ZEROS.
050500
050600 01  WORK-HIST-TIMEX.
050700     05  WORK-HIST-TIME              PIC 9(012) VALUE ZEROS.
050800     05  WORK-HIST-TIME-TIE          PIC 9(002) VALUE ZEROS.
050900
051000 01  WS-NEW-ON-DUTY-DATE-TIME.
051100     05  WS-NEW-ON-DUTY-DATE         PIC X(006).
051200     05  WS-NEW-ON-DUTY-TIME         PIC X(004).
051300 01  WS-PREV-ON-DUTY-DATE-TIME.
051400     05  WS-PREV-ON-DUTY-DATE        PIC X(006).
051500     05  WS-PREV-ON-DUTY-TIME        PIC X(004).
051600 01  WS-PREV-OFF-DUTY-DATE-TIME.
051700     05  WS-PREV-OFF-DUTY-DATE       PIC X(006).
051800     05  WS-PREV-OFF-DUTY-TIME       PIC X(004).
051900 01  WS-PREV-ASGN-TIME-ZONE          PIC X(001) VALUE SPACES.
052000
052100 01  WS-CALL-MINUS-LEAD                         VALUE SPACES.
052200     05  WS-CALL-ML-DATE             PIC X(006).
052300     05  WS-CALL-ML-TIME             PIC X(004).
052400
052500 01  WS-LEAD-TIME.
052600     05  WS-LEAD-TIME-HR             PIC 9(002) VALUE ZEROS.
052700     05  WS-LEAD-TIME-MN             PIC 9(002) VALUE ZEROS.
052800 01  WS-LEAD-TIME-MN3                PIC 9(003) VALUE ZEROS.
052900
053000 01  TIE-UP-TIME.
053100     05  TIE-UP-DATE.
053200         10  TIE-UP-CEYR.
053300             15  TIE-UP-CE           PIC 9(002) VALUE ZEROS.
053400             15  TIE-UP-YR           PIC 9(002) VALUE ZEROS.
053500         10 TIE-UP-CENTYR REDEFINES TIE-UP-CEYR
053600                                     PIC 9(004).
053700         10  TIE-UP-MO               PIC 9(002) VALUE ZEROS.
053800         10  TIE-UP-DY               PIC 9(002) VALUE ZEROS.
053900     05  TIE-UP-HRMN.
054000         10  TIE-UP-HR               PIC 9(002) VALUE ZEROS.
054100         10  TIE-UP-MN               PIC 9(002) VALUE ZEROS.
054200
054300 01  LEAP-YEARS                      PIC 9(002) VALUE ZEROS.
054400*    88 LEAP-YEAR               VALUES 84, 88, 92, 96, 00.
054500     88 LEAP-YEAR               VALUES 00, 04, 08, 12, 16, 20.
054600
054700 01  CODE-AREA                                  VALUE SPACES.
054800     05  CA-1.
054900         10  FILLER                  PIC X(004).
055000             88 DEADHEAD-HOME                   VALUE 'HOME'.
055100         10  FILLER                  PIC X(004).
055200
055300 01  NORMAL-ASGNMT                              VALUE SPACES.
055400     05  NA-DIST                     PIC X(002).
055500     05  NA-SUB-DIST                 PIC X(002).
055600     05  NA-AREA.
055700         10  NA-1                    PIC X(006).
055800         10  NA-2 REDEFINES NA-1.
055900             15  NA-POOL             PIC X(002).
056000             15  NA-TURN             PIC X(004).
056100         10  NA-3 REDEFINES NA-1.
056200             15  NA-FILLER           PIC X(002).
056300             15  NA-XB-TURN          PIC X(004).
056400         10  NA-CC                   PIC X(002).
056500
056600 01  TEMPORARY-ASGNMT                           VALUE SPACES.
056700     05  TA-DIST                     PIC X(002).
056800     05  TA-SUB-DIST                 PIC X(002).
056900     05  TA-AREA.
057000         10  TA-1                    PIC X(006).
057100         10  TA-2 REDEFINES TA-1.
057200             15  TA-POOL             PIC X(002).
057300             15  TA-TURN             PIC X(004).
057400         10  TA-3 REDEFINES TA-1.
057500             15  TA-FILLER           PIC X(002).
057600             15  TA-XB-TURN          PIC X(004).
057700         10  TA-CC                   PIC X(002).
057800
057900 01  SAVE-NORM-ASGN-KEY              PIC X(024) VALUE SPACES.
058000 01  SAVE-TEMP-ASGN-KEY              PIC X(024) VALUE SPACES.
058100 01  HOLD-TASK-KEY                   PIC X(041) VALUE SPACES.
058200
058300 01  ON-DUTY-ASGNMT                             VALUE SPACES.
058400     05  OD-DIST                     PIC X(002).
058500     05  OD-SUB-DIST                 PIC X(002).
058600     05  OD-AREA.
058700         10  OD-1                    PIC X(006).
058800         10  OD-2 REDEFINES OD-1.
058900             15  OD-POOL             PIC X(002).
059000             15  OD-TURN             PIC X(004).
059100         10  OD-CC                   PIC X(002).
059200
059300 01  SAVE-ASGN-AREA                  PIC X(128) VALUE SPACES.
059400 01  SAVE-TRCN-FILE                  PIC X(350) VALUE SPACES.
059500
059600 01  XXXX-ASGNKEY1                              VALUE SPACES.
059700     05  XX-ASGN-JOB-TYPE            PIC X(001).
059800     05  XX-ASGN-DIST                PIC X(002).
059900     05  XX-ASGN-SUB-DIST            PIC X(002).
060000     05  XX-ASGN-JOB                 PIC X(008).
060100     05  XX-ASGN-REC-TYPE            PIC X(001).
060200     05  XX-ASGN-DATE-TIME           PIC X(010).
060300 01  XXXX-ASGNKEY2.
060400     05  XX-ASGN-EMP                 PIC 9(009) VALUE ZEROS.
060500     05  XX-ASGN2-REC-TYPE           PIC X(001) VALUE SPACES.
060600     05  XX-ASGN2-DATE-TIME          PIC 9(010) VALUE ZEROS.
060700
060800 01  WS-ASGN-MERG-CLASS              PIC XX   VALUE SPACES.
060900
061000 01  WS-MERG-KEY.
061100     02  WS-MERG-DIST                PIC XX   VALUE SPACE.
061200     02  WS-MERG-SUB                 PIC XX   VALUE SPACE.
061300     02  WS-MERG-REST.
061400         03  WS-MERG-POOL            PIC XX   VALUE SPACE.
061500         03  FILLER                  PIC X(4) VALUE SPACE.
061600     02  FILLER                      PIC X(2).
061700
061800 01  WORK-AJ-KEY                                VALUE SPACES.
061900     02  WORK-AJ-DIST                PIC X(002).
062000     02  WORK-AJ-SUB-DIST            PIC X(002).
062100     02  WORK-ASSIGNMENT.
062200         03  WORK-AJ-JOB-NO          PIC X(006).
062300         03  WORK-AJ-CC              PIC X(002).
062400
062500 01  WORK-UFPTURN-KEY                           VALUE SPACES.
062600     05  WORK-UFP-DIST               PIC X(002).
062700     05  WORK-UFP-SUB-DIST           PIC X(002).
062800     05  WORK-UFP-AREA-A.
062900         10  WORK-UFP.
063000             15  WORK-UFP-POOL       PIC X(002).
063100             15  WORK-UFP-TURN.
063200                 20  WORK-UFP-ALPHA  PIC X(002).
063300                 20  WORK-UFP-NBR    PIC X(002).
063400         10  WORK-UFP-CC             PIC X(002).
063500     66  WORK-UFP-W-O-CC RENAMES WORK-UFP-DIST THRU WORK-UFP.
063600
063700 01  WORK-WS-UFP                                VALUE SPACES.
063800     05  WORK-UFPPOS-AREA.
063900         10  WORK-DIST               PIC X(002).
064000         10  WORK-SUB-DIST           PIC X(002).
064100         10  WORK-POOL-NAME          PIC X(002).
064200         10  WORK-POOL-CRAFT-CODE    PIC X(002).
064300         10  WORK-IN-OUT-FLAG.
064400             15  FILLER              PIC 9(001).
064500             15  IN-OUT-TERM         PIC 9(001).
064600         10  WORK-POS-ON-OFF         PIC X(001).
064700         10  WORK-POSITION-TIME      PIC 9(014).
064800     05  WORK-UFPTURN-AREA.
064900         10  WORK-DIST2              PIC X(002).
065000         10  WORK-SUB-DIST2          PIC X(002).
065100         10  WORK-POOL-NAME2         PIC X(002).
065200         10  WORK-TURN-NBR           PIC X(004).
065300         10  WORK-POOL-CRAFT-CODE2   PIC X(002).
065400     05  FILLER                      PIC X(011).
065500     05  WORK-UFPTRAIN-AREA.
065600         10  WORK-DIST3              PIC X(002).
065700         10  WORK-SUB-DIST3          PIC X(002).
065800         10  WORK-POOL-NAME3         PIC X(002).
065900         10  WORK-TRAIN-SYMBOL       PIC X(007).
066000         10  WORK-POOL-CRAFT-CODE3   PIC X(002).
066100     05  FILLER                      PIC X(193).
066200
066300 01  MONTH-VALUES.
066400     05  MONTHX.
066500         10  JAN                     PIC 9(002) VALUE 31.
066600         10  FEB                     PIC 9(002) VALUE 28.
066700         10  MAR                     PIC 9(002) VALUE 31.
066800         10  APR                     PIC 9(002) VALUE 30.
066900         10  MAY                     PIC 9(002) VALUE 31.
067000         10  JUN                     PIC 9(002) VALUE 30.
067100         10  JUL                     PIC 9(002) VALUE 31.
067200         10  AUG                     PIC 9(002) VALUE 31.
067300         10  SEP                     PIC 9(002) VALUE 30.
067400         10  OCT                     PIC 9(002) VALUE 31.
067500         10  NOV                     PIC 9(002) VALUE 30.
067600         10  DEC                     PIC 9(002) VALUE 31.
067700     05  MONTHZ REDEFINES MONTHX.
067800         10  MONTH                   PIC 9(002) OCCURS 12 TIMES.
067900
068000 01  P08Z-TSQ-ID.
068100     05  P08Z-TSQ-TRAN               PIC X(004) VALUE 'PZ08'.
068200     05  P08Z-TSQ-TERM               PIC X(004) VALUE SPACES.
068300 01  P08Z-TSQ-LGTH                   PIC S9(04) COMP VALUE +5546.
068400 01  P08Z-TSQ-ITEM                   PIC S9(04) COMP VALUE +1.
068500 01  P08Z-TSQ-AREA.
068600     05  P08Z-TSQ-DATA               PIC X(3000) VALUE SPACES.
068700     05  P08Z-TSQ-PSTCOMM-AREA       PIC X(0170) VALUE SPACES.
068800     05  P08Z-TSQ-SCREEN-AREA        PIC X(2374) VALUE SPACES.
068900     05  P08Z-TSQ-FUNC-SUB           PIC 9(0002) VALUE ZEROES.
069000
069100 01  WORK-PASS-KEY.
069200     05  WORK-NAME                   PIC X(26)   VALUE SPACES.
069300     05  WORK-NUMBER                 PIC X(09)   VALUE SPACES.
069400*CNC0600-NXA-B
069500 01  WS-UD-MESG.
069600     05 WS-TEXT                      PIC X(38)
069700        VALUE 'EMPLOYEE IS ON UNDISTURBED REST UNTIL '.
069800     05 WS-TIME1.
069900        06 WS-UD-HH                  PIC X(02).
070000        06 FILLER                    PIC X(01)   VALUE ':'.
070100        06 WS-UD-MM                  PIC X(02).
070200*CNC0600-NXA-E
070300*CNLD-207-DXC-B
070400 01  WS-RB-1-MESG.
      *CNLD-244-B #3 CNC0600
070500*    05 WS-RB-1-TEXT                 PIC X(40)
070600*       VALUE 'EMP WILL RESET SHORTLY,CAN BE CALLED AT '.
012820     05 WS-RB-1-TEXT-1               PIC X(41)
012830        VALUE 'EMP WILL RESET SHORTLY, CAN BE CALLED AT '.
      *CNLD-244-E
070700     05 WS-RB-1-TIME.
070800        06 WS-RB-1-HH                PIC X(02)   VALUE SPACES.
070900        06 FILLER                    PIC X(01)   VALUE ':'.
071000        06 WS-RB-1-MM                PIC X(02)   VALUE SPACES.
071100*
071200 01  WS-RB-2-MESG.
071300     05 WS-RB-2-TEXT-1               PIC X(18)
071400        VALUE 'EMP WILL RESET IN '.
071500     05 WS-RB-2-MM                   PIC X(02).
071600     05 WS-RB-2-TEXT-2               PIC X(03)
071700        VALUE ' MN'.
      *CNLD-244-B #3 CNC0600
071800*    05 WS-RB-2-TEXT-3               PIC X(34)
071900*       VALUE ' CONSIDER DELAYING TRAIN ORDER BY '.
012950     05 WS-RB-2-TEXT-3               PIC X(35)
012960        VALUE ' CONSIDER DELAYING ON-DUTY TIME BY '.
      *CNLD-244-E
072000     05 WS-RB-2-MM-1                 PIC X(02).
072100     05 WS-RB-2-TEXT-2               PIC X(03)
072200        VALUE ' MN'.
072300 01  WS-SAVE-REST-STATUS             PIC X(01) VALUE SPACES.
072400*CNLD-207-DXC-E
072500******************************************************************
072600***                  TEMPORARY STORAGE QUEUE                   ***
072700******************************************************************
072800 01  P08ZTSQ-QUEUE-ITEM         PIC S9(4)  COMP VALUE +1.
072900 01  P08ZTSQ-MAP-QUEUE-ID.
073000     05  P08ZTSQ-MAP-QUEUE      PIC X(4)   VALUE '08ZM'.
073100     05  P08ZTSQ-MAP-TERM-ID    PIC X(4)   VALUE SPACES.
073200 01  P08ZTSQ-CA-QUEUE-ID.
073300     05  P08ZTSQ-CA-QUEUE       PIC X(4)   VALUE '08ZC'.
073400     05  P08ZTSQ-CA-TERM-ID     PIC X(4)   VALUE SPACES.
073500 01  P08ZTSQ-QLGTH              PIC S9(4)  COMP VALUE +1.
073600*****************************************************************
073700***                 I/O STATUS CHECK FIELDS
073800*****************************************************************
073900 01  WS-RESPONSE                  PIC S9(008) COMP   VALUE ZEROS.
074000 01  FILE-STATUS                  PIC  9(004) VALUE ZEROS.
074100     COPY IOCODES.
074200*****************************************************************
074300***                    COMMAREA COPYBOOKS
074400*****************************************************************
074500     COPY PSTCOMM.
074600*CNC0600-B
074700     COPY P18CCOMM.
074800*CNC0600-E
074900     COPY P997COMM.
075000     COPY P998COMM.
075100     COPY P08COMM.
075200     05  P08ZCOMM-AREA.
075300         10  P08ZCA-EMP-NO                   PIC X(009).
075400         10  P08ZCA-LOCK-FLAG                PIC X(001).
075500         10  P08ZCA-DHD-TYPE                 PIC X(001).
075600         10  P08ZCA-EFF-TIME.
075700             15  P08ZCA-EFF-DATE             PIC X(006).
075800             15  P08ZCA-EFF-HRMN             PIC X(004).
075900         10  P08ZCA-CONV-TIME.
076000             15  P08ZCA-CONV-DATE            PIC X(006).
076100             15  P08ZCA-CONV-HRMN            PIC X(004).
076200         10  P08ZCA-ASSIGNMENT.
076300             15  P08ZCA-ASGN-DIST            PIC X(002).
076400             15  P08ZCA-ASGN-SUB-DIST        PIC X(002).
076500             15  P08ZCA-ASSIGN.
076600                 20  P08ZCA-ASGN             PIC X(006).
076700                     88  P08ZCA-DHD-HOME          VALUE 'HOME  '.
076800                 20  P08ZCA-ASGN-CC          PIC X(002).
076900         10  P08ZCA-RJHS-EMP-NO              PIC X(009).
077000         10  P08ZCA-SCREEN-COMMAREA.
077100             15  P08ZCA-CALL-SET-CODE        PIC X(001).
077200                 88  P08ZCA-CALL-SET              VALUE 'Y'.
077300             15  P08ZCA-SCREEN-AREA.
077400                 25  P08ZCA-DEC-KEY.
077500                     30  FILLER              PIC X(006).
077600                     30  FILLER              PIC X(001).
077700                         88 P08ZCA-BLANKABLE-ASGN VALUE 'Y'.
077800                     30  FILLER              PIC X(013).
077900                 25  P08ZCA-LAST-POS         PIC X(028).
078000                 25  P08ZCA-LAST-SEN         PIC X(008).
078100                 25  P08ZCA-LAST-STARTS      PIC X(002).
078200             15  P08ZCA-LEAD-TIME            PIC X(004).
078300             15  P08ZCA-FASTSLOW-BOARD       PIC X(001).
078400                 88  P08ZCA-FROM-FAST-BOARD      VALUE 'F'.
078500                 88  P08ZCA-FROM-SLOW-BOARD      VALUE 'S'.
078600             15  P08ZCA-EMP-RESTR            PIC X(001).
078700                 88  P08ZCA-EMP-RESTRICTED       VALUE '1'.
078800             15  P08ZCA-SAVE-CALL-DATE-TIME.
078900                 25  P08ZCA-SAVE-CALL-DATE.
079000                     30  P08ZCA-SAVE-CALL-YR   PIC XX.
079100                     30  P08ZCA-SAVE-CALL-MO   PIC XX.
079200                     30  P08ZCA-SAVE-CALL-DY   PIC XX.
079300                 25  P08ZCA-SAVE-CALL-TIME.
079400                     30  P08ZCA-SAVE-CALL-HR   PIC XX.
079500                     30  P08ZCA-SAVE-CALL-MN   PIC XX.
079600             15  P08ZCA-SHORTCALL-DATE-TIME.
079700                 25  P08ZCA-SHORTCALL-DATE.
079800                     30  P08ZCA-SHORTCALL-YR   PIC XX.
079900                     30  P08ZCA-SHORTCALL-MO   PIC XX.
080000                     30  P08ZCA-SHORTCALL-DY   PIC XX.
080100                 25  P08ZCA-SHORTCALL-TIME.
080200                     30  P08ZCA-SHORTCALL-HR   PIC XX.
080300                     30  P08ZCA-SHORTCALL-MN   PIC XX.
080400             15  P08ZCA-DEC-FURTHER-N          PIC X(001).
080500             15  P08ZCA-SAVE-CBCK-FLAG         PIC X(001).
080600*CNC0600-B
080700             15  P08ZCA-HOSO-ALLOW-FL        PIC X(001).
080800                 88  P08ZCA-HOSO-ALLOW           VALUE 'Y'.
080900             15  P08ZCA-HOSO-DONE-FL         PIC X(001).
081000                 88  P08ZCA-HOSO-DONE            VALUE 'Y'.
081100*            15  FILLER                      PIC X(009).
081200             15  FILLER                      PIC X(007).
081300*CNC0600-E
081400         10  P08ZCA-RESUB-FLAG               PIC X(001).
081500             88  P08ZCA-RESUB                    VALUE 'Y'.
081600         10  P08ZCA-FROM-EXECUTE-PGMS        PIC X(001).
081700             88  P08ZCA-FROM-03A-04S             VALUE 'Y'.
081800*****************************************************************
081900***                     MAP AREA COPYBOOK
082000*****************************************************************
082100     COPY PSM08ZRE.
082200*****************************************************************
082300***                   PROGRAM NAMES COPYBOOKS
082400*****************************************************************
082500     COPY PSTCB08Z.
082600     COPY PSTCB03.
082700     COPY PSTCB03A.
082800     COPY PSTCB04S.
082900     COPY PSTCB997.
083000     COPY PSTCB998.
083100*CNC0600-B
083200     COPY PSTCB18C.
083300*CNC0600-E
083400*****************************************************************
083500***                 CALLED ROUTINES COPYBOOKS.
083600*****************************************************************
083700     COPY PSTERAR.
083800     COPY PS52COMM.
083900     COPY P902COMM.
084000     COPY P903COMM.
084100     COPY P917COMM.
084200     COPY P919COMM.
084300     COPY P920COMM.
084400     COPY P922COMM.
084500     COPY P923COMM.
084600     COPY P925COMM.
084700     COPY P927COMM.
084800     COPY P938COMM.
084900     COPY P943COMM.
085000     COPY P947COMM.
085100     COPY P956COMM.
085200     COPY P980COMM.
085300     COPY PS94COMM.
085400     COPY P0ESCOMM.
085500*****************************************************************
085600***                     FILE COPYBOOKS
085700*****************************************************************
085800     COPY WSMSTR.
085900*CNC0600-NXA-B
086000     COPY WSMSTR3.
086100*CNC0600-NXA-E
086200     COPY WSCNTL.
086300     COPY WSUFP.
086400     COPY WSAJ.
086500     COPY WSAHIST.
086600     COPY WSASGN.
086700     COPY WSDEC.
086800     COPY WSTASK.
086900     COPY WSTRCN.
087000     COPY WSTKCR.
087100     COPY WSQUAL.
087200     COPY WSVRUINF.
087300     COPY WSTELE.
087400
087500     EXEC SQL INCLUDE HSTV     END-EXEC.
087600     EXEC SQL INCLUDE HSTWS    END-EXEC.
087700
087800*****************************************************************
087900***                     MISC. COPYBOOKS
088000*****************************************************************
088100     COPY WSAJDEFN.
088200     COPY WSEDDATE.
088300     COPY WSEDTIME.
088400     COPY WSLOCODE.
088500     COPY WSMSG.
088600     COPY PSTATTR.
088700     COPY PSTKEYS.
088800     COPY WSBIF.
088900     COPY WSZONE.
089000     COPY PSTCCRFT.
089100     COPY WSMSCALL.
089200     COPY WSBUFFER.
089300     COPY WSSYDTTM.
089400     COPY CALLFUNC.
089500
089600     EXEC SQL INCLUDE SQLCA    END-EXEC.
089700     EXEC SQL INCLUDE WSCOMMON END-EXEC.
089800
089900 LINKAGE SECTION.
090000 01  DFHCOMMAREA.
090100     05  LK-PST-CA              PIC X(170).
090200     05  LK-P08Z-CA             PIC X(150).
090300
090400 PROCEDURE DIVISION.
090500*
090600 P0000-MAINLINE.
090700*
090800     EXEC CICS IGNORE CONDITION
090900               ERROR
091000     END-EXEC
091100     EXEC CICS HANDLE ABEND
091200               LABEL(P9999-GOT-PROBLEM)
091300     END-EXEC
091400     COPY ABSTIME.
091500     IF EIBCALEN = ZERO
091600        PERFORM P9990-CLEAR-SCREEN
091700     END-IF
091800     MOVE LK-PST-CA  TO PSTCOMM-AREA
091900     IF EIBCALEN > PSTCOMM-LGTH
092000        MOVE LK-P08Z-CA TO P08ZCOMM-AREA
092100     ELSE
092200        MOVE SPACES     TO P08ZCOMM-AREA
092300     END-IF
092400     IF EIBTRNID NOT = P08Z-TRAN
092500        MOVE LOW-VALUES      TO PSTS08Z
092600        SET CREATE-SCREEN    TO TRUE
092700        IF EIBTRNID = P998-TRAN
092800           MOVE P998CA-CURSOR-POS TO EIBCPOSN
092900           PERFORM P7010-READ-TSQUEUE
093000           PERFORM P9000-SEND-MAP-AND-RETURN
093100        END-IF
093200
093300        IF EIBTRNID = P997-TRAN
093400           PERFORM P9600-READ-TSQUEUE
093500           MOVE P08Z-TSQ-DATA            TO PSTS08Z
093600           EXEC CICS DELETEQ TS
093700                     QUEUE(P08Z-TSQ-ID)
093800           END-EXEC
093900           IF P997CA-RECORD-SELECTED
094000              MOVE P997CA-PASS-KEY       TO WORK-PASS-KEY
094100              MOVE P08Z-TSQ-PSTCOMM-AREA TO PSTCOMM-AREA
094200              MOVE P08Z-TSQ-SCREEN-AREA  TO P08ZCA-SCREEN-COMMAREA
094300              PERFORM P9050-RESET-ATTRIBUTES
094400              MOVE 'HELP'                TO SCR08Z-FUNC
094500              MOVE WORK-NAME             TO SCR08Z-NAME
094600              IF P08CA-IVR-CALL-ACTIVE
094700                 MOVE IVR-FUNCTION-LINE  TO SCR08Z-IVR-FUNC-LINE
094800              ELSE
094900                 MOVE SPACES             TO SCR08Z-IVR-FUNC-LINE
095000              END-IF
095100              MOVE -1                    TO SCR08Z-FUNC-CURSOR
095200*                  'PRESS ENTER TO PROCESS HELP'
095300              MOVE 'P167'                TO MSGLOG-CODE
095400              PERFORM P9000-SEND-MAP-AND-RETURN
095500           ELSE
095600              MOVE P08Z-TSQ-PSTCOMM-AREA TO PSTCOMM-AREA
095700              MOVE P08Z-TSQ-SCREEN-AREA  TO P08ZCA-SCREEN-COMMAREA
095800              PERFORM P9050-RESET-ATTRIBUTES
095900              IF P08CA-IVR-CALL-ACTIVE
096000                 MOVE IVR-FUNCTION-LINE  TO SCR08Z-IVR-FUNC-LINE
096100              ELSE
096200                 MOVE SPACES             TO SCR08Z-IVR-FUNC-LINE
096300              END-IF
096400              MOVE -1                    TO SCR08Z-FUNC-CURSOR
096500              MOVE SPACES                TO SCR08Z-ERRORMSG
096600              PERFORM P9000-SEND-MAP-AND-RETURN
096700           END-IF
096800        END-IF
096900*CNC0600-B
097000        IF EIBTRNID = P18C-TRAN
097100           PERFORM P9600-READ-TSQUEUE
097200           MOVE LOW-VALUES               TO PSTS08Z
097300           MOVE P08Z-TSQ-DATA            TO PSTS08Z
097400           EXEC CICS DELETEQ TS
097500                     QUEUE(P08Z-TSQ-ID)
097600           END-EXEC
097700           MOVE P08Z-TSQ-PSTCOMM-AREA    TO PSTCOMM-AREA
097800           MOVE P08Z-TSQ-SCREEN-AREA     TO P08ZCOMM-AREA
097900           SET P08ZCA-HOSO-DONE          TO TRUE
098000           PERFORM P9050-RESET-ATTRIBUTES
098100*          EMP HOS OVERRIDE COMPLETE, ENTER FUNCTION DESIRED
098200           MOVE 'E370'                   TO MSGLOG-CODE
098300           MOVE -1                       TO SCR08Z-FUNC-CURSOR
098400           PERFORM P9000-SEND-MAP-AND-RETURN
098500        END-IF
098600*CNC0600-E
098700
098800        IF EIBTRNID = P03A-TRAN
098900                   OR P04S-TRAN
099000           MOVE P08CA-TASK-KEY   TO TASK-LOCATION-KEY
099100                                    TASKTIME
099200                                    VRUINFO-KEY-AREA
099300           PERFORM P8300-READ-TASK-BY-TIME
099400           PERFORM P9330-READ-VRUINFO
099500*          MOVE TASK-FIELDS TO SCREEN
099600           MOVE PSTCA-DIST            TO SCR08Z-DIST
099700           MOVE PSTCA-SUB-DIST        TO SCR08Z-SUB-DIST
099800           MOVE TASK-DHD-TYPE         TO SCR08Z-TYPE
099900           MOVE TASK-CALL-TRAIN       TO SCR08Z-CODE
100000           MOVE TASK-DIST             TO SCR08Z-SEL-DIST
100100                                         WS-TZ-DIST
100200           MOVE TASK-SUB-DIST         TO SCR08Z-SEL-SDIST
100300                                         WS-TZ-SUB-DIST
100400           MOVE TASK-CALL-ORDER-DATE  TO SCR08Z-DATE
100500           MOVE TASK-CALL-ORDER-TIME  TO SCR08Z-TIME
100600           MOVE TASK-DHD-MILES        TO SCR08Z-MILES
100700           MOVE TASK-DHD-DURATION     TO SCR08Z-HRMN
100800           MOVE TASK-MODE-OF-TRANSPORTATION
100900                                      TO SCR08Z-MODE
101000           MOVE TASK-DHD-FURTHER-N    TO SCR08Z-FURTHER-N
101100
101200*          MOVE TASK-FIELDS TO P08ZCOMM AREA
101300           MOVE TASK-INFO             TO P08CA-PROFILE-KEY
101400*#1501
101500           PERFORM P0110-GET-LOCAL-TIME-ZONE
101600           PERFORM P0500-CONVERT-DATE
101700           PERFORM P3100-EDIT-DATE-AND-TIME
101800           MOVE TASK-DHD-EMP-NBR      TO P08ZCA-EMP-NO
101900*          MOVE                       TO P08ZCA-LOCK-FLAG
102000           MOVE TASK-DHD-TYPE         TO P08ZCA-DHD-TYPE
102100           MOVE TASK-DHD-ASSIGNMENT   TO P08ZCA-ASSIGNMENT
102200           MOVE TASK-DHD-RJHS-EMPNO   TO P08ZCA-RJHS-EMP-NO
102300           MOVE TASK-DHD-RJHS-EMPNO   TO P08ZCA-RJHS-EMP-NO
102400           MOVE SPACE                 TO P08ZCA-CALL-SET-CODE
102500           MOVE TASK-DHD-LEAD-TIME    TO P08ZCA-LEAD-TIME
102600           MOVE TASK-DHD-FASTSLOW-BOARD
102700                                      TO P08ZCA-FASTSLOW-BOARD
102800
102900           MOVE TASK-DHD-EMP-NBR      TO EMP-NBR OF WS-MSTR
103000                                         MSTRNBRK
103100           PERFORM P8500-READ-MASTER
103200           MOVE MSTR-IVR-SAVE-DEC-KEY TO P08ZCA-DEC-KEY
103300           MOVE MSTR-IVR-SAVE-LAST-POS
103400                                      TO P08ZCA-LAST-POS
103500           MOVE MSTR-IVR-SAVE-LAST-SEN
103600                                      TO P08ZCA-LAST-SEN
103700           MOVE MSTR-IVR-SAVE-LAST-STARTS
103800                                      TO P08ZCA-LAST-STARTS
103900
104000           PERFORM P4210-SETUP-NAME-INFO
104100           IF TASK-VRU-CALL-FLAG          > SPACES
104200              SET  P08CA-IVR-CALL-ACTIVE TO TRUE
104300              MOVE IVR-FUNCTION-LINE     TO SCR08Z-IVR-FUNC-LINE
104400           END-IF
104500           SET P08ZCA-FROM-03A-04S    TO TRUE
104600           SET P08CA-ORDER-VX         TO TRUE
104700           MOVE SPACES                TO SCR08Z-FUNC
104800           MOVE -1                    TO SCR08Z-FUNC-CURSOR
104900*            'IVR NOT ABLE TO COMPLETE CALL, ENTER NEW FUNCTION'
105000           MOVE 'I598'                TO MSGLOG-CODE
105100           PERFORM P9000-SEND-MAP-AND-RETURN
105200        END-IF
105300
105400        MOVE PSTCA-DIST      TO SCR08Z-DIST
105500        MOVE PSTCA-SUB-DIST  TO SCR08Z-SUB-DIST
105600        MOVE P08CA-PROFILE-KEY   TO TRCNKEY1
105700        PERFORM P8000-READ-TRCNKEY1
105800        MOVE TRCN-DIST       TO SCR08Z-SEL-DIST
105900                                WS-TZ-DIST
106000        MOVE TRCN-SDIST      TO SCR08Z-SEL-SDIST
106100                                WS-TZ-SUB-DIST
106200        MOVE AUTOSKIP-MDT    TO SCR08Z-MILES-ATTR
106300                                SCR08Z-HRMN-ATTR
106400        MOVE SPACES          TO P08ZCOMM-AREA
106500        PERFORM P5110-IVR-PFKEY-EDITS
106600        IF P08CA-IVR-CALL-ACTIVE
106700           MOVE IVR-FUNCTION-LINE TO SCR08Z-IVR-FUNC-LINE
106800        ELSE
106900           MOVE SPACES            TO SCR08Z-IVR-FUNC-LINE
107000        END-IF
107100        MOVE -1              TO SCR08Z-TYPE-CURSOR
107200*            ENTER-INFO-MSG
107300        MOVE 'P032' TO MSGLOG-CODE
107400        PERFORM P0110-GET-LOCAL-TIME-ZONE
107500        PERFORM P0500-CONVERT-DATE
107600        PERFORM P9000-SEND-MAP-AND-RETURN
107700     END-IF
107800     MOVE EIBAID   TO PF-CHECK
107900     IF EXIT-KEY
108000        MOVE EIBTRMID                   TO P08Z-TSQ-TERM
108100        EXEC CICS DELETEQ TS
108200                  QUEUE(P08Z-TSQ-ID)
108300                  RESP(WS-RESPONSE)
108400        END-EXEC
108500        PERFORM P0200-CANCEL-DH
108600        IF  PSTCA-FROM-PROGRAM = P03A-PGM
108700        AND P08CA-ORDER-VX
108800           PERFORM P9130-SETUP-SCR03A
108900        ELSE
109000           IF  PSTCA-FROM-PROGRAM = P04S-PGM
109100           AND P08CA-ORDER-VX
109200              PERFORM P9140-SETUP-SCR04S
109300           ELSE
109400              PERFORM P9100-SETUP-SCR03
109500           END-IF
109600        END-IF
109700     END-IF
109800     PERFORM P0100-PROCESS-INPUT
109900     PERFORM P9000-SEND-MAP-AND-RETURN.
110000*
110100 P0100-PROCESS-INPUT.
110200*
110300     MOVE P08Z-MAP-VERSION(PSTCA-SUB) TO P08Z-MAP
110400     EXEC CICS RECEIVE MAP(P08Z-MAP)
110500                       MAPSET(P08Z-SET)
110600                       INTO(PSTS08Z)
110700                       RESP(WS-RESPONSE)
110800     END-EXEC
110900     MOVE WS-RESPONSE TO FILE-STATUS
111000     IF NOT SUCCESS
111100        MOVE 'P0100' TO ERR-PARAGRAPH
111200        PERFORM P9999-GOT-PROBLEM
111300     END-IF
111400     IF PFKEY1
111500        PERFORM P7000-WRITE-TSQUEUE
111600        PERFORM P9800-SETUP-SCR998
111700     END-IF
111800
111900     IF PFKEY10
112000        IF SCR08Z-FUNC                   = 'HELP'
112100           PERFORM P9600-READ-TSQUEUE
112200*TJR 2/21/2001
112300           MOVE PSTS08Z               TO P08Z-TSQ-DATA
112400           PERFORM P9550-REWRITE-TSQUEUE
112500           PERFORM P9150-SETUP-SCR997
112600        END-IF
112700        MOVE -1                         TO SCR08Z-FUNC-CURSOR
112800*            'CAN ONLY BROWSE WHEN HELPING SOMEONE ON'
112900        MOVE 'C135'                     TO MSGLOG-CODE
113000        PERFORM P9000-SEND-MAP-AND-RETURN
113100     END-IF
113200
113300     MOVE P08CA-PROFILE-KEY             TO TRCNKEY1
113400     PERFORM P8000-READ-TRCNKEY1
113500     MOVE TRCN-DIST                     TO WS-TZ-DIST
113600     MOVE TRCN-SDIST                    TO WS-TZ-SUB-DIST
113700     PERFORM P0110-GET-LOCAL-TIME-ZONE
113800
113900     MOVE SPACES TO SCR08Z-ERRORMSG
114000     EVALUATE TRUE
114100        WHEN ENTER-KEY
114200             IF P08ZCA-LOCK-FLAG         = SPACES OR LOW-VALUES
114300                PERFORM P0500-CONVERT-DATE
114400                PERFORM P3000-EDIT-INPUT-DATA
114500             END-IF
114600             IF P08ZCA-LOCK-FLAG         = 'Y'
114700                MOVE -1                 TO SCR08Z-FUNC-CURSOR
114800*                 'DEADHEAD ALREADY PROCESSED - PRESS PF3 TO EXIT'
114900                MOVE 'D070'             TO MSGLOG-CODE
115000             ELSE
115100                PERFORM P0500-CONVERT-DATE
115200                PERFORM P4000-PROCESS-FUNCTION
115300                MOVE -1                 TO SCR08Z-FUNC-CURSOR
115400             END-IF
115500        WHEN PFKEY5
115600             IF P08CA-IVR-CALL-ACTIVE
115700                IF P08ZCA-EMP-NO         > SPACES
115800                   MOVE -1              TO SCR08Z-FUNC-CURSOR
115900                   MOVE 'VCLL'          TO SCR08Z-FUNC
116000                ELSE
116100*                    'IMPROPER FUNCTION - NO ASSIGNMENT PRESENT'
116200                   MOVE 'I049'          TO MSGLOG-CODE
116300                   MOVE -1              TO SCR08Z-FUNC-CURSOR
116400                   MOVE REV-VIDEO       TO SCR08Z-FUNC-HI
116500                END-IF
116600             ELSE
116700                PERFORM P5111-COMPANY-EDIT
116800                IF NOT CNTL-OUTBND-IVR-CALL-ACTIVE
116900*                     IVR NOT AVAILABLE-VERIFY "OPTION 16"
117000*                       IF MANUAL INTERVENTION REQUIRED
117100                   MOVE 'I606'             TO MSGLOG-CODE
117200                ELSE
117300*                    'IVR CALLS ARE NOT ACTIVE FOR THIS JOB'
117400                   MOVE 'I392'             TO MSGLOG-CODE
117500                END-IF
117600                MOVE -1                 TO SCR08Z-TYPE-CURSOR
117700             END-IF
117800             PERFORM P9000-SEND-MAP-AND-RETURN
117900        WHEN OTHER
118000             MOVE -1                    TO SCR08Z-FUNC-CURSOR
118100*                 'INVALID FUNCTION KEY'
118200             MOVE 'I006'                TO MSGLOG-CODE
118300     END-EVALUATE
118400     .
118500*
118600 P0110-GET-LOCAL-TIME-ZONE.
118700*
118800     MOVE SPACES                        TO CNTLKEY-AREA
118900     SET SUB-DIST-TYPE-REC              TO TRUE
119000     MOVE WS-TZ-DIST                    TO CNTL-DIST
119100     MOVE WS-TZ-SUB-DIST                TO CNTL-SUB-DIST
119200     MOVE CNTLKEY-AREA                  TO CNTLKEY
119300     PERFORM P8800-READ-CNTLFILE
119400     IF NOT SUCCESS
119500        MOVE 'P0110-1'                  TO ERR-PARAGRAPH
119600        MOVE CNTLKEY                    TO ERR-KEY
119700        PERFORM P9999-GOT-PROBLEM
119800     END-IF
119900     MOVE CNTL-TIME-ZONE                TO WS-TIME-ZONE
120000*
120100     MOVE CNTL-US-DOM                   TO WS-US-DOM-FLAG.
120200*
120300*
120400 P0200-CANCEL-DH.
120500*
120600     IF NOT P08ZCA-CALL-SET
120700        IF (P08ZCA-LOCK-FLAG             > SPACE
120800        AND P08ZCA-LOCK-FLAG         NOT = 'Y')
120900        AND P08ZCA-ASSIGNMENT            > SPACE
121000*C1100 - BEG
121100           MOVE SPACES                  TO WS-ASGN-FILE
121200                                           XXXX-ASGNKEY1
121300           IF P08ZCA-DHD-TYPE            = 'P'
121400              MOVE 'U'                  TO XX-ASGN-JOB-TYPE
121500           ELSE
121600              MOVE P08ZCA-DHD-TYPE      TO XX-ASGN-JOB-TYPE
121700           END-IF
121800           MOVE P08ZCA-ASGN-DIST        TO XX-ASGN-DIST
121900           MOVE P08ZCA-ASGN-SUB-DIST    TO XX-ASGN-SUB-DIST
122000           MOVE P08ZCA-ASSIGN           TO XX-ASGN-JOB
122100           MOVE XXXX-ASGNKEY1           TO ASGNKEY1
122200           PERFORM PXXXX-ON-DUTY-EMP
122300           IF ASGN-EMP-NO                > ZERO
122400              CONTINUE
122500           ELSE
122600*C1100 - END
122700              IF NOT P08ZCA-DHD-HOME
122800                 MOVE SPACES            TO P938-COMMAREA-PARMS
122900                 SET P938-CANCEL-FUNCTION TO TRUE
123000                 SET P938-CANCEL-IN-TOWN TO TRUE
123100                 IF P08ZCA-DHD-TYPE = 'P'
123200                    SET P938-ASGN-UFP   TO TRUE
123300                    SET UFP-ASGN        TO TRUE
123400                 ELSE
123500                    SET P938-ASGN-AJ    TO TRUE
123600                    SET AJ-ASGN         TO TRUE
123700                 END-IF
123800                 MOVE P08ZCA-ASSIGNMENT TO P938-ASGN-PARM
123900                 PERFORM P7000-FIND-ASGN-CLASS
124000                 MOVE WS-ASGN-MERG-CLASS TO P938-ASGN-MERG-CLASS
124100                 MOVE P08ZCA-ASGN-DIST  TO SCR08Z-SEL-DIST
124200                 MOVE P08ZCA-ASGN-SUB-DIST TO SCR08Z-SEL-SDIST
124300                 MOVE P08CA-PROF-DIST   TO WS-TZ-DIST
124400                 MOVE P08CA-PROF-SUB-DIST TO WS-TZ-SUB-DIST
124500                 PERFORM P0110-GET-LOCAL-TIME-ZONE
124600                 MOVE WS-TIME-ZONE      TO P938-TIME-ZONE
124700                 SET P938-CANCEL-DH     TO TRUE
124800                 EXEC CICS LINK
124900                           PROGRAM(P938-PGM)
125000                           COMMAREA(P938-COMMAREA-PARMS)
125100                           LENGTH(P938-LGTH)
125200                           RESP(WS-RESPONSE)
125300                 END-EXEC
125400                 MOVE WS-RESPONSE       TO FILE-STATUS
125500                 IF NOT SUCCESS
125600                    MOVE 'P0200-1'      TO ERR-PARAGRAPH
125700                    MOVE 'P938LINK'     TO ERR-KEY
125800                    PERFORM P9999-GOT-PROBLEM
125900                 END-IF
126000              END-IF
126100           END-IF
126200        END-IF
126300     END-IF
126400     .
126500*
126600 P0500-CONVERT-DATE.
126700*
126800     EXEC CICS ASKTIME
126900               ABSTIME(WS-ABSTIME)
127000     END-EXEC
127100     ADD WS-ABSTIME-OFFSET  TO WS-ABSTIME
127200     EXEC CICS FORMATTIME
127300               ABSTIME(WS-ABSTIME)
127400               YYYYMMDD(WS-SYSTEM-DATE-CENT)
127500               TIME(WS-SYSTEM-TIME-AREA)
127600     END-EXEC
127700*
127800*    INSTALL APPLICATION DATE/TIME
127900*
128000     IF PSTCA-DATE-TIME-OFFSET > SPACES
128100        MOVE ZEROS          TO DATE-CONVERSION-PARMS
128200        MOVE WS-SYSTEM-DATE    TO PARM-PRI-DATE-GREG
128300        MOVE WS-SYSTEM-TIME    TO PARM-PRI-HRMN
128400        PERFORM P9810-PROCESS-OFFSET
128500        MOVE PARM-RES-DATE-GREG
128600                            TO WS-SYSTEM-DATE
128700        MOVE PARM-RES-GREG-CENT
128800                            TO WS-SYSTEM-CENT
128900        MOVE PARM-RES-HRMN
129000                            TO WS-SYSTEM-TIME
129100     END-IF
129200*
129300     MOVE ZEROES            TO TZ-PARAMETERS
129400     MOVE SPACES            TO TZ-STATUS-FLAG
129500     SET TZ-IN-EASTERN-ZONE TO TRUE
129600     MOVE WS-PRESENT-TIME   TO TZ-IN-DATE-TIME
129700     MOVE WS-TIME-ZONE      TO TZ-OUT-ZONE
129800     PERFORM P8996-TIMEZONE
129900*    MOVE TZ-OUT-DATE-TIME  TO WORK-DATE-TIME
130000*                              LOCAL-CUR-DATE-TIME
130100     MOVE TZ-OUT-DATE-TIME-CENT  TO WORK-DATE-TIME-CENT
130200                                 WS-LOCAL-DATE-TIME-CENT
130300     IF SCR08Z-DATE NOT > '000000'
130400       MOVE WORK-TIME TO SCR08Z-TIME
130500       MOVE WORK-DATE TO SCR08Z-DATE
130600     END-IF.
130700*
130800 P3000-EDIT-INPUT-DATA.
130900*
131000     MOVE SPACES              TO P08ZCA-LOCK-FLAG
131100     MOVE DEFAULT-ATTR        TO SCR08Z-TYPE-HI
131200                                 SCR08Z-CODE-HI
131300                                 SCR08Z-MODE-HI
131400                                 SCR08Z-SEL-DIST-HI
131500                                 SCR08Z-SEL-SDIST-HI
131600                                 SCR08Z-FURTHER-N-HI
131700                                 SCR08Z-MILES-HI
131800                                 SCR08Z-HRMN-HI
131900                                 SCR08Z-DATE-HI
132000                                 SCR08Z-TIME-HI
132100
132200     MOVE SCR08Z-TYPE TO P08ZCA-DHD-TYPE
132300     IF SCR08Z-CODE NOT > SPACES
132400        MOVE -1  TO SCR08Z-CODE-CURSOR
132500        MOVE REV-VIDEO  TO SCR08Z-CODE-HI
132600*            'MUST ENTER A CODE'
132700        MOVE 'M011' TO MSGLOG-CODE
132800*TJR 2/21/2001
132900        MOVE MDT    TO SCR08Z-CODE-ATTR
133000        PERFORM P9000-SEND-MAP-AND-RETURN
133100     END-IF
133200
133300     MOVE SCR08Z-CODE TO CODE-AREA
133400     IF NOT DEADHEAD-HOME
133500       IF SCR08Z-TYPE NOT = ('A' AND 'P')
133600*              'MUST ENTER VALID DEADHEAD TYPE '
133700          MOVE 'M035' TO MSGLOG-CODE
133800          MOVE -1  TO SCR08Z-TYPE-CURSOR
133900*TJR 2/21/2001
134000          MOVE MDT TO SCR08Z-TYPE-ATTR
134100          MOVE REV-VIDEO TO SCR08Z-TYPE-HI
134200          PERFORM P9000-SEND-MAP-AND-RETURN
134300       END-IF
134400     END-IF
134500     PERFORM P3100-EDIT-DATE-AND-TIME
134600     MOVE SPACES               TO P08ZCA-LEAD-TIME
134700     IF NOT DEADHEAD-HOME
134800        IF SCR08Z-TYPE = 'A'
134900           MOVE SCR08Z-SEL-DIST  TO WORK-AJ-DIST
135000           MOVE SCR08Z-SEL-SDIST TO WORK-AJ-SUB-DIST
135100           MOVE SCR08Z-CODE      TO WORK-ASSIGNMENT
135200           MOVE WORK-AJ-KEY      TO AJJOBKEY
135300           EXEC CICS READ
135400                     DATASET(AJ-VIA-JNAME-JCRAFT)
135500                     INTO(WS-ASGNED-JOBS)
135600                     LENGTH(AJNAMECR-RLGTH)
135700                     RIDFLD(AJJOBKEY)
135800                     KEYLENGTH(AJNAMECR-KLGTH)
135900                     RESP(WS-RESPONSE)
136000           END-EXEC
136100           MOVE WS-RESPONSE TO FILE-STATUS
136200           IF NOT SUCCESS
136300              MOVE -1  TO SCR08Z-CODE-CURSOR
136400              MOVE REV-VIDEO  TO SCR08Z-CODE-HI
136500*             'NO SUCH ASSIGNMENT EXISTS IN DIST/SDIST '
136600              MOVE 'N031' TO MSGLOG-CODE
136700              PERFORM P9000-SEND-MAP-AND-RETURN
136800           END-IF
136900           SET DE-YYMMDD-FORMAT     TO TRUE
137000           MOVE AJ-EFF-DATE         TO DE-YYMMDD
137100           PERFORM P8998-DATEEDIT
137200           MOVE DE-CCYYMMDD         TO DE-COMPARE1-DATE
137300           SET DE-YYMMDD-FORMAT     TO TRUE
137400           MOVE P08ZCA-CONV-DATE    TO DE-YYMMDD
137500           PERFORM P8998-DATEEDIT
137600           MOVE DE-CCYYMMDD         TO DE-COMPARE2-DATE
137700*          IF AJ-EFF-DATE      > P08ZCA-CONV-DATE
137800           IF DE-COMPARE1-DATE > DE-COMPARE2-DATE
137900              MOVE -1            TO SCR08Z-CODE-CURSOR
138000              MOVE REV-VIDEO     TO SCR08Z-CODE-HI
138100*             'ASSIGNMENT EXISTS BUT IS NOT YET EFFECTIVE'
138200              MOVE 'A025'        TO MSGLOG-CODE
138300              PERFORM P9000-SEND-MAP-AND-RETURN
138400           END-IF
138500           MOVE SPACES TO WS-ASGN-FILE
138600           MOVE WORK-AJ-KEY TO ASGN-ASSIGNMENT OF WS-ASGN-FILE
138700           SET ASGN-ON-DUTY-REC  TO TRUE
138800           MOVE 'A'              TO ASGN-JOB-TYPE OF WS-ASGN-FILE
138900           MOVE ZEROES           TO ASGN-DATE-TIME
139000           MOVE ASGNKEY1         TO ASGNJOB
139100           EXEC CICS READ
139200                     DATASET(ASGN-VIA-ASGNJOB)
139300                     INTO(WS-ASGN-FILE)
139400                     LENGTH(ASGNJOB-RLGTH)
139500                     RIDFLD(ASGNJOB)
139600                     KEYLENGTH(ASGNJOB-KLGTH)
139700                     RESP(WS-RESPONSE)
139800           END-EXEC
139900           MOVE WS-RESPONSE TO FILE-STATUS
140000           IF SUCCESS
140100              MOVE -1  TO SCR08Z-CODE-CURSOR
140200              MOVE REV-VIDEO  TO SCR08Z-CODE-HI
140300*             'JOB ALREADY HAS AN EMPLOYEE ASSIGNMENT'
140400              MOVE 'J006' TO MSGLOG-CODE
140500              PERFORM P9000-SEND-MAP-AND-RETURN
140600           ELSE
140700              PERFORM P3030-CHECK-FOR-VACANCY
140800           END-IF
140900           MOVE AJJOBKEY-AREA      TO P08ZCA-ASSIGNMENT
141000           MOVE SPACES             TO CNTLKEY-AREA
141100           MOVE '02'               TO CNTL-REC-TYPE
141200           MOVE AJ-JOB-DIST        TO CNTL-DIST
141300           MOVE AJ-JOB-SUB-DIST    TO CNTL-SUB-DIST
141400           MOVE CNTLKEY-AREA       TO CNTLKEY
141500           PERFORM P8800-READ-CNTLFILE
141600           IF NOT SUCCESS
141700              MOVE 'P3000-1'       TO ERR-PARAGRAPH
141800              MOVE CNTLKEY         TO ERR-KEY
141900              PERFORM P9999-GOT-PROBLEM
142000           END-IF
142100           MOVE CNTL-LEAD-CALL-TIME TO P08ZCA-LEAD-TIME
142200        ELSE
142300           MOVE SCR08Z-SEL-DIST  TO WORK-UFP-DIST
142400           MOVE SCR08Z-SEL-SDIST TO WORK-UFP-SUB-DIST
142500           MOVE SCR08Z-CODE      TO WORK-UFP-AREA-A
142600           MOVE WORK-UFPTURN-KEY TO UFPTURN
142700           EXEC CICS READ
142800                     DATASET(UFP-VIA-TURN-NBR)
142900                     INTO(WS-UFP)
143000                     LENGTH(UFPTURN-RLGTH)
143100                     RIDFLD(UFPTURN)
143200                     KEYLENGTH(UFPTURN-KLGTH)
143300                     RESP(WS-RESPONSE)
143400           END-EXEC
143500           MOVE WS-RESPONSE TO FILE-STATUS
143600           IF SUCCESS
143700              IF UFP-ON-BOARD
143800                 CONTINUE
143900              ELSE
144000                 PERFORM P3900-CHECK-IF-ASSOCIATED-TURN
144100              END-IF
144200           ELSE
144300*             'NO RECORD OF POOL TURN IN DIST/SDIST'
144400              MOVE 'N032' TO MSGLOG-CODE
144500              MOVE -1  TO SCR08Z-CODE-CURSOR
144600              MOVE REV-VIDEO TO SCR08Z-CODE-HI
144700              PERFORM P9000-SEND-MAP-AND-RETURN
144800           END-IF
144900           MOVE SPACES TO WS-ASGN-FILE
145000           MOVE WORK-UFPTURN-KEY TO
145100                          ASGN-ASSIGNMENT OF WS-ASGN-FILE
145200           SET ASGN-ON-DUTY-REC  TO TRUE
145300           SET ASGN-UFP-JOB      TO TRUE
145400           MOVE ZEROES           TO ASGN-DATE-TIME
145500           MOVE ASGNKEY1         TO ASGNJOB
145600           EXEC CICS READ
145700                     DATASET(ASGN-VIA-ASGNJOB)
145800                     INTO(WS-ASGN-FILE)
145900                     LENGTH(ASGNJOB-RLGTH)
146000                     RIDFLD(ASGNJOB)
146100                     KEYLENGTH(ASGNJOB-KLGTH)
146200                     RESP(WS-RESPONSE)
146300           END-EXEC
146400           MOVE WS-RESPONSE TO FILE-STATUS
146500           IF SUCCESS
146600              MOVE -1  TO SCR08Z-CODE-CURSOR
146700              MOVE REV-VIDEO  TO SCR08Z-CODE-HI
146800*             'THIS TURN HAS AN EMPLOYEE ASSIGNED'
146900              MOVE 'T019' TO MSGLOG-CODE
147000              PERFORM P9000-SEND-MAP-AND-RETURN
147100           END-IF
147200           MOVE UFPTURN-AREA        TO P08ZCA-ASSIGNMENT
147300                                      WORK-UFPTURN-AREA
147400*NJB BEG
147500*     SAVE OFF THE SUB DIST LEAD TIME
147600*
147700           MOVE SPACES              TO CNTLKEY-AREA
147800           MOVE '02'                TO CNTL-REC-TYPE
147900           MOVE DIST IN WS-UFP      TO CNTL-DIST
148000           MOVE SUB-DIST IN WS-UFP  TO CNTL-SUB-DIST
148100           MOVE CNTLKEY-AREA        TO CNTLKEY
148200           PERFORM P8800-READ-CNTLFILE
148300           IF NOT SUCCESS
148400              MOVE 'P3000-2'        TO ERR-PARAGRAPH
148500              MOVE CNTLKEY          TO ERR-KEY
148600              PERFORM P9999-GOT-PROBLEM
148700           END-IF
148800           MOVE CNTL-LEAD-CALL-TIME TO DEFAULT-LEAD-TIME
148900*NJB END
149000           MOVE SPACES              TO CNTLKEY-AREA
149100           MOVE '03'                TO CNTL-REC-TYPE
149200           MOVE DIST IN WS-UFP      TO CNTL-DIST
149300           MOVE SUB-DIST IN WS-UFP  TO CNTL-SUB-DIST
149400           MOVE POOL-NAME IN WS-UFP TO CNTL-POOL-CODE
149500           MOVE 'F'                 TO CNTL-POOL-TYPE
149600           MOVE CNTLKEY-AREA        TO CNTLKEY
149700           PERFORM P8800-READ-CNTLFILE
149800           IF NOT SUCCESS
149900              MOVE 'P3000-4'     TO ERR-PARAGRAPH
150000              MOVE CNTLKEY       TO ERR-KEY
150100              PERFORM P9999-GOT-PROBLEM
150200           END-IF
150300           IF IN-OUT-TERMINAL  = '0'
150400              MOVE CNTL-POOL-HOME-LEAD-TIME
150500                                 TO P08ZCA-LEAD-TIME
150600           ELSE
150700              MOVE CNTL-AWAY-LTIME(IN-OUT-TERMINAL)
150800                                 TO P08ZCA-LEAD-TIME
150900           END-IF
151000        END-IF
151100*NJB BEG
151200        IF DEFAULT-LEAD-TIME > ZEROES AND
151300           P08ZCA-LEAD-TIME NOT > ZEROES
151400           MOVE DEFAULT-LEAD-TIME TO P08ZCA-LEAD-TIME
151500        END-IF
151600*NJB END
151700        MOVE SCR08Z-CODE-CC     TO WS-CRAFT-CODE-CHECK
151800        PERFORM P3010-GET-MILES-TIME
151900        PERFORM P3020-EDIT-MILES-TIME
152000        IF TRCN-ADDL-LEAD-TIME > SPACES
152100           MOVE P08ZCA-LEAD-TIME TO WS-LEAD-TIME
152200           MOVE WS-LEAD-TIME-MN  TO WS-LEAD-TIME-MN3
152300           ADD TRCN-ADDL-LEAD-TIME-HR TO WS-LEAD-TIME-HR
152400           ADD TRCN-ADDL-LEAD-TIME-MN TO WS-LEAD-TIME-MN3
152500           IF WS-LEAD-TIME-MN3 > 60
152600              ADD 1              TO WS-LEAD-TIME-HR
152700              SUBTRACT 60      FROM WS-LEAD-TIME-MN3
152800           END-IF
152900           MOVE WS-LEAD-TIME-MN3 TO WS-LEAD-TIME-MN
153000           MOVE WS-LEAD-TIME     TO P08ZCA-LEAD-TIME
153100        END-IF
153200     ELSE
153300        SET P08ZCA-DHD-HOME TO TRUE
153400     END-IF
153500     IF SCR08Z-MODE > SPACES
153600        MOVE SCR08Z-MODE TO CHECK-VALID-MODE
153700        IF NOT VALID-MODE
153800*               'INVALID MODE OF TRANSPORTATION'
153900           MOVE 'I076' TO MSGLOG-CODE
154000           MOVE -1 TO SCR08Z-MODE-CURSOR
154100           MOVE REV-VIDEO TO SCR08Z-MODE-HI
154200           PERFORM P9000-SEND-MAP-AND-RETURN
154300        END-IF
154400     ELSE
154500*            'MUST ENTER MODE OF TRANSPORTATION'
154600        MOVE 'M036' TO MSGLOG-CODE
154700*TJR 2/21/2001
154800        MOVE MDT    TO SCR08Z-MODE-ATTR
154900        MOVE -1 TO SCR08Z-MODE-CURSOR
155000        MOVE REV-VIDEO TO SCR08Z-MODE-HI
155100        PERFORM P9000-SEND-MAP-AND-RETURN
155200     END-IF
155300     IF DEADHEAD-HOME OR SCR08Z-FURTHER-N NOT > SPACE
155400        MOVE 'N' TO SCR08Z-FURTHER-N
155500     END-IF
155600     IF SCR08Z-TYPE = 'P'
155700        IF TEMPORARY-TURN
155800           MOVE 'N' TO SCR08Z-FURTHER-N
155900        END-IF
156000     END-IF
156100     IF SCR08Z-FURTHER-N NOT = ('Y' AND 'N')
156200*            'INDICATE (Y) OR (N) TO HOLD EMPLOYEE ON ASSIGNMENT'
156300        MOVE 'I077' TO MSGLOG-CODE
156400        MOVE -1 TO SCR08Z-FURTHER-N-CURSOR
156500        MOVE REV-VIDEO TO SCR08Z-FURTHER-N-HI
156600        PERFORM P9000-SEND-MAP-AND-RETURN
156700     END-IF
156800     IF NOT DEADHEAD-HOME
156900        IF SCR08Z-TYPE = 'A'
157000           MOVE SCR08Z-TYPE TO XX-ASGN-JOB-TYPE
157100        ELSE
157200           MOVE 'U'         TO XX-ASGN-JOB-TYPE
157300        END-IF
157400        MOVE SCR08Z-SEL-DIST  TO XX-ASGN-DIST
157500        MOVE SCR08Z-SEL-SDIST TO XX-ASGN-SUB-DIST
157600        MOVE CONV-TIME        TO XX-ASGN-DATE-TIME
157700        MOVE SCR08Z-CODE      TO XX-ASGN-JOB
157800        IF SCR08Z-TYPE = 'P'
157900           MOVE '3'            TO XX-ASGN-REC-TYPE
158000           MOVE ZERO           TO XX-ASGN-DATE-TIME
158100           MOVE XXXX-ASGNKEY1  TO ASGNJOB
158200           EXEC CICS READ
158300                     DATASET(ASGN-VIA-ASGNJOB)
158400                     INTO(WS-ASGN-FILE)
158500                     LENGTH(ASGNJOB-RLGTH)
158600                      RIDFLD(ASGNJOB)
158700                     KEYLENGTH(ASGNJOB-KLGTH)
158800                     RESP(WS-RESPONSE)
158900           END-EXEC
159000           MOVE WS-RESPONSE TO FILE-STATUS
159100           IF SUCCESS
159200*                 'WARNING - THIS TURN HAS AN EMPLOYEE ASSIGNED'
159300              MOVE 'W003' TO MSGLOG-CODE
159400           END-IF
159500        END-IF
159600     END-IF
159700     MOVE 'X'                 TO P08ZCA-LOCK-FLAG
159800     MOVE SPACES              TO P08ZCA-RJHS-EMP-NO
159900     MOVE AUTOSKIP-MDT        TO SCR08Z-TYPE-ATTR
160000                                 SCR08Z-CODE-ATTR
160100                                 SCR08Z-MODE-ATTR
160200                                 SCR08Z-SEL-DIST-ATTR
160300                                 SCR08Z-SEL-SDIST-ATTR
160400                                 SCR08Z-FURTHER-N-ATTR
160500                                 SCR08Z-MILES-ATTR
160600                                 SCR08Z-HRMN-ATTR
160700                                 SCR08Z-DATE-ATTR
160800                                 SCR08Z-TIME-ATTR.
160900*
161000 P3010-GET-MILES-TIME.
161100*
161200     MOVE P08CA-PROFILE-KEY    TO TRCNKEY1
161300     PERFORM P8000-READ-TRCNKEY1
161400     MOVE TRCN-INIT-DH-TIME    TO SCR08Z-HRMN
161500     MOVE SPACES               TO TKCRKEY-AREA
161600     SET  RUN-MILES-REC        TO TRUE
161700     MOVE TRCN-ORIGIN-STN      TO TKCR-FROM-LOCATION
161800     MOVE TRCN-FNL-STN         TO TKCR-TO-LOCATION
161900     MOVE TRCN-ROUTE-DESIGNATION
162000                               TO TKCR-ROUTE-DESIGNATION
162100     MOVE WORK-DATE            TO TKCR-EXP-DATE
162200     IF WORK-YR                 > 80
162300        MOVE '19'              TO TKCR-EXP-CE
162400     ELSE
162500        MOVE '20'              TO TKCR-EXP-CE
162600     END-IF
162700     MOVE TKCRKEY-AREA         TO TKCRKEY
162800     EXEC CICS READ
162900               GTEQ
163000               DATASET(TKCR-FILE-VIA-TKCRKEY)
163100               INTO(WS-TKCR-FILE)
163200               LENGTH(TKCRFILE-RLGTH)
163300               RIDFLD(TKCRKEY)
163400               KEYLENGTH(TKCRFILE-KLGTH)
163500               RESP(WS-RESPONSE)
163600     END-EXEC
163700     MOVE WS-RESPONSE          TO FILE-STATUS
163800     IF  SUCCESS
163900     AND RUN-MILES-REC
164000     AND TRCN-ORIGIN-STN        = TKCR-FROM-LOCATION
164100     AND TRCN-FNL-STN           = TKCR-TO-LOCATION
164200     AND TRCN-ROUTE-DESIGNATION = TKCR-ROUTE-DESIGNATION
164300        CONTINUE
164400     ELSE
164500        MOVE ZEROES            TO TKCR-EN-RUN-MILES-NUM
164600                                  TKCR-TR-RUN-MILES-NUM
164700     END-IF
164800     IF ENGINE-CRAFT
164900        MOVE TKCR-EN-RUN-MILES TO SCR08Z-MILES
165000     ELSE
165100        MOVE TKCR-TR-RUN-MILES TO SCR08Z-MILES
165200     END-IF
165300     .
165400*
165500 P3020-EDIT-MILES-TIME.
165600*
165700     MOVE SCR08Z-MILES     TO BIF-FIELD
165800     MOVE +5               TO BIF-LEN
165900     PERFORM P8999-BIFEDIT
166000     IF BIF-ERROR
166100*            'INVALID MILES ENTERED'
166200        MOVE 'I075' TO MSGLOG-CODE
166300        MOVE -1             TO SCR08Z-MILES-CURSOR
166400        MOVE MDT            TO SCR08Z-MILES-ATTR
166500        MOVE REV-VIDEO TO SCR08Z-MILES-HI
166600        PERFORM P9000-SEND-MAP-AND-RETURN
166700     ELSE
166800        MOVE BIF-EDITED-FIELD TO SCR08Z-MILES
166900     END-IF
167000     IF SCR08Z-MILES NOT > '00000'
167100*            'INVALID MILES ENTERED'
167200        MOVE 'I075' TO MSGLOG-CODE
167300        MOVE -1             TO SCR08Z-MILES-CURSOR
167400        MOVE MDT            TO SCR08Z-MILES-ATTR
167500        MOVE REV-VIDEO TO SCR08Z-MILES-HI
167600        PERFORM P9000-SEND-MAP-AND-RETURN
167700     ELSE
167800        MOVE AUTOSKIP-MDT   TO SCR08Z-MILES-ATTR
167900     END-IF
168000     PERFORM P3200-EDIT-TIE-UP-TIME.
168100*
168200 P3030-CHECK-FOR-VACANCY.
168300*
168400     MOVE ZEROS    TO MSTRNBRK
168500     MOVE SPACES   TO WS-ASGN-FILE
168600     MOVE 'A'      TO ASGN-JOB-TYPE
168700     MOVE AJ-JOB-DIST       TO ASGN-DIST
168800     MOVE AJ-JOB-SUB-DIST   TO ASGN-SUB-DIST
168900     MOVE AJ-JOB-ASSIGNMENT TO ASGN-AJ-JOB OF ASGN-ASSIGNMENT
169000     MOVE '2'      TO ASGN-REC-TYPE
169100     MOVE ZEROS    TO ASGN-DATE-TIME
169200     PERFORM PXXXX-LATEST-TEMP
169300     IF ASGN-EMP-NO > ZERO
169400        MOVE ASGN-EMP-NO TO MSTRNBRK
169500     ELSE
169600        MOVE SPACES      TO WS-ASGN-FILE
169700        MOVE 'A' TO ASGN-JOB-TYPE
169800        MOVE AJ-JOB-DIST       TO ASGN-DIST
169900        MOVE AJ-JOB-SUB-DIST   TO ASGN-SUB-DIST
170000        MOVE AJ-JOB-ASSIGNMENT TO ASGN-AJ-JOB OF ASGN-ASSIGNMENT
170100        MOVE '1'      TO ASGN-REC-TYPE
170200        MOVE ZEROS    TO ASGN-DATE-TIME
170300        PERFORM PXXXX-JOB-OWNER
170400        IF ASGN-EMP-NO > ZERO
170500           MOVE ASGN-EMP-NO TO MSTRNBRK
170600        END-IF
170700     END-IF
170800     IF MSTRNBRK > ZERO
170900        PERFORM P8500-READ-MASTER
171000        PERFORM P8510-MASTER-JOBS
171100        IF NOT AVAILABLE OF WS-MSTR
171200           OR (ON-DUTY-ASGNMT > SPACE AND
171300               ON-DUTY-ASGNMT NOT = AJJOBKEY-AREA)
171400           OR (ON-DUTY-ASGNMT NOT > SPACE AND
171500               TEMPORARY-ASGNMT > SPACE AND
171600               TEMPORARY-ASGNMT NOT = AJJOBKEY-AREA)
171700           CONTINUE
171800        ELSE
171900           PERFORM P4220-LOOK-FOR-QUICK-TIEUPS
172000           IF NOT P980-QUICKTIE-RESTRICTED
172100              MOVE -1 TO SCR08Z-CODE-CURSOR
172200              MOVE REV-VIDEO TO SCR08Z-CODE-HI
172300*                  'VACANCY DOES NOT EXIST ON THIS ASSIGNMENT'
172400              MOVE 'T019' TO MSGLOG-CODE
172500              PERFORM P9000-SEND-MAP-AND-RETURN
172600           END-IF
172700        END-IF
172800     END-IF.
172900*CNC0600-NXA-B
173000 P3040-CHECK-EMP-UNDST-REST.
173100     MOVE P08ZCA-EMP-NO            TO MSTR3NBRK
173200     PERFORM P8570-READ-MASTER3
173300     MOVE P08ZCA-EMP-NO            TO MSTRNBRK
173400     PERFORM P8500-READ-MASTER
173500*
173600     IF WS-CAN-WRR-NEW
173900        IF EMP-MTOD-NUM > WS-LOCAL-DATE-TIME
174000           MOVE EMP-MTOD-TIME(1:2) TO WS-UD-HH
174100           MOVE EMP-MTOD-TIME(3:2) TO WS-UD-MM
174200           SET WS-EMP-UNDST-REST         TO TRUE
      *CNLD-245-B
                 MOVE EMP-MTOD-NUM       TO WS-SAVE-UD-DTTM
      *CNLD-245-E
174300        END-IF
174400        IF WS-MSTR3-REC-FOUND
174500           IF WS-LOCAL-DATE-TIME >= MSTR3-SYSTEM-UD1-FROM-NUM
174600           AND WS-LOCAL-DATE-TIME <= MSTR3-SYSTEM-UD1-TO-NUM
174700              IF EMP-MTOD-NUM > MSTR3-SYSTEM-UD1-TO-NUM
174800                 CONTINUE
174900              ELSE
175000                 MOVE MSTR3-SYSTEM-UD1-TO-TIME(1:2) TO WS-UD-HH
175100                 MOVE MSTR3-SYSTEM-UD1-TO-TIME(3:2) TO WS-UD-MM
175200                 SET WS-EMP-UNDST-REST         TO TRUE
      *CNLD-245-B
                       MOVE MSTR3-SYSTEM-UD1-TO-NUM
                                         TO WS-SAVE-UD-DTTM
      *CNLD-245-E
175300              END-IF
175400           ELSE
175500              IF  WS-LOCAL-DATE-TIME >= MSTR3-SYSTEM-UD2-FROM-NUM
175600               AND WS-LOCAL-DATE-TIME <= MSTR3-SYSTEM-UD2-TO-NUM
175700                  MOVE MSTR3-SYSTEM-UD2-TO-TIME(1:2) TO WS-UD-HH
175800                  MOVE MSTR3-SYSTEM-UD2-TO-TIME(3:2) TO WS-UD-MM
175900                  SET WS-EMP-UNDST-REST         TO TRUE
      *CNLD-245-B
                        MOVE MSTR3-SYSTEM-UD2-TO-NUM
                                         TO WS-SAVE-UD-DTTM
      *CNLD-245-E
176000              END-IF
176100           END-IF
176200        END-IF
176300     END-IF.
176400*CNC0600-NXA-E
176500*
      *CNLD-245-B
       P3050-CHECK-US-UNDIST-REST.
      *
           IF (EMP-US-RSTD-NUM > WS-LOCAL-DATE-TIME
              AND WS-SAVE-UD-DTTM <= EMP-US-RSTD-NUM)
              MOVE EMP-US-RSTD-TIME(1:2) TO WS-UD-HH
              MOVE EMP-US-RSTD-TIME(3:2) TO WS-UD-MM
              SET WS-EMP-UNDST-REST         TO TRUE
              MOVE WS-UD-MESG          TO SCR08Z-PHONE
              MOVE YELLOW              TO SCR08Z-PHONE-COLOR
              SET WS-EMP-US-STATUS-RED TO TRUE
           END-IF

           .
      *CNLD-245-E
176500*
176600 P3100-EDIT-DATE-AND-TIME.
176700*
176800     MOVE WS-SYS-YR   TO LEAP-YEARS
176900     IF LEAP-YEAR
177000         MOVE 29      TO MONTH(2)
177100     ELSE
177200         MOVE 28      TO MONTH(2)
177300     END-IF
177400     MOVE SCR08Z-DATE TO WORK-DATE
177500     MOVE SCR08Z-TIME TO WORK-TIME
177600
177700     MOVE WORK-DATE TO DE-YYMMDD
177800     SET DE-YYMMDD-FORMAT TO TRUE
177900     PERFORM P8998-DATEEDIT
178000     IF DE-INVALID-DATE
178100        MOVE -1 TO SCR08Z-DATE-CURSOR
178200        MOVE REV-VIDEO TO SCR08Z-DATE-HI
178300*            'INVALID DATE FORMAT ENTERED'
178400        MOVE 'I004' TO MSGLOG-CODE
178500     END-IF
178600
178700     MOVE WORK-TIME TO TE-MILITARY-TIME
178800     SET TE-MILITARY-FORMAT TO TRUE
178900     PERFORM P8997-TIMEEDIT
179000     IF TE-INVALID-TIME
179100        MOVE -1 TO SCR08Z-TIME-CURSOR
179200        MOVE REV-VIDEO TO SCR08Z-TIME-HI
179300*            'INVALID TIME FORMAT ENTERED'
179400        MOVE 'I005' TO MSGLOG-CODE
179500     END-IF
179600
179700     IF DE-INVALID-DATE AND TE-INVALID-TIME
179800*            INVALID-DATE-TIME-MSG
179900        MOVE 'I042' TO MSGLOG-CODE
180000     END-IF
180100     IF DE-INVALID-DATE OR TE-INVALID-TIME
180200        PERFORM P9000-SEND-MAP-AND-RETURN
180300     END-IF
180400
180500     MOVE WORK-TIME        TO CONV-HR-MN
180600     MOVE WORK-MO          TO CONV-MO
180700     MOVE WORK-DY          TO CONV-DY
180800     MOVE WORK-YR               TO CONV-YR
180900*    MOVE LOCAL-CUR-DATE-TIME   TO X-TIME
181000     MOVE WS-LOCAL-DATE-TIME-CENT TO X-TIME-CENT
181100     IF X-HR > 11
181200        SUBTRACT 12 FROM X-HR
181300     ELSE
181400        ADD 12 TO X-HR
181500        SUBTRACT 1 FROM X-DY
181600        IF X-DY = ZERO
181700           SUBTRACT 1 FROM X-MO
181800           IF X-MO = ZERO
181900              SUBTRACT 1 FROM X-CCYY
182000              MOVE 12 TO X-MO
182100              MOVE 31 TO X-DY
182200           ELSE
182300              MOVE MONTH(X-MO) TO X-DY
182400           END-IF
182500        END-IF
182600     END-IF
182700     SET DE-YYMMDD-FORMAT     TO TRUE
182800     MOVE WORK-DATE           TO DE-YYMMDD
182900     PERFORM P8998-DATEEDIT
183000     MOVE DE-YYMMDD-CE        TO WORK-CENT
183100     SET DE-YYMMDD-FORMAT     TO TRUE
183200     MOVE X-TIME-DATE         TO DE-YYMMDD
183300     PERFORM P8998-DATEEDIT
183400     MOVE DE-YYMMDD-CE        TO X-CE
183500*    IF WORK-DATE-TIME      < X-TIME
183600     IF WORK-DATE-TIME-CENT < X-TIME-CENT
183700*            'CANNOT UPDATE MORE THAN 12 HOUR IN PAST'
183800        MOVE 'C023'           TO MSGLOG-CODE
183900        MOVE -1               TO SCR08Z-DATE-CURSOR
184000        MOVE REV-VIDEO        TO SCR08Z-DATE-HI
184100                                 SCR08Z-TIME-HI
184200        PERFORM P9000-SEND-MAP-AND-RETURN
184300     END-IF
184400*C1122-BEG
184500     IF WORK-DATE-TIME-CENT > WS-LOCAL-DATE-TIME-CENT
184600        MOVE ZEROS            TO DATE-CONVERSION-PARMS
184700        SET PARM-DIFF         TO TRUE
184800        MOVE WORK-DATE        TO PARM-PRI-DATE-GREG
184900        MOVE WORK-TIME        TO PARM-PRI-HRMN
185000        MOVE WS-LOCAL-DATE    TO PARM-SEC-DATE-GREG
185100        MOVE WS-LOCAL-TIME    TO PARM-SEC-HRMN
185200        EXEC CICS LINK
185300                  PROGRAM(P903-PGM)
185400                  COMMAREA(DATE-CONVERSION-PARMS)
185500                  LENGTH(P903-LGTH)
185600                  RESP(WS-RESPONSE)
185700        END-EXEC
185800        MOVE WS-RESPONSE      TO FILE-STATUS
185900        IF NOT SUCCESS
186000           MOVE 'P4140-3'     TO ERR-PARAGRAPH
186100           MOVE 'P903LINK'    TO ERR-KEY
186200           PERFORM P9999-GOT-PROBLEM
186300        END-IF
186400        IF PARM-RES-TOT-DAYS >= 1
186500**         'CANNOT UPDATE MORE THAN 24 HOUR IN FUTURE'
186600           MOVE 'C320'        TO MSGLOG-CODE
186700           MOVE -1            TO SCR08Z-DATE-CURSOR
186800           MOVE REV-VIDEO     TO SCR08Z-DATE-HI
186900                                 SCR08Z-TIME-HI
187000           PERFORM P9000-SEND-MAP-AND-RETURN
187100        END-IF
187200     END-IF
187300*C1122-END
187400     MOVE SCR08Z-DATE TO P08ZCA-EFF-DATE
187500     MOVE SCR08Z-TIME TO P08ZCA-EFF-HRMN.
187600     MOVE CONV-TIME   TO P08ZCA-CONV-TIME.
187700*
187800 P3200-EDIT-TIE-UP-TIME.
187900*
188000     MOVE SCR08Z-HRMN      TO BIF-FIELD
188100     MOVE +4               TO BIF-LEN
188200     PERFORM P8999-BIFEDIT
188300     IF BIF-ERROR
188400*            'INVALID TIME ENTERED'
188500        MOVE 'I022' TO MSGLOG-CODE
188600        MOVE -1  TO SCR08Z-HRMN-CURSOR
188700        MOVE MDT       TO SCR08Z-HRMN-ATTR
188800        MOVE REV-VIDEO TO SCR08Z-HRMN-HI
188900        PERFORM P9000-SEND-MAP-AND-RETURN
189000     END-IF
189100     MOVE BIF-EDITED-FIELD TO SCR08Z-HRMN
189200     IF SCR08Z-HRMN > '0000'
189300       MOVE SCR08Z-HRMN TO WORK-TIME
189400       IF WORK-HR < 9 AND WORK-MN < 60
189500         SET DE-YYMMDD-FORMAT     TO TRUE
189600         MOVE CONV-DATE           TO DE-YYMMDD
189700         PERFORM P8998-DATEEDIT
189800         MOVE DE-CCYYMMDD         TO TIE-UP-DATE
189900         MOVE CONV-HR   TO TIE-UP-HR
190000         MOVE CONV-MN   TO TIE-UP-MN
190100         MOVE ZEROES    TO TIMEA
190200         ADD WORK-MN    TO TIMEA
190300         ADD TIE-UP-MN  TO TIMEA
190400         IF TIMEA > 59
190500           ADD 1 TO TIE-UP-HR
190600           SUBTRACT 60 FROM TIMEA
190700         END-IF
190800         MOVE TIMEA  TO TIE-UP-MN
190900         ADD WORK-HR TO TIE-UP-HR
191000         IF TIE-UP-HR > 23
191100           SUBTRACT 24 FROM TIE-UP-HR
191200           ADD 1 TO TIE-UP-DY
191300           IF TIE-UP-DY > MONTH(TIE-UP-MO)
191400             MOVE 1 TO TIE-UP-DY
191500             ADD 1  TO TIE-UP-MO
191600             IF TIE-UP-MO > 12
191700               MOVE 1 TO TIE-UP-MO
191800*              ADD 1  TO TIE-UP-YR
191900               ADD 1  TO TIE-UP-CENTYR
192000             END-IF
192100           END-IF
192200         END-IF
192300         MOVE AUTOSKIP-MDT    TO SCR08Z-HRMN-ATTR
192400       ELSE
192500*             'INVALID TIME ENTERED'
192600         MOVE 'I022' TO MSGLOG-CODE
192700         MOVE -1  TO SCR08Z-HRMN-CURSOR
192800         MOVE MDT TO SCR08Z-HRMN-ATTR
192900         MOVE REV-VIDEO TO SCR08Z-HRMN-HI
193000         PERFORM P9000-SEND-MAP-AND-RETURN
193100       END-IF
193200     ELSE
193300*           'MUST ENTER DEADHEADING TIME'
193400       MOVE 'M012' TO MSGLOG-CODE
193500       MOVE -1  TO SCR08Z-HRMN-CURSOR
193600       MOVE MDT       TO SCR08Z-HRMN-ATTR
193700       MOVE REV-VIDEO TO SCR08Z-HRMN-HI
193800       PERFORM P9000-SEND-MAP-AND-RETURN
193900     END-IF.
194000*
194100 P3900-CHECK-IF-ASSOCIATED-TURN.
194200*
194300     MOVE DIST2        TO CNTL-DIST
194400     MOVE SUB-DIST2    TO CNTL-SUB-DIST
194500     MOVE '03'         TO CNTL-REC-TYPE
194600     MOVE POOL-NAME2   TO CNTL-POOL-CODE
194700     MOVE 'F'          TO CNTL-POOL-TYPE
194800     MOVE CNTLKEY-AREA TO CNTLKEY
194900     PERFORM P8800-READ-CNTLFILE
195000     IF SUCCESS
195100        MOVE CNTL-EN-FI    TO WS-EN-FI-MARRIED-FLAG
195200        MOVE CNTL-CO-B1-B2 TO WS-CO-BK-MARRIED-FLAG
195300     ELSE
195400        MOVE SPACES        TO WS-EN-FI-MARRIED-FLAG
195500                              WS-CO-BK-MARRIED-FLAG
195600     END-IF
195700     MOVE 0 TO WS-ASSOCIATED-TURN-FLAG
195800     IF (FI-POOL AND EN-FI-MARRIED)
195900         SET ASSOCIATED-TURN TO TRUE
196000     END-IF
196100     IF (B1-POOL AND CO-BK-MARRIED)
196200         SET ASSOCIATED-TURN TO TRUE
196300     END-IF
196400     IF B2-POOL
196500         SET ASSOCIATED-TURN TO TRUE
196600     END-IF
196700     IF ASSOCIATED-TURN
196800         MOVE WS-UFP TO WORK-WS-UFP
196900         IF FI-POOL
197000             MOVE 'EN' TO WORK-POOL-CRAFT-CODE2
197100         END-IF
197200         IF B1-POOL
197300             MOVE 'CO' TO WORK-POOL-CRAFT-CODE2
197400         END-IF
197500         IF B2-POOL
197600             IF CO-BK-MARRIED
197700                 MOVE 'CO' TO WORK-POOL-CRAFT-CODE2
197800             ELSE
197900                 MOVE 'B1' TO WORK-POOL-CRAFT-CODE2
198000             END-IF
198100         END-IF
198200         MOVE WORK-UFPTURN-AREA TO UFPTURN
198300         EXEC CICS READ
198400                   DATASET(UFP-VIA-TURN-NBR)
198500                   INTO (WORK-WS-UFP)
198600                   LENGTH(UFPTURN-RLGTH)
198700                   RIDFLD(UFPTURN)
198800                   KEYLENGTH(UFPTURN-KLGTH)
198900                   RESP(WS-RESPONSE)
199000         END-EXEC
199100         MOVE WS-RESPONSE TO FILE-STATUS
199200         IF SUCCESS
199300             IF IN-TOWN
199400                 CONTINUE
199500             ELSE
199600***              SET NO-UPDATE TO TRUE
199700                 MOVE -1  TO SCR08Z-CODE-CURSOR
199800*                     'TURN IS ENROUTE - CANNOT UPDATE'
199900                MOVE 'T020' TO MSGLOG-CODE
200000             END-IF
200100         ELSE
200200             MOVE 'P3900' TO ERR-PARAGRAPH
200300             MOVE UFPTURN TO ERR-KEY
200400             PERFORM P9999-GOT-PROBLEM
200500         END-IF
200600     ELSE
200700***      SET NO-UPDATE TO TRUE
200800         MOVE -1  TO SCR08Z-CODE-CURSOR
200900*             'TURN IS ENROUTE - CANNOT UPDATE'
201000         MOVE 'T020' TO MSGLOG-CODE
201100     END-IF.
201200*
201300 P4000-PROCESS-FUNCTION.
201400*
201500     PERFORM P4010-VALIDATE-FUNCTION
201600     EVALUATE TRUE
201700        WHEN CALL-FUNCTION
201800             PERFORM P4100-PROCESS-CALL-FUNCTION
201900        WHEN IVR-CALL-FUNCTION
202000             PERFORM P5100-PROCESS-IVR-CALL
202100        WHEN FILL-VACANCY-FUNCTION
202200             PERFORM P4200-PROCESS-FILL-FUNCTION
202300        WHEN USER-OVERRIDE
202400             PERFORM P4300-PROCESS-HELP-FUNCTION
202500        WHEN LAYOFF-ON-CALL
202600             PERFORM P4400-PROCESS-OFF-FUNCTION
202700        WHEN ATTEMPTED-NOTIFY
202800             PERFORM P4500-ATTEMPTED-NOTIFY
202900        WHEN DISPLAY-HRS-SVC-INFO
203000             PERFORM P4600-DISPLAY-HRS-SVC-INFO
203100        WHEN CALL-BACK
203200             PERFORM P4800-CREATE-CALLBACK-TASK
203300        WHEN DISPLAY-HOS-INFO
203400             PERFORM P4900-DISPLAY-HOS-INFO
203500        WHEN IVR-CANCEL-CALL-HOME
203600             PERFORM P5200-CANCEL-IVR-CALL-HOME
203700*CNC0600-B
203800        WHEN HOS-OVERRIDE-FUNC
203900             PERFORM P5300-PROCESS-HOS-OVRD
204000*CNC0600-E
204100        WHEN OTHER
204200             SET ERRORS-FOUND TO TRUE
204300             MOVE -1 TO SCR08Z-FUNC-CURSOR
204400             MOVE REV-VIDEO TO SCR08Z-FUNC-HI
204500*                 'FUNCTION NOT YET AVAILABLE'
204600           MOVE 'F003' TO MSGLOG-CODE
204700     END-EVALUATE.
204800*
204900 P4010-VALIDATE-FUNCTION.
205000*
205100     MOVE SCR08Z-FUNC               TO WS-FUNCTION-CODE
205200*#1367
205300     IF REJECT-AND-HOLD
205400        MOVE -1 TO SCR08Z-FUNC-CURSOR
205500        MOVE REV-VIDEO TO SCR08Z-FUNC-HI
205600*            'INVALID FUNCTION CODE'
205700        MOVE 'I012' TO MSGLOG-CODE
205800        PERFORM P9000-SEND-MAP-AND-RETURN
205900     END-IF
206000
206100     IF  NOT P08CA-IVR-CALL-ACTIVE
206200     AND (IVR-CALL-FUNCTION OR IVR-CANCEL-CALL-HOME)
206300        MOVE -1                     TO SCR08Z-FUNC-CURSOR
206400        MOVE REV-VIDEO              TO SCR08Z-FUNC-HI
206500        PERFORM P5111-COMPANY-EDIT
206600        IF NOT CNTL-OUTBND-IVR-CALL-ACTIVE
206700*             IVR NOT AVAILABLE-VERIFY "OPTION 16"
206800*               IF MANUAL INTERVENTION REQUIRED
206900           MOVE 'I606'             TO MSGLOG-CODE
207000        ELSE
207100*            'IVR CALLS ARE NOT ACTIVE FOR THIS JOB'
207200           MOVE 'I392'                 TO MSGLOG-CODE
207300        END-IF
207400        PERFORM P9000-SEND-MAP-AND-RETURN
207500     END-IF
207600     IF NOT ERRORS-FOUND
207700        PERFORM VARYING I FROM 1 BY 1
207800           UNTIL I > WS-FUNCTION-TABLE-SIZE
207900           IF WS-FUNC-CODE(I) = SCR08Z-FUNC
208000              MOVE WS-FUNC-CODE(I) TO WS-FUNCTION-CODE
208100              MOVE WS-FUNCTION-TABLE-SIZE TO I
208200           ELSE
208300              IF I = WS-FUNCTION-TABLE-SIZE
208400                 SET ERRORS-FOUND TO TRUE
208500              END-IF
208600           END-IF
208700        END-PERFORM
208800     END-IF
208900     IF ERRORS-FOUND
209000*C1067 - 05/12/15 - BEG
209100***     PERFORM VARYING WS-MC-SUB FROM 1 BY 1
209200***        UNTIL WS-MC-SUB > WS-MC-MAX
209300***        IF WS-MISS-CALL-CODE(WS-MC-SUB) = SCR08Z-FUNC
209400***           AND SCR08Z-FUNC > SPACE
209500***           MOVE '0'               TO ERRORS-FLAG
209600***           SET MISSING-CALL       TO TRUE
209700***           MOVE WS-MC-MAX         TO WS-MC-SUB
209800***        END-IF
209900***     END-PERFORM
210000     OR REJECT-EMPLOYEE-FUNCTION
210100        SET FIND-MC-CODE             TO TRUE
210200*
210300        IF REJECT-EMPLOYEE-FUNCTION
210400           PERFORM P4015-CHECK-MISSED-CALL-TABLE
210500        END-IF
210600*
210700        IF FIND-MC-CODE
210800           PERFORM VARYING WS-MC-SUB FROM 1 BY 1
210900              UNTIL WS-MC-SUB > WS-MC-MAX
211000              IF WS-MISS-CALL-CODE(WS-MC-SUB) = SCR08Z-FUNC
211100                 AND SCR08Z-FUNC > SPACE
211200                 MOVE '0'               TO ERRORS-FLAG
211300                 SET MISSING-CALL       TO TRUE
211400                 MOVE WS-MC-MAX         TO WS-MC-SUB
211500              END-IF
211600           END-PERFORM
211700        END-IF
211800
211900*C1067 - 05/12/15 - END
212000     END-IF
212100     IF ERRORS-FOUND
212200        MOVE -1 TO SCR08Z-FUNC-CURSOR
212300        MOVE REV-VIDEO TO SCR08Z-FUNC-HI
212400*            'INVALID FUNCTION CODE'
212500        MOVE 'I012' TO MSGLOG-CODE
212600        PERFORM P9000-SEND-MAP-AND-RETURN
212700     END-IF
212800     IF (CALL-FUNCTION
212900     OR  IVR-CALL-FUNCTION
213000     OR  FILL-VACANCY-FUNCTION
213100     OR  USER-OVERRIDE)
213200     AND SCR08Z-ST > SPACES
213300        MOVE SPACES         TO SCR08Z-ST
213400                               SCR08Z-ECC
213500     END-IF
213600
213700     MOVE SCR08Z-CODE               TO CODE-AREA
213800     IF IVR-CANCEL-CALL-HOME
213900        IF NOT P08ZCA-FROM-03A-04S
214000           MOVE -1                  TO SCR08Z-FUNC-CURSOR
214100           MOVE REV-VIDEO           TO SCR08Z-FUNC-HI
214200*               'VCAN ONLY VALID FROM TASK LIST'
214300           MOVE 'V169'              TO MSGLOG-CODE
214400           PERFORM P9000-SEND-MAP-AND-RETURN
214500        END-IF
214600        IF NOT DEADHEAD-HOME
214700           MOVE -1                  TO SCR08Z-FUNC-CURSOR
214800           MOVE REV-VIDEO           TO SCR08Z-FUNC-HI
214900*               'VCAN ONLY VALID ON DEADHEAD HOME'
215000           MOVE 'V170'              TO MSGLOG-CODE
215100           PERFORM P9000-SEND-MAP-AND-RETURN
215200        END-IF
215300     END-IF
215400
215500     IF FILL-VACANCY-FUNCTION
215600     AND DEADHEAD-HOME
215700        MOVE -1 TO SCR08Z-FUNC-CURSOR
215800        MOVE REV-VIDEO TO SCR08Z-FUNC-HI
215900*            'ONLY HELP FUNCTION IS VALID FOR DEADHEAD HOME'
216000        MOVE 'O011' TO MSGLOG-CODE
216100        PERFORM P9000-SEND-MAP-AND-RETURN
216200     END-IF
216300*CNC0600-B
216400     MOVE SPACES               TO CNTLKEY-AREA
216500     MOVE '02'                 TO CNTL-REC-TYPE
216600     MOVE SCR08Z-DIST          TO CNTL-DIST
216700     MOVE SCR08Z-SUB-DIST      TO CNTL-SUB-DIST
216800     MOVE CNTLKEY-AREA         TO CNTLKEY
216900     PERFORM P8800-READ-CNTLFILE
217000     IF NOT SUCCESS
217100        MOVE 'P4010-1'         TO ERR-PARAGRAPH
217200        MOVE CNTLKEY           TO ERR-KEY
217300        PERFORM P9999-GOT-PROBLEM
217400     END-IF
217500     MOVE CNTL-CAN-WRR-FLAG    TO WS-CAN-WRR-FLAG
217600
217700     IF WS-CAN-WRR-NEW AND SCR08Z-FUNC = 'RJHS'
217800        MOVE -1                TO SCR08Z-FUNC-CURSOR
217900        MOVE REV-VIDEO         TO SCR08Z-FUNC-HI
218000*             'RJHS NOT ALLOWED WITH NEW CANADIAN WORK REST RULES'
218100        MOVE 'R135'            TO MSGLOG-CODE
218200        PERFORM P9000-SEND-MAP-AND-RETURN
218300     END-IF
218400
218500     IF MISSING-CALL AND P08ZCA-HOSO-ALLOW
218600        AND NOT P08ZCA-HOSO-DONE
218700        MOVE -1                TO SCR08Z-FUNC-CURSOR
218800        MOVE REV-VIDEO         TO SCR08Z-FUNC-HI
218900*             'CANNOT COMPLETE MISS CALL, USE FUNC HOSO TO
219000*                                      OVERRIDE HOS RULE'
219100        MOVE 'C330'            TO MSGLOG-CODE
219200        PERFORM P9000-SEND-MAP-AND-RETURN
219300     END-IF
219400
219500     IF HOS-OVERRIDE-FUNC
219600        AND NOT P08ZCA-HOSO-ALLOW
219700        MOVE -1                TO SCR08Z-FUNC-CURSOR
219800        MOVE REV-VIDEO         TO SCR08Z-FUNC-HI
219900*       HOS OVERRIDE NOT ALLOWED
220000        MOVE 'H051'            TO MSGLOG-CODE
220100        PERFORM P9000-SEND-MAP-AND-RETURN
220200     END-IF
220300     IF HOS-OVERRIDE-FUNC
220400        AND P08ZCA-HOSO-DONE
220500        MOVE -1                TO SCR08Z-FUNC-CURSOR
220600        MOVE REV-VIDEO         TO SCR08Z-FUNC-HI
220700*       HOS OVERRIDE ALREADY COMPLETED
220800        MOVE 'H052'            TO MSGLOG-CODE
220900        PERFORM P9000-SEND-MAP-AND-RETURN
221000     END-IF
221100*CNC0600-E
221200
221300     IF P08ZCA-FROM-03A-04S
221400     AND (CALL-FUNCTION
221500      OR  FILL-VACANCY-FUNCTION
221600      OR  USER-OVERRIDE
221700      OR  LAYOFF-ON-CALL
221800      OR  ATTEMPTED-NOTIFY)
221900        MOVE P08ZCA-EMP-NO           TO MSTRNBRK
222000        PERFORM P8550-READ-MASTER-UPDATE
222100        IF MSTR-LAST-LAYOFF-CODE > SPACES
222200           MOVE MSTR-LAST-LAYOFF-CODE TO LAYOFF-CODE
222300        END-IF
222400        MOVE SPACES                  TO MSTR-LAST-LAYOFF-CODE
222500                                        MSTR-IVR-SAVE-DEC-KEY
222600                                        MSTR-IVR-SAVE-LAST-POS
222700                                        MSTR-IVR-SAVE-LAST-SEN
222800                                        MSTR-IVR-SAVE-LAST-STARTS
222900        PERFORM P8560-REWRITE-MASTER
223000        MOVE P08CA-TASK-KEY          TO TASK-LOCATION-KEY
223100                                        TASKTIME
223200        PERFORM P8310-DELETE-TASK
223300        MOVE SPACE                   TO P08ZCA-FROM-EXECUTE-PGMS
223400     END-IF
223500
223600     MOVE DEFAULT-ATTR TO SCR08Z-FUNC-HI
223700                          SCR08Z-ST-HI
223800                          SCR08Z-ECC-HI
223900                          SCR08Z-NAME-HI
224000     .
224100*C1067 - 05/12/15 - BEG
224200*
224300 P4015-CHECK-MISSED-CALL-TABLE.
224400*
224500     MOVE P08ZCA-EMP-NO                TO MSTRNBRK
224600     PERFORM P8500-READ-MASTER
224700     PERFORM P8510-MASTER-JOBS
224800     IF (TEMP-ASGN-XB
224900        OR (NORM-ASGN-XB AND TEMPORARY-ASGNMT NOT > SPACE))
225000        AND ON-DUTY-ASGNMT NOT > SPACE
225100        MOVE SPACES                    TO WK-CNTL-MC-CNTLKEY
225200        MOVE '69'                      TO WK-CNTL-MC-REC-TYPE
225300        MOVE WS-FUNCTION-CODE          TO WK-CNTL-MC-CODE
225400*
225500        IF SCR08Z-TYPE = 'P'
225600           MOVE 'RD'                   TO WK-CNTL-MC-TYPE-SVC
225700        ELSE
225800           MOVE P08ZCA-ASSIGNMENT      TO WORK-AJ-KEY
225900           SET AJ-VACANCY              TO TRUE
226000           SET AJ-ASGN                 TO TRUE
226100           PERFORM P7000-FIND-ASGN-CLASS
226200           MOVE WORK-AJ-JOB-NO         TO JOB-DEF-CHECK
226300           IF JOB-DEF-YARD-ASGN
226400              MOVE 'YD'                TO WK-CNTL-MC-TYPE-SVC
226500           ELSE
226600              MOVE 'RD'                TO WK-CNTL-MC-TYPE-SVC
226700           END-IF
226800        END-IF
226900*
227000        IF TEMPORARY-ASGNMT > SPACES
227100           MOVE TA-DIST                TO WK-CNTL-MC-DIST
227200           MOVE TA-SUB-DIST            TO WK-CNTL-MC-SDIST
227300           MOVE TA-CC                  TO WK-CNTL-MC-XB
227400        ELSE
227500           MOVE NA-DIST                TO WK-CNTL-MC-DIST
227600           MOVE NA-SUB-DIST            TO WK-CNTL-MC-SDIST
227700           MOVE NA-CC                  TO WK-CNTL-MC-XB
227800        END-IF
227900        MOVE MSTR-CONS-MISSED-CALLS    TO WK-CNTL-MC-CONS
228000        PERFORM P8810-READ-MC-CONTROL
228100        IF NOT SUCCESS
228200           MOVE '**'                   TO WK-CNTL-MC-XB
228300           PERFORM P8810-READ-MC-CONTROL
228400           IF NOT SUCCESS
228500              MOVE '**'                TO WK-CNTL-MC-SDIST
228600              PERFORM P8810-READ-MC-CONTROL
228700              IF NOT SUCCESS
228800                 MOVE '**'             TO WK-CNTL-MC-DIST
228900                 PERFORM P8810-READ-MC-CONTROL
229000              END-IF
229100           END-IF
229200        END-IF
229300        IF NOT SUCCESS
229400           SET DONT-FIND-MC-CODE       TO TRUE
229500        END-IF
229600     ELSE
229700        SET DONT-FIND-MC-CODE          TO TRUE
229800     END-IF.
229900*C1067 - 05/12/15 - END
230000*
230100 P4100-PROCESS-CALL-FUNCTION.
230200*
230300     IF P08ZCA-EMP-NO NOT > SPACES
230400*            'IMPROPER FUNCTION - NO ASSIGNMENT PRESENT'
230500        MOVE 'I049' TO MSGLOG-CODE
230600        MOVE -1                      TO SCR08Z-FUNC-CURSOR
230700        MOVE REV-VIDEO               TO SCR08Z-FUNC-HI
230800        PERFORM P9000-SEND-MAP-AND-RETURN
230900     END-IF
231000*    IF P08ZCA-EMP-RESTRICTED
231100*       MOVE SPACES                  TO P08ZCA-EMP-RESTR
231200*       MOVE 'EMPLOYEE HAS RESTRICTIONS - USE "RJNQ" TO REJECT'
231300*                                    TO SCR08Z-ERRORMSG
231400*       MOVE -1                      TO SCR08Z-FUNC-CURSOR
231500*       MOVE REV-VIDEO               TO SCR08Z-FUNC-HI
231600*       PERFORM P9000-SEND-MAP-AND-RETURN
231700*    END-IF
231800     MOVE P08ZCA-EMP-NO              TO MSTRNBRK
231900     PERFORM P8500-READ-MASTER
232000     IF WORKING
232100        PERFORM P4120-EDIT-WORKING
232200     END-IF
232300     IF P08ZCA-DHD-HOME
232400        PERFORM P3020-EDIT-MILES-TIME
232500     END-IF
232600     PERFORM P4610-GET-HRS-SVC-INFO
232700     IF P925-EMP-STATUS-RED
              IF NOT P08ZCA-DHD-HOME
                 AND WS-CAN-WRR-OLD
      *            EMP STATUS PROHIBITS CALL
                 MOVE -1               TO SCR08Z-NAME-CURSOR
                 MOVE 'E030'           TO MSGLOG-CODE
                 MOVE -1               TO SCR08Z-FUNC-CURSOR
                 MOVE REV-VIDEO        TO SCR08Z-FUNC-HI
233700           PERFORM P9000-SEND-MAP-AND-RETURN
              END-IF
232800*CNC0600-B
232900        IF WS-CAN-WRR-NEW
      *CNLD-259 B CNC0600
                 IF WS-RFR-LEAD-IN-SYS-UD
                    OR WS-RFR-OD-IN-SYS-RB
      *             P08ZCA-HOSO-DENY WILL BE TRUE;
      *             CALL SHOULD NOT BE ALLOWED IF WS-RFR-LEAD-IN-SYS-UD
      *             OR WS-RFR-OD-IN-SYS-RB ARE TRUE: EMP IS IN SYS RESET
                    PERFORM P4216-MSGS-FOR-RED-NO-HOSO
237400              MOVE -1            TO SCR08Z-FUNC-CURSOR
237500              MOVE REV-VIDEO     TO SCR08Z-FUNC-HI
237600              PERFORM P9000-SEND-MAP-AND-RETURN
233800           END-IF
      *CNLD-259 E
232900           IF WS-EMP-UNDST-REST
233000              MOVE WS-UD-MESG TO SCR08Z-PHONE
233100              MOVE YELLOW  TO SCR08Z-PHONE-COLOR
                    MOVE RED     TO SCR08Z-NAME-COLOR
233200              SET P925-EMP-STATUS-RED TO TRUE
233300              SET P925-OVERRIDE-DENY TO TRUE
      *CNLD-259 B CNC0600
235400              MOVE P925-OVERRIDE-ALLOW-FLAG
235400                                           TO P08ZCA-HOSO-ALLOW-FL
235600              PERFORM P9000-SEND-MAP-AND-RETURN
      *CNLD-259 E
233800           END-IF
234100*CNLD-259 B CNC0600
234100*          IF P925-LOCAL-LT-RESET
234100           IF P925-LOCAL-LE-UDR2
234100*CNLD-259 E CNC0600
234700              MOVE P925-RB-MSG-1-HRMN(1:2) TO WS-RB-1-HH
234800              MOVE P925-RB-MSG-1-HRMN(3:2) TO WS-RB-1-MM
234900              MOVE WS-RB-1-MESG TO SCR08Z-PHONE
235000              MOVE YELLOW     TO SCR08Z-PHONE-COLOR
235100              MOVE P925-REST-STATUS-FLAG TO WS-SAVE-REST-STATUS
235200              SET P925-EMP-STATUS-RED TO TRUE
235300              SET P925-OVERRIDE-DENY TO TRUE
235400             MOVE P925-OVERRIDE-ALLOW-FLAG TO P08ZCA-HOSO-ALLOW-FL
235600              PERFORM P9000-SEND-MAP-AND-RETURN
235700           END-IF
235800
235900           IF NOT P08ZCA-DHD-HOME
                 AND WS-CAN-WRR-NEW
236100              IF P08ZCA-HOSO-ALLOW
236200                 PERFORM P4215-MSGS-FOR-RED-STATUS
236600              ELSE
                       PERFORM P4216-MSGS-FOR-RED-NO-HOSO
237200              END-IF
237300*CNC0600-E
237400              MOVE -1            TO SCR08Z-FUNC-CURSOR
237500              MOVE REV-VIDEO     TO SCR08Z-FUNC-HI
237600              PERFORM P9000-SEND-MAP-AND-RETURN
237700           END-IF
237700        END-IF
237800     END-IF
      *CNLD-245-B
           IF ((ENGINE-CRAFT AND TRCN-EN-REST-REQ = ('U' OR 'B'))
               OR (NOT ENGINE-CRAFT
                     AND TRCN-TR-REST-REQ = ('U' OR 'B')))
      *CNLD-285-B 11/01/23
               IF ((ENGINE-CRAFT AND TRCN-EN-REST-REQ = 'U')
                   OR (NOT ENGINE-CRAFT
                         AND TRCN-TR-REST-REQ = 'U'))
      *           WS-EMP-UNDST-REST-FLAG IS INITIALIZED ELSEWHERE
      *           WHEN TRCN-EN/TR-REST-REQ = 'B', CHECK CNLD-285 TAGS
                  MOVE SPACES     TO WS-EMP-UNDST-REST-FLAG
               END-IF
               MOVE SPACES     TO WS-REST-US-STATUS-FLAG
      *CNLD-285-E
              PERFORM P3050-CHECK-US-UNDIST-REST
336800     END-IF
           IF WS-EMP-US-STATUS-RED
      *         'EMPLOYEES STATUS PROHIBITS CALL'
              MOVE 'E030'           TO MSGLOG-CODE
              PERFORM P9000-SEND-MAP-AND-RETURN
           END-IF
      *CNLD-245-E
237900*
238000*08/06 - JES - IVR CALLS WILL NOW PERFORM THE REMAINDER OF THIS
238100*              PARAGRAPH IN CNP0ER
238200     IF IVR-CALL-FUNCTION
238300        MOVE P08ZCA-EMP-NO           TO MSTRNBRK
238400        PERFORM P8550-READ-MASTER-UPDATE
238500        MOVE LAYOFF-CODE             TO MSTR-LAST-LAYOFF-CODE
238600        MOVE 'B'                     TO LAYOFF-CODE-1
238700        IF LAYOFF-CODE-2 = '1'
238800           CONTINUE
238900        ELSE
239000           MOVE '8'                  TO LAYOFF-CODE-2
239100        END-IF
239200        MOVE P08ZCA-DEC-KEY          TO MSTR-IVR-SAVE-DEC-KEY
239300        MOVE P08ZCA-LAST-POS         TO MSTR-IVR-SAVE-LAST-POS
239400        MOVE P08ZCA-LAST-SEN         TO MSTR-IVR-SAVE-LAST-SEN
239500        MOVE P08ZCA-LAST-STARTS      TO MSTR-IVR-SAVE-LAST-STARTS
239600        PERFORM P8560-REWRITE-MASTER
239700
239800*           'EMPLOYEE IVR CALL INITIATED'
239900        MOVE 'E334' TO MSGLOG-CODE
240000        MOVE 'Y'              TO P08ZCA-LOCK-FLAG
240100        MOVE AUTOSKIP-MDT     TO SCR08Z-NAME-ATTR
240200                                 SCR08Z-FUNC-ATTR
240300                                 SCR08Z-ST-ATTR
240400                                 SCR08Z-ECC-ATTR
240500     ELSE
240600*
240700*       QUICK TIE THE PERSON IF ALREADY WORKING
240800*
240900        IF WORKING
241000           PERFORM P4140-QUICK-TIE-EMPLOYEE
241100        END-IF
241200
241300*CNLD-133-B
241400        IF WS-CAN-WRR-NEW
241500           PERFORM P4110-CHECK-NATURAL-RESET-BRK
241600        END-IF
241700*CNLD-133-E
241800*
241900        MOVE SPACES                  TO P920-COMMAREA-PARMS
242000        MOVE P925-REST-STATUS-FLAG   TO P920-DHD-EMP-REST-STATUS
242100        MOVE WS-TIME-ZONE            TO P920-TIME-ZONE
242200        SET P920-DEADHEAD-FUNCTION   TO TRUE
242300        IF P08ZCA-DHD-TYPE = 'A'
242400           SET P920-ASGN-AJ          TO TRUE
242500           SET AJ-ASGN               TO TRUE
242600        ELSE
242700           SET P920-ASGN-UFP         TO TRUE
242800           SET UFP-ASGN              TO TRUE
242900        END-IF
243000        IF P08ZCA-DHD-HOME
243100           SET P920-DEADHEAD-HOME    TO TRUE
243200        ELSE
243300           MOVE P08ZCA-ASSIGNMENT    TO P920-ASGN-PARM
243400           PERFORM P7000-FIND-ASGN-CLASS
243500        END-IF
243600        MOVE WS-ASGN-MERG-CLASS      TO P920-ASGN-MERG-CLASS
243700*CNLD-302  B  COMMENTING
243700**CNC0600
243800*        MOVE WS-ASGN-OUTPOST         TO P920-ASGN-OUTPOST
243700*CNLD-302  E
243900        MOVE P08ZCA-EFF-DATE         TO P920-DHD-DATE
244000        MOVE P08ZCA-EFF-HRMN         TO P920-DHD-TIME
244100        MOVE SCR08Z-FURTHER-N        TO P920-DHD-FURTH-NOT-FLAG
244200        MOVE SCR08Z-HRMN             TO P920-DHD-DURATION
244300        MOVE SCR08Z-FUNC             TO P920-DHD-FUNCTION
244400        MOVE P08ZCA-EMP-NO           TO P920-DHD-EMP-NO
244500        IF P08ZCA-DEC-KEY > SPACES
244600           MOVE P08ZCA-DEC-KEY       TO P920-DHD-DECKEY
244700        END-IF
244800*-------------------------------------------------------------
244900*       IF DEADHEADING FROM A FASTSLOW SPAREBOARD, USE THE
245000*       FLAG RETURNED FROM DECISION TABLE PROCESSING TO DETERMINE
245100*       ROAD VS. YARD.
245200*----------------------------------------------------------PLS
245300        IF P08ZCA-FROM-FAST-BOARD
245400           SET P920-FROM-FAST-BOARD      TO TRUE
245500        ELSE
245600           IF P08ZCA-FROM-SLOW-BOARD
245700              SET P920-FROM-FAST-BOARD   TO TRUE
245800           ELSE
245900              MOVE SPACES        TO P920-DHD-FASTSLOW-BOARD
246000           END-IF
246100        END-IF
246200        MOVE SCR08Z-MODE             TO P920-DHD-MODE-OF-TRANS
246300        IF SCR08Z-MILES > SPACES
246400           MOVE SCR08Z-MILES         TO P920-DHD-MILES-CLMD
246500        ELSE
246600           MOVE ZEROES               TO P920-DHD-MILES-CLMD
246700        END-IF
246800        MOVE P08CA-PROFILE-KEY       TO P920-DHD-PROFILE-KEY
246900        MOVE PSTCA-SUB               TO P920-SUB-CODE
247000        IF P08ZCA-RJHS-EMP-NO > SPACES
247100           MOVE P08ZCA-RJHS-EMP-NO   TO P920-DHD-RJHS-EMPNO
247200        END-IF
247300        EXEC CICS LINK
247400                  PROGRAM(P920-PGM)
247500                  COMMAREA(P920-COMMAREA-PARMS)
247600                  LENGTH(P920-LGTH)
247700                  RESP(WS-RESPONSE)
247800        END-EXEC
247900        MOVE WS-RESPONSE TO FILE-STATUS
248000        IF NOT SUCCESS
248100           MOVE 'P4100-1' TO ERR-PARAGRAPH
248200           PERFORM P9999-GOT-PROBLEM
248300        END-IF
248400        MOVE P920-DHD-EMP-NO TO MSTRNBRK
248500        PERFORM P8500-READ-MASTER
248600        IF NOT SUCCESS
248700           MOVE 'P4100-2' TO ERR-PARAGRAPH
248800           PERFORM P9999-GOT-PROBLEM
248900        END-IF
249000        IF P920-MISC-MESSAGE > SPACES
249100           MOVE P920-MISC-MESSAGE TO SCR08Z-ERRORMSG
249200        ELSE
249300*               'EMPLOYEE CALL SUCCESSFULL'
249400           MOVE 'E005' TO MSGLOG-CODE
249500        END-IF
249600        MOVE 'Y'              TO P08ZCA-LOCK-FLAG
249700        MOVE AUTOSKIP-MDT     TO SCR08Z-NAME-ATTR
249800                                    SCR08Z-FUNC-ATTR
249900                                    SCR08Z-ST-ATTR
250000                                    SCR08Z-ECC-ATTR
250100*C1194 - BEG
250200        PERFORM P6000-CLEAR-SHORT-CALL
250300*C1194 - END
250400     END-IF
250500     .
250600*TJR 2/21/2001 COMMENT OUT THIS PERFORM, NO REASON TO GO BACK
250700*              TO THIS RTN, IT WAS DISPLAYING A WARNING MSG
250800*              EVEN AFTER THE EMPLOYEE WAS CALLED.
250900**** PERFORM P4210-SETUP-NAME-INFO.
251000* CALL NEW CODE IN P919 TO CHECK NATURAL RESET BREAK
251100*CNLD-133-B
251200*
251300 P4110-CHECK-NATURAL-RESET-BRK.
251400*
251500     MOVE SPACES                TO P919-COMMAREA-PARMS
251600     SET P919-DH-FUNCTION       TO TRUE
251600* 5/19/2023 RJA B
251600     IF TRCN-DEP-STN = EMP-HOME-TERM-CODE
251600        SET P919-CALLED-FROM-HOME TO TRUE
251900     ELSE
251600        SET P919-CALLED-FROM-AWAY TO TRUE
252100     END-IF
251600* 5/19/2023 RJA E
251700     IF P08ZCA-DHD-TYPE = 'A'
251800        SET P919-ASGN-AJ        TO TRUE
251900     ELSE
252000        SET P919-ASGN-UFP       TO TRUE
252100     END-IF
252200     MOVE SCR08Z-DIST           TO P919-CALL-DIST
252300     MOVE SCR08Z-SUB-DIST       TO P919-CALL-SUB-DIST
252400     MOVE P08ZCA-ASSIGNMENT     TO P919-ASGN-PARM
252500     MOVE P08ZCA-EFF-DATE       TO P919-EFF-DATE
252600     MOVE P08ZCA-EFF-HRMN       TO P919-EFF-TIME
252700     MOVE P08ZCA-EMP-NO         TO P919-ASGN-ON-DUTY-EMP
252800     MOVE P08ZCA-EFF-TIME       TO P919-TRAIN-DATE-TIME
252900     MOVE WS-TIME-ZONE          TO P919-TIME-ZONE
253000     MOVE SCR08Z-CODE           TO P919-TRAIN
253100     MOVE SCR08Z-CRAFT          TO P919-CALL-CC
253200     MOVE P925-CAN-WRR-LEAD-TIME
253300                                TO P919-CAN-WRR-LEAD-TIME
253400*
253500     EXEC CICS LINK
253600               PROGRAM(P919-PGM)
253700               COMMAREA(P919-COMMAREA-PARMS)
253800               LENGTH(P919-LGTH)
253900               RESP(WS-RESPONSE)
254000     END-EXEC
254100     MOVE WS-RESPONSE TO FILE-STATUS
254200     IF NOT SUCCESS
254300        MOVE 'P4110-1' TO ERR-PARAGRAPH
254400        PERFORM P9999-GOT-PROBLEM
254500     END-IF.
254600*CNLD-133-E
254700*
254800 P4120-EDIT-WORKING.
254900*
255000* ALLOW CALL OF AN EMPLOYEE WHO IS STILL WORKING THE PREV SHIFT
255100* AS LONG AS QUICK TIEUP IS ALLOWED IN THE SUB-DIST OF THE PREV
255200* ASSIGNMENT AND THE PERSON IS WORKING AN ASSIGNED JOB.
255300*
255400     PERFORM P8510-MASTER-JOBS
255500     IF ON-DUTY-ASGNMT > SPACES AND
255600        ON-DUTY-AJ AND
255700        EMP-TRHIST-KEY > SPACE
255800        MOVE SPACES                  TO WS-CNTL-FILE
255900        SET SUB-DIST-TYPE-2A-REC     TO TRUE
256000        MOVE OD-DIST                 TO CNTL-DIST
256100        MOVE OD-SUB-DIST             TO CNTL-SUB-DIST
256200        MOVE CNTLKEY-AREA            TO CNTLKEY
256300        PERFORM P8800-READ-CNTLFILE
256400        IF NOT SUCCESS
256500           MOVE 'P4120-1'            TO ERR-PARAGRAPH
256600           MOVE CNTLKEY              TO ERR-KEY
256700           PERFORM P9999-GOT-PROBLEM
256800        END-IF
256900     ELSE
257000        MOVE 'N'                     TO CNTL-RESTRICT-TIE-FLAG
257100     END-IF
257200     IF CNTL-DONT-RESTRICT-TIE
257300        MOVE -1                      TO SCR08Z-FUNC-CURSOR
257400        MOVE REV-VIDEO               TO SCR08Z-FUNC-HI
257500*            'EMPLOYEES STATUS PROHIBITS CALL'
257600        MOVE 'E030'                  TO MSGLOG-CODE
257700        PERFORM P9000-SEND-MAP-AND-RETURN
257800     END-IF
257900     MOVE ASGN-ON-DUTY-DATE-TIME     TO WS-PREV-ON-DUTY-DATE-TIME.
258000
258100 P4140-QUICK-TIE-EMPLOYEE.
258200
258300     MOVE EMP-TRHIST-KEY             TO AH1KEY
258400     MOVE AH-FILE-VIA-K1             TO AH-DATASET
258500     PERFORM P8200-READ-AHIST
258600     IF NOT SUCCESS
258700        MOVE 'P4140-1'               TO ERR-PARAGRAPH
258800        MOVE AH1KEY                  TO ERR-KEY
258900        PERFORM P9999-GOT-PROBLEM
259000     END-IF
259100*
259200*    READ THE 'SUB DISTRICT' CONTROL RECORD FOR ON DUTY ASSIGNMENT
259300*
259400     MOVE SPACES                     TO WS-CNTL-FILE
259500     SET SUB-DIST-TYPE-REC           TO TRUE
259600     MOVE OD-DIST                    TO CNTL-DIST
259700     MOVE OD-SUB-DIST                TO CNTL-SUB-DIST
259800     MOVE CNTLKEY-AREA               TO CNTLKEY
259900     PERFORM P8800-READ-CNTLFILE
260000     IF NOT SUCCESS
260100        MOVE 'P4140-2'               TO ERR-PARAGRAPH
260200        MOVE CNTLKEY                 TO ERR-KEY
260300        PERFORM P9999-GOT-PROBLEM
260400     END-IF
260500     MOVE CNTL-TIME-ZONE             TO WS-PREV-ASGN-TIME-ZONE
260600
260700     MOVE ZEROS                      TO DATE-CONVERSION-PARMS
260800     SET PARM-ADD                    TO TRUE
260900     MOVE ASGN-ON-DUTY-DATE          TO PARM-PRI-DATE-GREG
261000     MOVE ASGN-ON-DUTY-TIME          TO PARM-PRI-HRMN
261100     MOVE 0800                       TO PARM-SEC-HRMN
261200     EXEC CICS LINK
261300               PROGRAM(P903-PGM)
261400               COMMAREA(DATE-CONVERSION-PARMS)
261500               LENGTH(P903-LGTH)
261600               RESP(WS-RESPONSE)
261700     END-EXEC
261800     MOVE WS-RESPONSE                TO FILE-STATUS
261900     IF NOT SUCCESS
262000        MOVE 'P4140-3'               TO ERR-PARAGRAPH
262100        MOVE 'P903LINK'              TO ERR-KEY
262200        PERFORM P9999-GOT-PROBLEM
262300     END-IF
262400     MOVE PARM-RES-DATE-GREG         TO WS-PREV-OFF-DUTY-DATE
262500     MOVE PARM-RES-HRMN              TO WS-PREV-OFF-DUTY-TIME
262600     SET DE-YYMMDD-FORMAT            TO TRUE
262700
262800     IF WS-TIME-ZONE              NOT = WS-PREV-ASGN-TIME-ZONE
262900        MOVE SPACES                  TO TZ-PARAMETERS
263000        MOVE WS-TIME-ZONE            TO TZ-IN-ZONE
263100        MOVE P08ZCA-EFF-TIME         TO TZ-IN-DATE-TIME
263200        MOVE WS-PREV-ASGN-TIME-ZONE  TO TZ-OUT-ZONE
263300        PERFORM P8996-TIMEZONE
263400        IF TZ-INVALID-PARAMETERS
263500           MOVE 'P4140-4'            TO ERR-PARAGRAPH
263600           PERFORM P8996-TZERROR
263700        END-IF
263800        MOVE TZ-OUT-DATE-TIME        TO WS-NEW-ON-DUTY-DATE-TIME
263900     ELSE
264000        MOVE P08ZCA-EFF-TIME         TO WS-NEW-ON-DUTY-DATE-TIME
264100     END-IF
264200
264300     SET DE-YYMMDD-FORMAT            TO TRUE
264400     MOVE WS-NEW-ON-DUTY-DATE        TO DE-YYMMDD
264500     PERFORM P8998-DATEEDIT
264600     MOVE DE-CCYYMMDD                TO DE-COMPARE1-DATE
264700     MOVE WS-NEW-ON-DUTY-TIME        TO DE-COMPARE1-TIME
264800
264900     SET DE-YYMMDD-FORMAT            TO TRUE
265000     MOVE WS-PREV-OFF-DUTY-DATE      TO DE-YYMMDD
265100     PERFORM P8998-DATEEDIT
265200     MOVE DE-CCYYMMDD                TO DE-COMPARE2-DATE
265300     MOVE WS-PREV-OFF-DUTY-TIME      TO DE-COMPARE2-TIME
265400*
265500* COMPARE1 HAS CALL TIME OF NEW ASSIGNMENT                    *
265600* COMPARE2 HAS OFFD TIME OF PREV ASSIGNMENT CURRENTLY WORKING *
265700
265800     MOVE SPACES                     TO P922-COMMAREA-PARMS
265900     SET P922-QUICK-TIE-UP           TO TRUE
266000     MOVE OD-DIST                    TO P922-AJ-DIST
266100     MOVE OD-SUB-DIST                TO P922-AJ-SUB-DIST
266200     MOVE OD-AREA                    TO P922-AJ-ASSIGN
266300     MOVE OD-CC                      TO P922-AT-CC
266400     MOVE WS-PREV-ON-DUTY-DATE       TO P922-JOB-OD-DATE
266500     MOVE WS-PREV-ON-DUTY-TIME       TO P922-JOB-OD-TIME
266600     MOVE WS-PREV-ASGN-TIME-ZONE     TO P922-TIME-ZONE
266700     IF DE-COMPARE1-DATE-TIME > DE-COMPARE2-DATE-TIME
266800        MOVE DE-COMPARE2-DATE-TIME(3:10)
266900                                     TO P922-OFFD-DATE-TIME
267000                                        P922-ARR-DATE-TIME
267100     ELSE
267200        MOVE DE-COMPARE1-DATE-TIME(3:10)
267300                                     TO P922-OFFD-DATE-TIME
267400                                        P922-ARR-DATE-TIME
267500     END-IF
267600     MOVE AH-MISC-JOB-TYPE           TO P922-JOB-TYPE
267700     MOVE AH-MISC-WRKG-UNITS         TO P922-WORKING-UNITS
267800     MOVE AH-CALL-XREF-ID            TO P922-CALL-XREF-ID
267900     MOVE AH-MISC-ROUTE-DESIGNATION  TO P922-ROUTE-DESIGNATION
268000     MOVE EMP-NBR OF WS-MSTR         TO P922-TU-EMP-NBR
268100     EXEC CICS LINK
268200               PROGRAM(P922-PGM)
268300               COMMAREA(P922-COMMAREA-PARMS)
268400               LENGTH(P922-LGTH)
268500               RESP(WS-RESPONSE)
268600     END-EXEC
268700     MOVE WS-RESPONSE                TO FILE-STATUS
268800     IF NOT SUCCESS
268900        MOVE 'P4140-5'               TO ERR-PARAGRAPH
269000        MOVE 'P922LINK'              TO ERR-KEY
269100        PERFORM P9999-GOT-PROBLEM
269200     END-IF.
269300
269400 P4200-PROCESS-FILL-FUNCTION.
269500*
269600     IF REJECT-EMPLOYEE-FUNCTION
269700        AND P08ZCA-DEC-KEY NOT > SPACES
269800        IF REJECT-HRS-SERVICE
269900           CONTINUE
270000        ELSE
270100           MOVE -1 TO SCR08Z-FUNC-CURSOR
270200*            'FILL IS REQUIRED BEFORE "REJECT" IS POSSIBLE'
270300           MOVE 'F010' TO MSGLOG-CODE
270400           PERFORM P9000-SEND-MAP-AND-RETURN
270500        END-IF
270600     END-IF
270700     MOVE SPACES                         TO P923-COMMAREA-PARMS
270800     IF REJECT-HRS-SERVICE
270900        PERFORM P4700-REJECT-HRS-SVC
271000     END-IF
271100     MOVE SCR08Z-FUNC                    TO P923-FILL-FUNC-CODE
271200*C1067 - 05/12/15 - BEG
271300*
271400*    IF WE ARE REJECTING THE EMPLOYEE, AND HE'S BEING TREATED AS
271500*    'MISS CALLED', SET THE P923-FILL-FUNC-CODE TO 'MCAL' SO THAT
271600*    923 DOESN'T WRITE A SECOND HISTORY RECORD FOR HIM.
271700*
271800     IF NOT REJECT-EMPLOYEE-FUNCTION
271900        AND P923-REJECT-EMPLOYEE-FUN
272000        MOVE WS-FUNCTION-CODE            TO P923-FILL-FUNC-CODE
272100     END-IF
272200*C1067 - 05/12/15 - END
272300     IF P08ZCA-SAVE-CALL-DATE-TIME > SPACES
272400        MOVE P08ZCA-SAVE-CALL-DATE       TO P923-CALL-DATE
272500                                            P923-ORDER-DATE
272600        MOVE P08ZCA-SAVE-CALL-TIME       TO P923-CALL-TIME
272700                                            P923-ORDER-TIME
272800                                            P923-ASGN-CALL-TIME
272900     ELSE
273000        MOVE P08ZCA-EFF-DATE             TO P923-CALL-DATE
273100                                            P923-ORDER-DATE
273200        MOVE P08ZCA-EFF-HRMN             TO P923-CALL-TIME
273300                                            P923-ORDER-TIME
273400                                            P923-ASGN-CALL-TIME
273500        MOVE P08ZCA-EFF-DATE             TO P08ZCA-SAVE-CALL-DATE
273600        MOVE P08ZCA-EFF-HRMN             TO P08ZCA-SAVE-CALL-TIME
273700     END-IF
273800     MOVE WS-TIME-ZONE                   TO P923-TIME-ZONE
273900     MOVE P08ZCA-LEAD-TIME               TO P923-LEAD-TIME
274000     IF P08ZCA-DHD-TYPE = 'A'
274100        MOVE P08ZCA-ASSIGNMENT           TO P923-ASSIGNMENT
274200                                            WORK-AJ-KEY
274300                                            P923-CALLED-ASGN
274400        SET AJ-VACANCY                   TO TRUE
274500        SET AJ-ASGN                      TO TRUE
274600        PERFORM P7000-FIND-ASGN-CLASS
274700        MOVE WS-ASGN-MERG-CLASS          TO P923-ASGN-MERG-CLASS
274800        MOVE WORK-AJ-DIST                TO P923-DIST
274900        MOVE WORK-AJ-SUB-DIST            TO P923-SUB-DIST
275000        MOVE WORK-AJ-JOB-NO              TO P923-TRAIN
275100                                            JOB-DEF-CHECK
275200        IF JOB-DEF-YARD-ASGN
275300           MOVE JOB-DEF-YARD-POOL        TO P923-POOL-SERV
275400        ELSE
275500           MOVE JOB-DEF-LOCAL-POOL       TO P923-POOL-SERV
275600        END-IF
275700        MOVE '0'                         TO P923-TERMINAL
275800     ELSE
275900        MOVE P08ZCA-ASSIGNMENT TO P923-ASSIGNMENT
276000                                  P923-CALLED-ASGN
276100                                  UFPTURN
276200        EXEC CICS READ
276300                  DATASET(UFP-VIA-TURN-NBR)
276400                  INTO(WS-UFP)
276500                  LENGTH(UFPTURN-RLGTH)
276600                  RIDFLD(UFPTURN)
276700                  KEYLENGTH(UFPTURN-KLGTH)
276800                  RESP(WS-RESPONSE)
276900        END-EXEC
277000        MOVE WS-RESPONSE TO FILE-STATUS
277100        IF SUCCESS
277200           SET UFP-VACANCY             TO TRUE
277300           MOVE DIST2                  TO P923-DIST
277400           MOVE SUB-DIST2              TO P923-SUB-DIST
277500           MOVE POOL-NAME2             TO P923-POOL-SERV
277600           MOVE IN-OUT-TERMINAL        TO P923-TERMINAL
277700           MOVE WS-UFP                 TO WORK-WS-UFP
277800           MOVE WORK-UFP-W-O-CC        TO P923-TRAIN
277900           SET UFP-ASGN                TO TRUE
278000           PERFORM P7000-FIND-ASGN-CLASS
278100           MOVE WS-ASGN-MERG-CLASS     TO P923-ASGN-MERG-CLASS
278200        END-IF
278300     END-IF
278400     IF FILL-VACANCY
278500        MOVE SPACES                 TO P08ZCA-DEC-KEY
278600                                       P08ZCA-LAST-SEN
278700                                       P08ZCA-LAST-POS
278800                                       P08ZCA-LAST-STARTS
278900                                       P08ZCA-EMP-NO
279000     END-IF
279100     IF P08ZCA-DEC-KEY > SPACES
279200        MOVE P08ZCA-DEC-KEY         TO P923-DEC-KEY
279300        IF P08ZCA-LAST-SEN > SPACE
279400           MOVE P08ZCA-LAST-SEN     TO P923-LAST-SEN-DATE
279500        END-IF
279600        IF P08ZCA-LAST-POS > SPACE
279700           MOVE P08ZCA-LAST-POS     TO P923-LAST-POSITION
279800        END-IF
279900        IF P08ZCA-LAST-STARTS > SPACE
280000           MOVE P08ZCA-LAST-STARTS  TO P923-LAST-STARTS
280100        END-IF
280200     ELSE
280300        MOVE P08CA-PROFILE-KEY      TO TRCNKEY1
280400        PERFORM P8000-READ-TRCNKEY1
280500        MOVE P923-ASGN-CC           TO WS-CRAFT-CODE-CHECK
280600        PERFORM VARYING SUBA FROM 1 BY 1
280700           UNTIL SUBA > 8
280800           IF TRCN-DEC-SVC-CC(SUBA) = P923-ASGN-CC
280900              MOVE TRCN-DEC-SVC(SUBA) TO P923-DEC-SVC-CODE
281000           END-IF
281100        END-PERFORM
281200        IF P923-DEC-SVC-CODE NOT > SPACES
281300           MOVE SPACES                  TO WS-HOLD-CC
281400           EVALUATE TRUE
281500           WHEN ENGINEER-CRAFT
281600              MOVE ENGINEER-MSTR-CC     TO WS-HOLD-CC
281700           WHEN FIREMAN-CRAFT OR 2ND-ENGINEER-CRAFT
281800              MOVE 2ND-ENGINEER-MSTR-CC TO WS-HOLD-CC
281900           WHEN CONDUCTOR-CRAFT
282000              MOVE CONDUCTOR-MSTR-CC    TO WS-HOLD-CC
282100           WHEN FOREMAN-CRAFT
282200              MOVE FOREMAN-MSTR-CC      TO WS-HOLD-CC
282300           WHEN SWITCHMAN-CRAFT
282400              MOVE SWITCHMAN-MSTR-CC    TO WS-HOLD-CC
282500           WHEN BRAKEMAN-CRAFT
282600              MOVE BRAKEMAN-MSTR-CC     TO WS-HOLD-CC
282700*CNC0531-BEG
282800           WHEN YARDMASTER-CRAFT
282900              MOVE YARDMASTER-MSTR-CC   TO WS-HOLD-CC
283000*CNC0531-END
283100           END-EVALUATE
283200           IF WS-HOLD-CC > SPACES
283300              PERFORM VARYING SUBA FROM 1 BY 1
283400                 UNTIL SUBA > 8
283500                 IF WS-HOLD-CC = TRCN-DEC-SVC-CC(SUBA)
283600                    MOVE TRCN-DEC-SVC(SUBA)
283700                                      TO P923-DEC-SVC-CODE
283800                 END-IF
283900              END-PERFORM
284000           END-IF
284100        END-IF
284200     END-IF
284300     IF P923-REJECT-EMPLOYEE-FUN
284400*C1067 - 05/12/15 - BEG
284500     OR P923-MISSING-CALL-FUN
284600*C1067 - 05/12/15 - END
284700        MOVE P08ZCA-EMP-NO          TO P923-EMP-NO
284800     END-IF
284900     MOVE P08CA-PROFILE-KEY         TO P923-ASGN-PROFILE-KEY
285000     SET P923-THIS-IS-DEADHEAD      TO TRUE
285100     IF P08ZCA-DHD-HOME
285200        SET P923-DEADHEAD-HOME      TO TRUE
285300     END-IF
285400     EXEC CICS LINK
285500               PROGRAM(P923-PGM)
285600               COMMAREA(P923-COMMAREA-PARMS)
285700               LENGTH(P923-LGTH)
285800               RESP(WS-RESPONSE)
285900     END-EXEC
286000     MOVE WS-RESPONSE TO FILE-STATUS
286100     IF NOT SUCCESS
286200        MOVE 'P4200-1' TO ERR-PARAGRAPH
286300        PERFORM P9999-GOT-PROBLEM
286400     END-IF
286500     MOVE P923-ERRORMSG      TO SCR08Z-ERRORMSG
286600     MOVE -1                 TO SCR08Z-FUNC-CURSOR
286700     MOVE P923-NAME-AREA     TO SCR08Z-NAME
286800     MOVE SPACES             TO SCR08Z-FUNC
286900     IF GOT-MAN
287000*  ADDED FOR CNC0283 DECISION DH-LEAD TIME  4/28/2000
287100        MOVE P923-CALL-DATE     TO P08ZCA-EFF-DATE
287200        MOVE P923-CALL-TIME     TO P08ZCA-EFF-HRMN
287300                                   SCR08Z-TIME
287400*
287500        MOVE P923-DEC-KEY       TO P08ZCA-DEC-KEY
287600        MOVE P923-LAST-SEN-DATE TO P08ZCA-LAST-SEN
287700        MOVE P923-LAST-POSITION TO P08ZCA-LAST-POS
287800        MOVE P923-LAST-STARTS   TO P08ZCA-LAST-STARTS
287900        MOVE P923-EMP-NO        TO MSTRNBRK
288000                                   P08ZCA-EMP-NO
288100*-------------------------------------------------------------
288200*       IF A TURN WAS SELECTED FROM A FASTSLOW SPAREBOARD,
288300*       SAVE FLAG TO DETERMINE WHICH SIDE FO THE BOARD TO
288400*       USE IN FURTHER PROCESSING.
288500*----------------------------------------------------------PLS
288600        MOVE P923-FASTSLOW-BOARD
288700                                TO P08ZCA-FASTSLOW-BOARD
288800        PERFORM P8500-READ-MASTER
288900        IF NOT SUCCESS
289000           MOVE 'P4200-2' TO ERR-PARAGRAPH
289100           PERFORM P9999-GOT-PROBLEM
289200        END-IF
289300        IF NOT P08ZCA-DHD-HOME
289400*SAM ADD QUAL
289500           PERFORM P4330-GET-ASGN-QUAL
289600           MOVE SPACES                   TO WORK-DEC-TABLE
289700           MOVE P08ZCA-DEC-KEY           TO DECKEY
289800           PERFORM P8900-READ-DECISION
289900           IF NOT SUCCESS
290000              IF NOT (NO-RECORD-FND OR END-OF-FILE)
290100                 MOVE 'P4200-3'          TO ERR-PARAGRAPH
290200                 MOVE DECKEY             TO ERR-KEY
290300                 PERFORM P9999-GOT-PROBLEM
290400              END-IF
290500           END-IF
290600           MOVE SPACES                   TO P947-COMMAREA-PARMS
290700           SET P947-EMP-RESTR-FUNCTION   TO TRUE
290800           MOVE P923-EMP-NO              TO P947-EMP-NO
290900           MOVE P923-DIST                TO P947-ASGN-DIST
291000           MOVE P923-SUB-DIST            TO P947-ASGN-SUB-DIST
291100           IF DEC-FURTHER-NOTICE
291200              SET P947-FROM-OWN-WORK     TO TRUE
291300           ELSE
291400              SET P947-FROM-WORK         TO TRUE
291500           END-IF
291600           MOVE DEC-FN                   TO P08ZCA-DEC-FURTHER-N
291700           MOVE P08ZCA-ASSIGNMENT        TO WORK-AJ-KEY
291800           MOVE WORK-AJ-KEY              TO AJJOBKEY-AREA
291900           IF P08ZCA-DHD-TYPE = 'A'
292000              MOVE AJ-JOB-ASSIGNMENT     TO P947-ASGN-ASSIGNMENT
292100              SET P947-ASGN-AJ           TO TRUE
292200           ELSE
292300              MOVE UFPTURN-5-12          TO P947-ASGN-ASSIGNMENT
292400              SET P947-ASGN-UFP          TO TRUE
292500           END-IF
292600           PERFORM P5000-LINK-TO-947
292700        END-IF
292800        PERFORM P4210-SETUP-NAME-INFO
292900        IF REJECT-EMPLOYEE-FUNCTION  OR  LAYOFF-ON-CALL
293000           SET P08ZCA-RESUB              TO TRUE
293100        END-IF
293200        IF NOT P925-EMP-STATUS-GREEN
              AND WS-CAN-WRR-OLD
293300           MOVE 'E237'        TO MSGLOG-CODE
293400        END-IF
293500     ELSE
293600        IF END-OF-DECISIONS
293700           MOVE SPACES TO P08ZCA-DEC-KEY
293800                          P08ZCA-LAST-SEN
293900                          P08ZCA-LAST-POS
294000                          P08ZCA-LAST-STARTS
294100                          P08ZCA-EMP-NO
294200                          SCR08Z-REST-DATE
294300                          SCR08Z-REST-HOUR
294400                          SCR08Z-PD
294500                          SCR08Z-P-REST-D
294600                          SCR08Z-P-REST-T
294700                          SCR08Z-MTOD-D
294800                          SCR08Z-MTOD-T
294900                          SCR08Z-MTOD-PD
295000                          SCR08Z-STATUS
295100                          SCR08Z-CRAFT
295200                          SCR08Z-ASGN
295300        ELSE
295400           MOVE P923-DEC-KEY       TO P08ZCA-DEC-KEY
295500           MOVE P923-LAST-SEN-DATE TO P08ZCA-LAST-SEN
295600           MOVE P923-LAST-STARTS   TO P08ZCA-LAST-STARTS
295700           MOVE SPACES             TO P08ZCA-EMP-NO
295800        END-IF
295900     END-IF.
296000*
296100 P4210-SETUP-NAME-INFO.
296200*
296300* #1497
296400     MOVE SPACE               TO P08ZCA-SAVE-CBCK-FLAG
296500     MOVE SPACES              TO SCR08Z-REST-DATE
296600                                 SCR08Z-REST-HOUR
296700                                 SCR08Z-PD
296800                                 SCR08Z-P-REST-D
296900                                 SCR08Z-P-REST-T
297000                                 SCR08Z-MTOD-D
297100                                 SCR08Z-MTOD-T
297200                                 SCR08Z-MTOD-PD
297300                                 SCR08Z-PHONE
297400     MOVE EMP-NAME OF WS-MSTR TO SCR08Z-NAME
297500     MOVE EMP-NBR  OF WS-MSTR TO P08ZCA-EMP-NO
297600     MOVE SPACES              TO PS52-COMMAREA-PARMS
297700                                 WS-TELEPHONE-NBRS
297800     MOVE EMP-NBR OF WS-MSTR  TO PS52-EMP-NBR
297900     SET PS52-CMA-MODE        TO TRUE
298000*    SET PS52-DISPLAY-ONLY    TO TRUE
298100     MOVE WS-LOCAL-DATE-TIME  TO PS52-INPUT-DATE-TIME
298200     PERFORM P8501-LINK-TO-PS52
298300     IF NOT SUCCESS
298400        MOVE 'P1045-1'       TO ERR-PARAGRAPH
298500        PERFORM P9999-GOT-PROBLEM
298600     END-IF
298700*    MOVE TELEPHONE-NBRS OF WS-MSTR  TO SCR08Z-PHONE
298800     PERFORM VARYING T FROM 1 BY 1 UNTIL T > 3
298900       IF PS52-PH-NUMBER(T) > SPACES
299000         MOVE PS52-PH-NUMBER(T)  TO WS-TELEPHONE-NBR(T)
299100         MOVE PS52-PH-COMMENT(T) TO WS-TELEPHONE-COMMENTS(T)
299200         MOVE PS52-HOME-AWAY-CD(T) TO WS-TELEPHONE-CODE(T)
299300       END-IF
299400     END-PERFORM
299500     IF WS-TELEPHONE-NBRS > SPACES
299600        MOVE WS-TELEPHONE-NBRS TO SCR08Z-PHONE
299700     ELSE
299800        MOVE 'EMPLOYEE HAS NO PHONE NUMBERS ON FILE'
299900                               TO SCR08Z-PHONE
300000     END-IF
300100*
300200*    IF EMPLOYEE HAS REQUESTED A SHORT CALL TIME, AND THE
300300*    ORDER TIME MINUS EMP LEAD TIME (ADJUSTED FOR PREP) IS
300400*    GREATER THAN THE CURRENT TIME, POPULATE THE FUNC FIELD
300500*    WITH A 'CBCK' (CALLBACK)
300600*
300700     IF PS52-REQ-LEAD-TIME > SPACES
300800        AND PS52-REQ-LEAD-TIME > '0000'
300900*
301000*       ADJUST FOR PREP TIME
301100*
301200        MOVE ZEROS                      TO DATE-CONVERSION-PARMS
301300        SET PARM-SUBTRACT               TO TRUE
301400        MOVE P08ZCA-EFF-DATE            TO PARM-PRI-DATE-GREG
301500        MOVE P08ZCA-EFF-HRMN            TO PARM-PRI-HRMN
301600        MOVE 0000                       TO PARM-SEC-HRMN
301700        EXEC CICS LINK
301800                  PROGRAM(P903-PGM)
301900                  COMMAREA(DATE-CONVERSION-PARMS)
302000                  LENGTH(P903-LGTH)
302100                  RESP(WS-RESPONSE)
302200        END-EXEC
302300        MOVE WS-RESPONSE                TO FILE-STATUS
302400        IF NOT SUCCESS
302500           MOVE 'P4210-1'               TO ERR-PARAGRAPH
302600           PERFORM P9999-GOT-PROBLEM
302700        END-IF
302800        MOVE PARM-RES-DATE-GREG         TO WS-ADJUSTED-DATE
302900        MOVE PARM-RES-TIME              TO WS-ADJUSTED-TIME
303000*
303100*       SUBTRACT THE EMPLOYEE'S REQUESTED LEAD TIME
303200*
303300        MOVE ZEROS                      TO DATE-CONVERSION-PARMS
303400        SET PARM-SUBTRACT               TO TRUE
303500        MOVE WS-ADJUSTED-DATE           TO PARM-PRI-DATE-GREG
303600        MOVE WS-ADJUSTED-TIME           TO PARM-PRI-HRMN
303700        MOVE PS52-REQ-LEAD-TIME         TO PARM-SEC-HRMN
303800        EXEC CICS LINK
303900                  PROGRAM(P903-PGM)
304000                  COMMAREA(DATE-CONVERSION-PARMS)
304100                  LENGTH(P903-LGTH)
304200                  RESP(WS-RESPONSE)
304300        END-EXEC
304400        MOVE WS-RESPONSE                TO FILE-STATUS
304500        IF NOT SUCCESS
304600           MOVE 'P4210-2'               TO ERR-PARAGRAPH
304700           PERFORM P9999-GOT-PROBLEM
304800        END-IF
304900        MOVE PARM-RES-GREG-CENT         TO WS-ADJUSTED-CC
305000        MOVE PARM-RES-DATE-GREG         TO WS-ADJUSTED-DATE
305100        MOVE PARM-RES-TIME              TO WS-ADJUSTED-TIME
305200        IF WS-ADJUSTED-DATE-TIME         > WS-LOCAL-DATE-TIME-CENT
305300           MOVE 'CBCK'                  TO SCR08Z-FUNC
305400           MOVE REV-VIDEO               TO SCR08Z-FUNC-HI
305500*CNC0436B JES
305600*          STRING 'LEAD='
305700*                 PS52-REQ-LEAD-TIME
305800*                 DELIMITED BY SIZE
305900*                 INTO SCR08Z-PHONE(14:9)
306000           MOVE SPACES        TO SCR08Z-PHONE
306100           STRING 'SHORT LEAD REQ: ENTER KEY TO CBCK '
306200                  'OR ENTER V??? FOR IVR SHORT CALL'
306300                  DELIMITED BY SIZE
306400                  INTO SCR08Z-PHONE
306500*          'SHORT CALL-ENTER KEY TO CALLBACK OR VCLL FOR IVR SHORT
306600*          MOVE 'S162'              TO MSGLOG-CODE
306700*#1447
306800           MOVE 'Y'                 TO P08ZCA-SAVE-CBCK-FLAG
306900        END-IF
307000     END-IF
307100
307200     IF  PS52-REQ-CALL-TIME > SPACES
307300        AND PS52-REQ-CALL-TIME > '0000'
307400        MOVE ZEROS                   TO DATE-CONVERSION-PARMS
307500        SET PARM-SUBTRACT            TO TRUE
307600        MOVE P08ZCA-EFF-DATE         TO PARM-PRI-DATE-GREG
307700        MOVE P08ZCA-EFF-HRMN         TO PARM-PRI-HRMN
307800        MOVE PS52-REQ-CALL-TIME      TO PARM-SEC-HRMN
307900        EXEC CICS LINK
308000                  PROGRAM(P903-PGM)
308100                  COMMAREA(DATE-CONVERSION-PARMS)
308200                  LENGTH(P903-LGTH)
308300                  RESP(WS-RESPONSE)
308400        END-EXEC
308500        MOVE WS-RESPONSE             TO FILE-STATUS
308600        IF NOT SUCCESS
308700           MOVE 'P4210-6'            TO ERR-PARAGRAPH
308800           PERFORM P9999-GOT-PROBLEM
308900        END-IF
309000        MOVE PARM-RES-GREG-CENT      TO WS-SHORT-CALL-CC
309100        MOVE PARM-RES-DATE-GREG      TO WS-SHORT-CALL-DATE
309200        MOVE PARM-RES-TIME           TO WS-SHORT-CALL-TIME
309300        IF WS-SHORT-CALL-DATE-TIME > WS-LOCAL-DATE-TIME-CENT
309400           IF PS52-REQ-LEAD-TIME NOT >  SPACES
309500           OR PS52-REQ-LEAD-TIME < '0001'
309600              MOVE 'CBCK'            TO SCR08Z-FUNC
309700              MOVE REV-VIDEO         TO SCR08Z-FUNC-HI
309800              MOVE WS-SHORT-CALL-DATE-TIME
309900                                     TO WS-ADJUSTED-DATE-TIME
310000              MOVE SPACES            TO SCR08Z-PHONE
310100              STRING 'SHORT CALL REQ: ENTER KEY TO CBCK '
310200                     'OR ENTER V??? FOR IVR SHORT CALL'
310300                     DELIMITED BY SIZE
310400                     INTO SCR08Z-PHONE
310500*          'SHORT CALL-ENTER KEY TO CALLBACK OR VCLL FOR IVR SHORT
310600*             MOVE 'S162'              TO MSGLOG-CODE
310700*#1447
310800              MOVE 'Y'               TO P08ZCA-SAVE-CBCK-FLAG
310900           ELSE
311000              IF WS-SHORT-CALL-DATE-TIME
311100                                     >= WS-ADJUSTED-DATE-TIME
311200                 MOVE WS-SHORT-CALL-DATE-TIME
311300                                     TO WS-ADJUSTED-DATE-TIME
311400                 MOVE 'CBCK'         TO SCR08Z-FUNC
311500                 MOVE REV-VIDEO      TO SCR08Z-FUNC-HI
311600                 MOVE SPACES         TO SCR08Z-PHONE
311700                 STRING 'SHORT CALL REQ: ENTER KEY TO CBCK '
311800                        'OR ENTER V??? FOR IVR SHORT CALL'
311900                        DELIMITED BY SIZE
312000                        INTO SCR08Z-PHONE
312100*          'SHORT CALL-ENTER KEY TO CALLBACK OR VCLL FOR IVR SHORT
312200*                MOVE 'S162'              TO MSGLOG-CODE
312300*#1447
312400                 MOVE 'Y'            TO P08ZCA-SAVE-CBCK-FLAG
312500              END-IF
312600           END-IF
312700        END-IF
312800     END-IF
312900     MOVE WS-ADJUSTED-DATE           TO P08ZCA-SHORTCALL-DATE
313000     MOVE WS-ADJUSTED-TIME           TO P08ZCA-SHORTCALL-TIME
313100
313200     MOVE SPACES                TO P08ZCA-EMP-RESTR
313300     EVALUATE TRUE
313400        WHEN EMP-NOT-QUALIFIED
313500           MOVE SPACES TO SCR08Z-PHONE
313600           STRING 'EMPLOYEE NOT QUALIFIED - '
313700                   QUALIFICATION
313800                   DELIMITED BY SIZE
313900                   INTO SCR08Z-PHONE
314000           MOVE YELLOW               TO SCR08Z-PHONE-COLOR
314100        WHEN EMP-QUAL-EXPIRED
314200           MOVE SPACES TO SCR08Z-PHONE
314300           STRING 'EMPLOYEE NOT QUALIFIED - '
314400                   QUALIFICATION
314500                   ' - EXPIRED ' QUAL-DATE
314600                    DELIMITED BY SIZE
314700                    INTO SCR08Z-PHONE
314800           MOVE YELLOW               TO SCR08Z-PHONE-COLOR
314900        WHEN P947-RESTRICTED
315000           MOVE SPACES TO SCR08Z-PHONE
315100           SET P08ZCA-EMP-RESTRICTED TO TRUE
315200           MOVE 'EMPLOYEE NOT QUALIFIED - HAS RESTRICTION'
315300                                     TO SCR08Z-PHONE
315400           MOVE YELLOW               TO SCR08Z-PHONE-COLOR
315500        WHEN OTHER
315600           MOVE SPACES               TO P08ZCA-EMP-RESTR
315700           IF SCR08Z-PHONE NOT > SPACES
315800              MOVE WS-TELEPHONE-NBRS    TO SCR08Z-PHONE
315900           END-IF
316000     END-EVALUATE
316100*
316200     IF WS-US-DOM-YES
316300        AND (P08ZCA-EMP-NO > SPACES)
316400        MOVE SPACES           TO PS94-COMMAREA-PARMS
316500                                 WS-HST-STORAGE
316600        SET PS94-HST-FUNC     TO TRUE
316700        MOVE SPACES        TO WS-ASGN-FILE
316800                              ASGNKEY2
316900        MOVE ZEROES        TO HST-SEQ
317000        MOVE EMP-NBR OF WS-MSTR
317100                           TO ASGN-EMP-NO
317200        PERFORM PXXXX-JOB-OWNED
317300        IF ASGN-ASSIGNMENT > SPACE
317400           MOVE ASGN-DIST             TO HST-DIST
317500           MOVE ASGN-SUB-DIST         TO HST-SUB-DIST
317600           EVALUATE TRUE
317700              WHEN ASGN-JOB-TYPE = 'U'
317800                 MOVE 'U'             TO HST-ASGN-TYPE
317900              WHEN ASGN-JOB-TYPE = 'X'
318000                 MOVE 'X'             TO HST-ASGN-TYPE
318100              WHEN ASGN-JOB-TYPE = 'A'
318200                 MOVE AJ-JOB-ASSIGNMENT
318300                                      TO JOB-DEF-CHECK
318400                 IF JOB-DEF-YARDMASTER-ASGN
318500                    MOVE 'Y'          TO HST-ASGN-TYPE
318600                 ELSE
318700                    MOVE 'O'          TO HST-ASGN-TYPE
318800                 END-IF
318900           END-EVALUATE
319000           MOVE ASGN-AJ-JOB-NO        TO HST-ASGN-ID
319100        END-IF
319200        MOVE SPACES                   TO ASGNKEY2
319300        MOVE EMP-NBR OF WS-MSTR       TO ASGN-EMP-NO
319400        PERFORM PXXXX-LATEST-TEMP-JOB
319500        IF ASGN-ASSIGNMENT > SPACE
319600           MOVE ASGN-DIST             TO HST-DIST
319700           MOVE ASGN-SUB-DIST         TO HST-SUB-DIST
319800           EVALUATE TRUE
319900              WHEN ASGN-JOB-TYPE = 'U'
320000                 MOVE 'U'             TO HST-ASGN-TYPE
320100              WHEN ASGN-JOB-TYPE = 'X'
320200                 MOVE 'X'             TO HST-ASGN-TYPE
320300              WHEN ASGN-JOB-TYPE = 'A'
320400                 MOVE AJ-JOB-ASSIGNMENT
320500                                      TO JOB-DEF-CHECK
320600                 IF JOB-DEF-YARDMASTER-ASGN
320700                    MOVE 'Y'          TO HST-ASGN-TYPE
320800                 ELSE
320900                    MOVE 'O'          TO HST-ASGN-TYPE
321000                 END-IF
321100           END-EVALUATE
321200           MOVE ASGN-AJ-JOB-NO        TO HST-ASGN-ID
321300        END-IF
321400*C841
321500        IF HST-KEY NOT > SPACES
321600           MOVE DIST      OF WS-MSTR TO HST-DIST
321700           MOVE SUB-DIST  OF WS-MSTR TO HST-SUB-DIST
321800        END-IF
321900*
322000
322100        PERFORM PSQL-HSTOPN02
322200        PERFORM PSQL-HSTFET02
322300        PERFORM PSQL-HSTCLO02
322400        IF HST-SEQ > ZERO
322500           MOVE HST-KEY       TO PS94-HST-KEY
322600        END-IF
322700        MOVE P08ZCA-EMP-NO    TO PS94-EMP-NBR
322800        MOVE SCR08Z-DATE      TO PS94-HSL-EVENT-STRT-TS-DT
322900        MOVE SCR08Z-TIME      TO PS94-HSL-EVENT-STRT-TS-TM
323000        MOVE WS-TIME-ZONE     TO PS94-TIME-ZONE
323100        PERFORM P9400-CALL-PS94-PROGRAM
323200        MOVE DEFAULT-ATTR     TO SCR08Z-NAME-COLOR
323300        EVALUATE TRUE
323400           WHEN PS94-HST-LT-ALERT-LIMIT
323500           WHEN PS94-HST-LT-ALERT-THRESHOLD
323600           WHEN PS94-HST-TT-ALERT-LIMIT
323700           WHEN PS94-HST-TT-ALERT-THRESHOLD
323800           WHEN PS94-HST-ST-ALERT-THRESHOLD
323900              MOVE YELLOW     TO SCR08Z-NAME-COLOR
324000              MOVE 'HOUR'     TO SCR08Z-FUNC
324100        END-EVALUATE
324200     END-IF
324300*
324400     MOVE SPACES TO P956-COMMAREA-PARMS
324500     SET P956-GET-CNTL-STATUS-CODE TO TRUE
324600     MOVE LAYOFF-CODE-1     TO P956-STATUS-CODE
324700     EXEC CICS LINK
324800               PROGRAM(P956-PGM)
324900               COMMAREA(P956-COMMAREA-PARMS)
325000               LENGTH(P956-LGTH)
325100               RESP(WS-RESPONSE)
325200     END-EXEC
325300     MOVE WS-RESPONSE           TO FILE-STATUS
325400     IF NOT SUCCESS
325500        MOVE 'P4210-3'           TO ERR-PARAGRAPH
325600        MOVE P956-INPUT-PARMS TO ERR-KEY
325700        PERFORM P9999-GOT-PROBLEM
325800     END-IF
325900     IF P956-ERROR-FOUND
326000        MOVE 'P4210-4' TO ERR-PARAGRAPH
326100        STRING 'P956 LINK...ERROR-FLAG='
326200            P956-ERROR-FLAG
326300            DELIMITED BY SIZE INTO ERR-SENTENCE
326400        MOVE P956-INPUT-PARMS TO ERR-KEY
326500        PERFORM P9999-GOT-PROBLEM
326600     END-IF
326700     MOVE P956-STATUS-SHORT-DESC  TO SCR08Z-STATUS
326800*
326900*    PERFORM VARYING I FROM 1 BY 1 UNTIL I > LO-ARRAY-MAX
327000*      IF WS-LO-CODE(I) = LAYOFF-CODE-1
327100*         MOVE WS-LO-CODE-DESC(I, PSTCA-SUB) TO SCR08Z-STATUS
327200*         MOVE LO-ARRAY-MAX       TO I
327300*      END-IF
327400*    END-PERFORM
327500*
327600     MOVE SCR08Z-DATE            TO WORK-DATE
327700     MOVE SCR08Z-TIME            TO WORK-TIME
327800     IF P08ZCA-LEAD-TIME > '0000'
327900        MOVE ZEROS               TO DATE-CONVERSION-PARMS
328000        SET PARM-SUBTRACT        TO TRUE
328100        MOVE SCR08Z-DATE         TO PARM-PRI-DATE-GREG
328200        MOVE SCR08Z-TIME         TO PARM-PRI-HRMN
328300        MOVE P08ZCA-LEAD-TIME    TO PARM-SEC-HRMN
328400        EXEC CICS LINK
328500                  PROGRAM(P903-PGM)
328600                  COMMAREA(DATE-CONVERSION-PARMS)
328700                  LENGTH(P903-LGTH)
328800                  RESP(WS-RESPONSE)
328900        END-EXEC
329000        MOVE WS-RESPONSE         TO FILE-STATUS
329100        IF NOT SUCCESS
329200           MOVE 'P4210-5'        TO ERR-PARAGRAPH
329300           MOVE 'P903LINK'       TO ERR-KEY
329400           PERFORM P9999-GOT-PROBLEM
329500        END-IF
329600        MOVE PARM-RES-DATE-GREG  TO WS-CALL-ML-DATE
329700        MOVE PARM-RES-HRMN       TO WS-CALL-ML-TIME
329800     ELSE
329900        MOVE SCR08Z-DATE         TO WS-CALL-ML-DATE
330000        MOVE SCR08Z-TIME         TO WS-CALL-ML-TIME
330100     END-IF
330200     IF EMP-MTOD-NUM > ZEROES
330300        MOVE EMP-MTOD-TIME       TO SCR08Z-MTOD-T
330400        MOVE EMP-MTOD-DATE       TO SCR08Z-MTOD-D
330500     END-IF
330600*                                                              PLS
330700     IF EMP-PREV-DUTY-MTOD > ZEROES
330800        MOVE EMP-PREV-DUTY-MTOD TO SCR08Z-MTOD-PD
330900     END-IF
331000     IF EMP-US-RSTD-NUM > ZEROES
331100        MOVE EMP-US-RSTD-DATE    TO SCR08Z-REST-DATE
331200        MOVE EMP-US-RSTD-TIME    TO SCR08Z-REST-HOUR
331300     END-IF
331400     IF EMP-PREV-DUTY > ZEROES
331500        MOVE EMP-PREV-DUTY TO SCR08Z-PD
331600     END-IF
331700     IF EMP-PERS-REST-NUM > ZEROES
331800        SET DE-YYMMDD-FORMAT         TO TRUE
331900        MOVE EMP-PERS-REST-DATE      TO DE-YYMMDD
332000        PERFORM P8998-DATEEDIT
332100        MOVE DE-CCYYMMDD             TO DE-COMPARE1-DATE
332200        MOVE EMP-PERS-REST-TIME      TO DE-COMPARE1-TIME
332300        SET DE-YYMMDD-FORMAT         TO TRUE
332400        MOVE WS-CALL-MINUS-LEAD(1:6) TO DE-YYMMDD
332500        PERFORM P8998-DATEEDIT
332600        MOVE DE-CCYYMMDD             TO DE-COMPARE2-DATE
332700        MOVE WS-CALL-MINUS-LEAD(7:4) TO DE-COMPARE2-TIME
332800        IF DE-COMPARE1-DATE-TIME > DE-COMPARE2-DATE-TIME
332900*       IF EMP-PERS-REST-NUM     > WS-CALL-MINUS-LEAD
333000           MOVE EMP-PERS-REST-DATE   TO SCR08Z-P-REST-D
333100           MOVE EMP-PERS-REST-TIME   TO SCR08Z-P-REST-T
333200        END-IF
333300     END-IF
333400     MOVE CRAFT OF WS-MSTR    TO SCR08Z-CRAFT
333500     PERFORM P8510-MASTER-JOBS
333600     IF TEMPORARY-ASGNMT > SPACE
333700        MOVE TA-AREA             TO SCR08Z-ASGN
333800     ELSE
333900        MOVE NA-AREA             TO SCR08Z-ASGN
334000     END-IF
334100     PERFORM P4220-LOOK-FOR-QUICK-TIEUPS
334200     IF P980-QUICKTIE-RESTRICTED AND
334300        P08ZCA-LOCK-FLAG NOT = 'Y'
334400        IF SCR08Z-FUNC       = 'CBCK'
334500           MOVE SPACES             TO SCR08Z-PHONE
334600           STRING 'SHORT CALL REQ: TYPE "CBCK" '
334700                  'IN FUNC AND PRESS ENTER FOR CALLBACK'
334800                   DELIMITED BY SIZE
334900                   INTO SCR08Z-PHONE
335000        END-IF
335100        MOVE 'QTIE'             TO SCR08Z-FUNC
335200        MOVE REV-VIDEO          TO SCR08Z-FUNC-HI
335300     END-IF
335400     IF P08ZCA-DHD-HOME
335500        IF OD-CC > SPACES
335600           MOVE OD-CC            TO WS-CRAFT-CODE-CHECK
335700        ELSE
335800           IF TA-CC > SPACES
335900              MOVE TA-CC         TO WS-CRAFT-CODE-CHECK
336000           ELSE
336100              IF NA-CC > SPACES
336200                 MOVE NA-CC      TO WS-CRAFT-CODE-CHECK
336300              ELSE
336400                 MOVE CRAFT IN WS-MSTR
336500                                 TO WS-CRAFT-CODE-CHECK
336600              END-IF
336700           END-IF
336800        END-IF
336900        PERFORM P3010-GET-MILES-TIME
337000     END-IF
337100     MOVE SCR08Z-CODE TO CODE-AREA
337200     PERFORM P4610-GET-HRS-SVC-INFO
      *CNLD-245-B
           IF ((ENGINE-CRAFT AND TRCN-EN-REST-REQ = ('U' OR 'B'))
               OR (NOT ENGINE-CRAFT
                     AND TRCN-TR-REST-REQ = ('U' OR 'B')))
      *CNLD-285-B 11/01/23
               IF ((ENGINE-CRAFT AND TRCN-EN-REST-REQ = 'U')
                   OR (NOT ENGINE-CRAFT
                         AND TRCN-TR-REST-REQ = 'U'))
      *           WS-EMP-UNDST-REST-FLAG IS INITIALIZED ELSEWHERE
      *           WHEN TRCN-EN/TR-REST-REQ = 'B', CHECK CNLD-285 TAGS
                  MOVE SPACES     TO WS-EMP-UNDST-REST-FLAG
               END-IF
               MOVE SPACES     TO WS-REST-US-STATUS-FLAG
      *CNLD-285-E
              PERFORM P3050-CHECK-US-UNDIST-REST
336800     END-IF
      *CNLD-245-E
337400     IF P925-EMP-STATUS-RED
      *CNC0600-CHECK-FOR-OLD RULES
           AND WS-CAN-WRR-OLD
              AND NOT DEADHEAD-HOME
      ***     SET NO-UPDATE            TO TRUE
              MOVE 'E236'              TO MSGLOG-CODE
              MOVE 'HOUR'              TO SCR08Z-FUNC
           ELSE
              IF (P925-EMP-STATUS-YELLOW
                 OR P925-EMP-STATUS-RED)
              AND WS-CAN-WRR-OLD
343400           MOVE 'E237'           TO MSGLOG-CODE
343500           MOVE 'HOUR'           TO SCR08Z-FUNC
343600           IF P925-EMP-STATUS-YELLOW
343700              IF P925-FROZEN-DATE-TIME > SPACES
343800                 MOVE SPACES     TO SCR08Z-PHONE
343900                 STRING 'FROZEN UNTIL - '
344000                        P925-FROZEN-DATE '-'
344100                        P925-FROZEN-TIME
344200                        DELIMITED BY SIZE
344300                        INTO SCR08Z-PHONE
344400              END-IF
                 END-IF
              END-IF
           END-IF
337300*CNC0600-B
337400     IF P925-EMP-STATUS-RED
           AND WS-CAN-WRR-NEW
      *CNLD-265-B
              IF WS-RFR-PERS
333000           MOVE EMP-PERS-REST-DATE TO SCR08Z-P-REST-D
333100           MOVE EMP-PERS-REST-TIME TO SCR08Z-P-REST-T
              END-IF
      *CNLD-265-E
              EVALUATE TRUE
      *CNLD-259 B CNC0600
              WHEN WS-RFR-LEAD-IN-SYS-UD
              WHEN WS-RFR-OD-IN-SYS-RB
      *          P08ZCA-HOSO-DENY WILL BE TRUE;
      *          CALL SHOULD NOT BE ALLOWED IF WS-RFR-LEAD-IN-SYS-UD
      *          OR WS-RFR-OD-IN-SYS-RB ARE TRUE: EMP IS IN SYS RESET
                 PERFORM P4216-MSGS-FOR-RED-NO-HOSO
237600           PERFORM P9000-SEND-MAP-AND-RETURN
      *CNLD-259 E
337500        WHEN WS-EMP-UNDST-REST
337600           MOVE WS-UD-MESG TO SCR08Z-PHONE
337700           MOVE YELLOW     TO SCR08Z-PHONE-COLOR
                 MOVE RED        TO SCR08Z-NAME-COLOR
337800           SET P925-EMP-STATUS-RED TO TRUE
337900           SET P925-OVERRIDE-DENY  TO TRUE
338400           PERFORM P9000-SEND-MAP-AND-RETURN

234100*CNLD-259 B CNC0600
338800*       WHEN P925-LOCAL-LT-RESET
338800        WHEN P925-LOCAL-LE-UDR2
234100*CNLD-259 E CNC0600
339000*       EMP WILL RESET SHORTLY, PROHIBITS CALL
                 MOVE P925-RB-MSG-1-HRMN(1:2) TO WS-RB-1-HH
                 MOVE P925-RB-MSG-1-HRMN(3:2) TO WS-RB-1-MM
                 MOVE WS-RB-1-MESG  TO SCR08Z-PHONE
                 MOVE YELLOW        TO SCR08Z-PHONE-COLOR
                 SET P925-EMP-STATUS-RED TO TRUE
                 SET P925-OVERRIDE-DENY  TO TRUE
                 MOVE P925-OVERRIDE-ALLOW-FLAG
                                    TO P08ZCA-HOSO-ALLOW-FL
                 PERFORM P9000-SEND-MAP-AND-RETURN

340800        WHEN P08ZCA-HOSO-ALLOW
340900           PERFORM P4215-MSGS-FOR-RED-STATUS
341500           MOVE -1                  TO SCR08Z-FUNC-CURSOR
341600           MOVE REV-VIDEO           TO SCR08Z-FUNC-HI
341700           PERFORM P9000-SEND-MAP-AND-RETURN

342100        WHEN NOT DEADHEAD-HOME
                 PERFORM P4216-MSGS-FOR-RED-NO-HOSO
                 PERFORM P9000-SEND-MAP-AND-RETURN

              WHEN OTHER
                 CONTINUE
              END-EVALUATE
344700     END-IF.
337300*CNC0600-E
344800
344900******************************************************************
345000 P4215-MSGS-FOR-RED-STATUS.
345100******************************************************************
345200*     IF P08ZCA-HOSO-ALLOW
345300      EVALUATE TRUE
345400         WHEN WS-RFR-7DAY-RND-ERT
345500              MOVE P925-RFR-MSG  TO WS-RFR-MSG
345600*             'ERT=XXXX RNDTRIP:NOT ENOUGH TIME FOR 7DAY
345700*                             RESET BRK. USE'HOSO'IF REQ'
345800              MOVE 'E373'        TO MSGLOG-CODE
345900         WHEN WS-RFR-7DAY-ERT
346000              MOVE P925-RFR-MSG  TO WS-RFR-MSG
346100*             'ERT=XXXX :NOT ENOUGH TIME FOR 7DAY
346200*                             RESET BRK. USE'HOSO'IF REQ'
346300              MOVE 'E374'        TO MSGLOG-CODE
346400         WHEN WS-RFR-7DAY-HRS
346500*             'NOT ENOUGH HOURS LEFT FOR 7DAY RESET BRK.
346600*                                        USE'HOSO'IF REQ'
346700              MOVE 'N267'        TO MSGLOG-CODE
      *CNLD-257-DXC-B
346800*        WHEN WS-RFR-60-192-ERT
346800         WHEN WS-RFR-60-ERT
346900              MOVE P925-RFR-MSG  TO WS-RFR-MSG
347000*             'ERT XXXX :NOT ENOUGH HOURS ON 60/7 DAY CLOCK;
347100*                                        USE'HOSO'IF REQ'
347200              MOVE 'E375'        TO MSGLOG-CODE
               WHEN WS-RFR-192-ERT
                    MOVE P925-RFR-MSG
                                       TO WS-RFR-MSG
      *             'ERT XXXX :NOT ENOUGH HOURS ON 192/28 DAY CLOCK;
      *                                        USE'HOSO'IF REQ'
                    MOVE 'E382'     TO MSGLOG-CODE
347300*CNLD-230-NXA-B
347400*        WHEN WS-RFR-60-192-HRS
347400         WHEN WS-RFR-60-HRS
347500*             'NOT ENOUGH HOURS LEFT ON 60/7 DAY CLOCK;
347600*                                         USE'HOSO'IF REQ'
347700              MOVE 'N269'     TO MSGLOG-CODE
               WHEN WS-RFR-192-HRS

      *             'NOT ENOUGH HOURS LEFT ON 192/28 DAY CLOCK;
      *                                        USE'HOSO'IF REQ'
                    MOVE 'N271'     TO MSGLOG-CODE
347800*CNLD-230-NXA-E
      *CNLD-257-DXC-E
347900         WHEN WS-RFR-MTOD
348000*             'EMPLOYEE NOT RESTED; USE'HOSO'IF REQ'
348100              MOVE 'E376'        TO MSGLOG-CODE
348200         WHEN OTHER
348300*             'NOT ENOUGH HOURS TO COMPLETE CALL, USE HOSO TO
348400*                                      OVERRIDE HOS RULE'
348500              MOVE 'N264'        TO MSGLOG-CODE
348600        END-EVALUATE
      *CNC0600-DXC-CNLD-230-B
      *   WE HAVE THE RIGHT MESSAGE.  NOW GET THE RIGHT DISPLAY COLOR.
              IF P925-EMP-STATUS-RED
      *CNLD-257-DXC-B
      *       AND (WS-RFR-7DAY-ERT OR WS-RFR-60-192-ERT)
              AND (WS-RFR-7DAY-ERT OR WS-RFR-60-ERT OR WS-RFR-192-ERT)
      *CNLD-257-DXC-E
      *IN CASE OF FILL OR HELP AND WS-RFR-7DAY-ERT OR WS-RFR-60-192-ERT
      *DISPLAY EMP NAME IN YELLOW AND IF CALL DISPLAY IN RED
                 EVALUATE TRUE
                    WHEN FILL-VACANCY
                    WHEN USER-OVERRIDE
                    WHEN FILL-VACANCY-FUNCTION
                       MOVE YELLOW     TO  SCR08Z-NAME-COLOR
                    WHEN CALL-FUNCTION
                    WHEN IVR-CALL-FUNCTION
                       MOVE RED        TO  SCR08Z-NAME-COLOR
                 END-EVALUATE
      *
              END-IF
      *CNC0600-DXC-CNLD-230-E
348700     .
348800*CNLD-230-E
      *CNC0600-DXC-CNLD-230-B
344900******************************************************************
345000 P4216-MSGS-FOR-RED-NO-HOSO.
345100******************************************************************

              EVALUATE TRUE
      *CNLD-259 B CNC0600
                 WHEN WS-RFR-LEAD-IN-SYS-UD

      *             'LEAD TIME IS OVERLAPPING WITH SYS RESET UDR.'
                    MOVE 'L050'     TO MSGLOG-CODE
                 WHEN WS-RFR-OD-IN-SYS-RB

      *             'ON-DUTY TIME IS DURING SYS RESET BRK.'
                    MOVE 'O098'     TO MSGLOG-CODE
      *CNLD-259 E
                 WHEN WS-RFR-7DAY-HRS

      *             'NOT ENOUGH HOURS LEFT FOR 7DAY RESET BRK.'
138710              MOVE 'N268'     TO MSGLOG-CODE
      *CNLD-257-DXC-B
      *          WHEN WS-RFR-60-192-HRS
                 WHEN WS-RFR-60-HRS

      *             'NOT ENOUGH HOURS LEFT ON 60/7 DAY CLOCK.'
138710              MOVE 'N270'     TO MSGLOG-CODE
                 WHEN WS-RFR-192-HRS

      *                'NOT ENOUGH HOURS LEFT ON 192/28 DAY CLOCK.'
                    MOVE 'N272'     TO MSGLOG-CODE
      *CNLD-257-DXC-E
                 WHEN WS-RFR-MTOD
      *CNLD-265
                 WHEN WS-RFR-PERS

      *             'EMPLOYEE NOT RESTED.'
138710              MOVE 'E377'     TO MSGLOG-CODE
                 WHEN WS-RFR-7DAY-RND-ERT
                    MOVE P925-RFR-MSG
                                                TO WS-RFR-MSG
      *           'ERT=XXXX RNDTRIP:NOT ENOUGH TIME FOR 7DAY RESET BRK.'
138710              MOVE 'E378'              TO MSGLOG-CODE
                 WHEN WS-RFR-7DAY-ERT
                    MOVE P925-RFR-MSG
                                       TO WS-RFR-MSG
      *             'ERT=XXXX :NOT ENOUGH TIME FOR 7DAY RESET BRK.'
138710                 MOVE 'E379'              TO MSGLOG-CODE
      *CNLD-257-DXC-B
      *          WHEN WS-RFR-60-192-ERT
                 WHEN WS-RFR-60-ERT
                    MOVE P925-RFR-MSG
                                       TO WS-RFR-MSG
      *             'ERT XXXX :NOT ENOUGH HOURS ON 60/7 DAY CLOCK.'
138710              MOVE 'E380'        TO MSGLOG-CODE
                 WHEN WS-RFR-192-ERT
                    MOVE P925-RFR-MSG
                                       TO WS-RFR-MSG
      *           'ERT XXXX :NOT ENOUGH HOURS ON 192/28 DAY CLOCK.
                    MOVE 'E383'     TO MSGLOG-CODE
      *CNLD-257-DXC-E
              END-EVALUATE
      *CNLD-230-NXA-B
              IF P925-EMP-STATUS-RED
      *CNLD-257-DXC-B
      *       AND  WS-RFR-60-192-HRS
              AND (WS-RFR-60-HRS OR WS-RFR-192-HRS)
      *CNLD-257-DXC-E
      *IN CASE OF  HELP AND WS-RFR-60-192-HRS
      *DISPLAY EMP NAME IN IN RED
                 EVALUATE TRUE
                    WHEN USER-OVERRIDE
                       MOVE RED        TO  SCR08Z-NAME-COLOR
                 END-EVALUATE
      *
              END-IF
      *CNLD-230-NXA-E
              .
      *CNC0600-DXC-CNLD-230-E
      *
348900******************************************************************
349000 P4220-LOOK-FOR-QUICK-TIEUPS.
349100******************************************************************
349200     MOVE SPACES                      TO P980-COMMAREA-PARMS
349300     SET P980-QUICKTIE-RESTRICT-FUNC  TO TRUE
349400     MOVE EMP-NBR OF WS-MSTR          TO P980-EMP-NO
349500     EXEC CICS LINK
349600               PROGRAM(P980-PGM)
349700               COMMAREA(P980-COMMAREA-PARMS)
349800               LENGTH(P980-LGTH)
349900               RESP(WS-RESPONSE)
350000     END-EXEC
350100     MOVE WS-RESPONSE                TO FILE-STATUS
350200     IF NOT SUCCESS
350300        MOVE 'P4220-1'               TO ERR-PARAGRAPH
350400        MOVE 'LINK980'               TO ERR-KEY
350500        PERFORM P9999-GOT-PROBLEM
350600     END-IF.
350700******************************************************************
350800 P4300-PROCESS-HELP-FUNCTION.
350900******************************************************************
351000*    CHECK IF USER HAS HIGH-LEVEL AUTHORITY TO REQUEST OVERRIDE
351100*-----------------------------------------------------------------
351200     MOVE SPACES                        TO WS-AUTHORITY
351300     MOVE SCR08Z-DIST                   TO USERID-DIST-1
351400     MOVE SCR08Z-SUB-DIST               TO USERID-SDIST-1
351500     EXEC CICS LINK
351600               PROGRAM(P902-PGM)
351700               COMMAREA(WS-AUTHORITY)
351800               LENGTH(P902-LGTH)
351900               RESP(WS-RESPONSE)
352000     END-EXEC
352100     MOVE WS-RESPONSE                   TO FILE-STATUS
352200     IF NOT SUCCESS
352300        MOVE 'P4300-S'                  TO ERR-PARAGRAPH
352400        MOVE 'SECURITY'                 TO ERR-KEY
352500        PERFORM P9999-GOT-PROBLEM
352600     END-IF
352700     IF NOT HIGH-LEVEL-AUTHORIZED
352800        MOVE -1                         TO SCR08Z-FUNC-CURSOR
352900        MOVE REV-VIDEO                  TO SCR08Z-FUNC-HI
353000        MOVE 'U003'                     TO MSGLOG-CODE
353100        PERFORM P9000-SEND-MAP-AND-RETURN
353200     END-IF
353300*
353400     MOVE SPACES      TO SCR08Z-ASGN  SCR08Z-STATUS  SCR08Z-ST
353500                         SCR08Z-REST-DATE     SCR08Z-REST-HOUR
353600                         SCR08Z-P-REST-D      SCR08Z-P-REST-T
353700                         SCR08Z-MTOD-D        SCR08Z-MTOD-T
353800                         SCR08Z-PD            SCR08Z-CRAFT
353900                         SCR08Z-ECC           SCR08Z-MTOD-PD.
354000     MOVE SPACES      TO P08ZCA-SCREEN-COMMAREA.
354100
354200     IF P08ZCA-EMP-NO NOT > ZEROES
354300        IF SCR08Z-NAME = 'END OF DECISIONS'
354400           MOVE SPACES TO SCR08Z-NAME
354500        END-IF
354600     END-IF
354700     MOVE SCR08Z-NAME TO EMP-NAME OF WS-MSTR
354800     MOVE P08ZCA-EMP-NO TO EMP-NBR OF WS-MSTR
354900     MOVE EMP-NAME-NBR-KEY TO MSTREMPK
355000     EXEC CICS STARTBR
355100               DATASET(MSTR-VIA-EMP-NAME)
355200               RIDFLD(MSTREMPK)
355300               GTEQ
355400               RESP(WS-RESPONSE)
355500     END-EXEC
355600     MOVE WS-RESPONSE TO FILE-STATUS
355700     IF SUCCESS
355800        PERFORM P4301-NEXT-REC UNTIL DONE
355900        EXEC CICS ENDBR
356000                  DATASET(MSTR-VIA-EMP-NAME)
356100                  RESP(WS-RESPONSE)
356200        END-EXEC
356300     ELSE
356400        IF NO-RECORD-FND OR END-OF-FILE
356500           MOVE -1 TO SCR08Z-NAME-CURSOR
356600*               'NAME NOT FOUND'
356700           MOVE 'N001' TO MSGLOG-CODE
356800           PERFORM P9000-SEND-MAP-AND-RETURN
356900        ELSE
357000           MOVE 'P4300-1' TO ERR-PARAGRAPH
357100           MOVE MSTREMPK  TO ERR-KEY
357200           PERFORM P9999-GOT-PROBLEM
357300        END-IF
357400     END-IF
357500
357600     IF WORKING
357700***     SET NO-UPDATE TO TRUE
357800        MOVE -1 TO SCR08Z-NAME-CURSOR
357900*              'EMPLOYEE NOT AVAILABLE FOR DEADHEAD'
358000        MOVE 'E057' TO MSGLOG-CODE
358100        PERFORM P9000-SEND-MAP-AND-RETURN
358200     END-IF
358300*
358400     PERFORM P4610-GET-HRS-SVC-INFO
358500     MOVE SCR08Z-CODE TO CODE-AREA
363100     IF P925-EMP-STATUS-RED
363200        AND NOT DEADHEAD-HOME
      *CNC0600
363300     AND WS-CAN-WRR-OLD
363400***     SET NO-UPDATE            TO TRUE
363500        MOVE -1                  TO SCR08Z-NAME-CURSOR
363600        MOVE 'E236'              TO MSGLOG-CODE
363700        MOVE 'HOUR'              TO SCR08Z-FUNC
363800        PERFORM P9000-SEND-MAP-AND-RETURN
363900     ELSE
364000        IF (P925-EMP-STATUS-YELLOW
364100           OR P925-EMP-STATUS-RED)
364300           MOVE 'E237'           TO MSGLOG-CODE
364400           MOVE 'HOUR'           TO SCR08Z-FUNC
364500        END-IF
364600     END-IF
358600*CNC0600-B
358700     IF P925-EMP-STATUS-RED
363300     AND WS-CAN-WRR-NEW
              EVALUATE TRUE
      *CNLD-259 B CNC0600
              WHEN WS-RFR-LEAD-IN-SYS-UD
              WHEN WS-RFR-OD-IN-SYS-RB
      *          P08ZCA-HOSO-DENY WILL BE TRUE;
      *          CALL SHOULD NOT BE ALLOWED IF WS-RFR-LEAD-IN-SYS-UD
      *          OR WS-RFR-OD-IN-SYS-RB ARE TRUE: EMP IS IN SYS RESET
                 PERFORM P4216-MSGS-FOR-RED-NO-HOSO
237600           PERFORM P9000-SEND-MAP-AND-RETURN
      *CNLD-259 E
358800        WHEN WS-EMP-UNDST-REST
358900           MOVE WS-UD-MESG TO SCR08Z-PHONE
359000           MOVE YELLOW     TO SCR08Z-PHONE-COLOR
359000           MOVE RED        TO SCR08Z-NAME-COLOR
359100           SET P925-EMP-STATUS-RED TO TRUE
359200           SET P925-OVERRIDE-DENY  TO TRUE
359700           PERFORM P9000-SEND-MAP-AND-RETURN
234100*CNLD-259 B CNC0600
360200*       WHEN P925-LOCAL-LT-RESET
360200        WHEN P925-LOCAL-LE-UDR2
234100*CNLD-259 E CNC0600
360300*       EMP WILL RESET SHORTLY, PROHIBITS CALL
360400           MOVE P925-RB-MSG-1-HRMN(1:2) TO WS-RB-1-HH
360500           MOVE P925-RB-MSG-1-HRMN(3:2) TO WS-RB-1-MM
360600           MOVE WS-RB-1-MESG  TO SCR08Z-PHONE
360700           MOVE YELLOW        TO SCR08Z-PHONE-COLOR
360800           SET P925-EMP-STATUS-RED TO TRUE
360900           SET P925-OVERRIDE-DENY  TO TRUE
361400           PERFORM P9000-SEND-MAP-AND-RETURN
361800        WHEN P08ZCA-HOSO-ALLOW
361900*       'NOT ENOUGH HOURS TO COMPLETE CALL, USE HOSO TO
362000*                                     OVERRIDE HOS RULE'
362200           PERFORM P4215-MSGS-FOR-RED-STATUS
362800           PERFORM P9000-SEND-MAP-AND-RETURN
      *CNLD-259 B CNC0600
342100        WHEN NOT DEADHEAD-HOME
                 PERFORM P4216-MSGS-FOR-RED-NO-HOSO
                 PERFORM P9000-SEND-MAP-AND-RETURN
      *CNLD-259 E CNC0600

              END-EVALUATE
362900     END-IF
363000*CNC0600-E
364700*
364800     MOVE SCR08Z-CODE TO CODE-AREA
364900     IF DEADHEAD-HOME
365000       IF TA-AREA > SPACE OR OD-AREA > SPACE
365100          CONTINUE
365200       ELSE
365300***      SET NO-UPDATE TO TRUE
365400         IF TA-AREA NOT > SPACE
365500***        SET NO-UPDATE TO TRUE
365600           MOVE -1 TO SCR08Z-NAME-CURSOR
365700*               'EMPLOYEE NOT BEING HELD ON ASSIGNMENT'
365800           MOVE 'E058' TO MSGLOG-CODE
365900           PERFORM P9000-SEND-MAP-AND-RETURN
366000         ELSE
366100           MOVE -1 TO SCR08Z-NAME-CURSOR
366200*               'EMPLOYEE IS NOT OUT OF TOWN'
366300           MOVE 'E059' TO MSGLOG-CODE
366400           PERFORM P9000-SEND-MAP-AND-RETURN
366500         END-IF
366600       END-IF
366700     END-IF
366800     SET DE-YYMMDD-FORMAT       TO TRUE
366900     MOVE EMP-US-RSTD-DATE      TO DE-YYMMDD
367000     PERFORM P8998-DATEEDIT
367100     MOVE DE-CCYYMMDD           TO DE-COMPARE1-DATE
367200     MOVE EMP-US-RSTD-TIME      TO DE-COMPARE1-TIME
367300     SET DE-YYMMDD-FORMAT       TO TRUE
367400     MOVE P08ZCA-CONV-TIME(1:6) TO DE-YYMMDD
367500     PERFORM P8998-DATEEDIT
367600     MOVE DE-CCYYMMDD           TO DE-COMPARE2-DATE
367700     MOVE P08ZCA-CONV-TIME(7:4) TO DE-COMPARE2-TIME
367800     IF DE-COMPARE1-DATE-TIME > DE-COMPARE2-DATE-TIME
367900*    IF EMP-US-RSTD-NUM       > P08ZCA-CONV-TIME
368000*            'EMPLOYEE IS NOT RESTED'
368100        IF MSGLOG-CODE NOT > SPACES
368200*CNC0600-CNLD-221B
368300*          MOVE 'E060' TO MSGLOG-CODE
368400*     ONLY ISSUE THE ERROR IF THE CREW PROFILE IS SET FOR USA
368500           IF P925-EMP-STATUS-NA
368600              MOVE 'E060' TO MSGLOG-CODE
368700           END-IF
368800        END-IF
368900*CNC0600-CNLD-221E
369000     END-IF.
369100*
369200 P4301-NEXT-REC.
369300*
369400     EXEC CICS READNEXT
369500               DATASET(MSTR-VIA-EMP-NAME)
369600               INTO(WS-MSTR)
369700               LENGTH(MSTRENAM-RLGTH)
369800               RIDFLD(MSTREMPK)
369900               KEYLENGTH(MSTRENAM-KLGTH)
370000               RESP(WS-RESPONSE)
370100     END-EXEC
370200     MOVE WS-RESPONSE TO FILE-STATUS
370300     IF SUCCESS
370400       IF SCR08Z-DIST = DIST OF WS-MSTR AND
370500          SCR08Z-SUB-DIST = SUB-DIST OF WS-MSTR
370600          IF P08ZCA-EMP-NO NOT = EMP-NBR OF WS-MSTR
370700            OR P08ZCA-EMP-NO = SPACES OR LOW-VALUES
370800             SET DONE TO TRUE
370900          END-IF
371000       END-IF
371100       IF DONE
371200          IF NOT P08ZCA-DHD-HOME
371300*SAM ADD QUAL
371400             PERFORM P4330-GET-ASGN-QUAL
371500             PERFORM P4350-CHECK-RESTRICTIONS
371600          END-IF
371700          PERFORM P4210-SETUP-NAME-INFO
371800       END-IF
371900     ELSE
372000       IF NO-RECORD-FND OR END-OF-FILE
372100          MOVE -1 TO SCR08Z-NAME-CURSOR
372200*              'END OF EMPLOYEE FILE IN DIST/SUB-DIST'
372300          MOVE 'E011' TO MSGLOG-CODE
372400          PERFORM P9000-SEND-MAP-AND-RETURN
372500       ELSE
372600          MOVE 'P4301' TO ERR-PARAGRAPH
372700          MOVE MSTREMPK TO ERR-KEY
372800          PERFORM P9999-GOT-PROBLEM
372900       END-IF
373000     END-IF.
373100*
373200 P4330-GET-ASGN-QUAL.
373300*
373400*---------------------------------------------------------------*
373500*    SEE IF THE ASSIGNMENT HAS ANY QUALIFICATIONS SPECIFIC TO   *
373600*    TO THE ASSIGNMENT (THIS WILL GET THE FIRST FIVE)           *
373700*---------------------------------------------------------------*
373800*
373900     MOVE SPACES                     TO WORK-CNTLKEY
374000     MOVE '13'                       TO WK-CNTL-REC-TYPE
374100     IF P08ZCA-DHD-TYPE = 'A'
374200        MOVE AJ-JOB-DIST                TO WK-CNTL-DIST
374300        MOVE AJ-JOB-SUB-DIST            TO WK-CNTL-SUB-DIST
374400        MOVE 'A'                        TO WK-CNTL-ASGN-QUAL-TYPE
374500        MOVE AJ-JOB-ASSIGNMENT          TO WK-CNTL-ASGN-QUAL
374600        PERFORM P8610-READ-CNTLFILE
374700        IF NOT SUCCESS
374800           MOVE '**'                    TO WK-CNTL-ASGN-QUAL-5-6
374900           PERFORM P8610-READ-CNTLFILE
375000        END-IF
375100     ELSE
375200        MOVE DIST2                      TO WK-CNTL-DIST
375300        MOVE SUB-DIST2                  TO WK-CNTL-SUB-DIST
375400        MOVE 'P'                        TO WK-CNTL-ASGN-QUAL-TYPE
375500        MOVE UFPTURN-5-12               TO WK-CNTL-ASGN-QUAL
375600        PERFORM P8610-READ-CNTLFILE
375700        IF NOT SUCCESS
375800           MOVE '**'                    TO WK-CNTL-ASGN-QUAL-5-6
375900           PERFORM P8610-READ-CNTLFILE
376000           IF NOT SUCCESS
376100              MOVE '**'                 TO WK-CNTL-ASGN-QUAL-3-4
376200              PERFORM P8610-READ-CNTLFILE
376300           END-IF
376400        END-IF
376500     END-IF
376600*
376700     MOVE SPACES    TO WORK-ASGN-QUAL-AREA
376800     IF NOT SUCCESS
376900        MOVE SPACES      TO FOUND-QUAL-FLAG
377000        PERFORM P4340-SEARCH-CNTL-QUAL
377100     ELSE
377200        SET QUAL-FOUND   TO TRUE
377300     END-IF
377400*
377500     IF QUAL-FOUND
377600        MOVE SPACES TO WORK-ASGN-QUAL-AREA
377700        PERFORM VARYING SUB1 FROM 1 BY 1
377800           UNTIL SUB1 > QUAL-ARRAY-MAX
377900           IF CNTL-QUALIFICATION-TABLE-ENTRY(SUB1) > SPACE
378000              MOVE CNTL-QUALIFICATION-TABLE-ENTRY(SUB1)
378100              TO WORK-ASGN-QUAL(SUB1)
378200           END-IF
378300        END-PERFORM
378400     END-IF.
378500*
378600*    HERE WE GET THE "SIXTH" QUALIFICATION FROM THE ASSIGNMENT
378700*    PROFILE RECORD
378800*
378900     MOVE WS-TRCN-FILE        TO SAVE-TRCN-FILE
379000     MOVE P08CA-PROFILE-KEY TO TRCNKEY1
379100     PERFORM P8000-READ-TRCNKEY1
379200     MOVE WK-CNTL-ASGN-QUAL-7-8 TO SAVE-CC
379300     IF WS-HOLD-CC = 'FI' OR 'SE'
379400        MOVE 'SE'            TO SAVE-CC
379500     END-IF
379600     IF WS-HOLD-CC = 'S1' OR 'S2'
379700        MOVE 'SW'            TO SAVE-CC
379800     END-IF
379900     IF WK-CNTL-ASGN-QUAL-7-8 = ('B1' OR 'B2')
380000        MOVE 'BK'            TO SAVE-CC
380100     END-IF
380200*CNC0572 - BEG
380300***  PERFORM VARYING SUB1 FROM 1 BY 1 UNTIL SUB1 > 4
380400***     IF SAVE-CC = TRCN-SPCL-QUAL-CC(SUB1)
380500***        MOVE TRCN-SPCL-QUAL(SUB1)
380600***                           TO WORK-ASGN-QUAL(6)
380700***     END-IF
380800***  END-PERFORM
380900     MOVE 5 TO SUB3
381000     PERFORM VARYING SUB1 FROM 1 BY 1 UNTIL SUB1 > 4
381100        IF SAVE-CC = TRCN-SPCL-QUAL-CC(SUB1)
381200           ADD 1 TO SUB3
381300           IF SUB3 < 9
381400              MOVE TRCN-SPCL-QUAL(SUB1)
381500                              TO WORK-ASGN-QUAL(SUB3)
381600           END-IF
381700        END-IF
381800     END-PERFORM
381900     PERFORM VARYING SUB1 FROM 1 BY 1 UNTIL SUB1 > 4
382000        IF SAVE-CC = TRCN-SPCL-QUAL2-CC(SUB1)
382100           ADD 1 TO SUB3
382200           IF SUB3 < 9
382300              MOVE TRCN-SPCL-QUAL2(SUB1)
382400                              TO WORK-ASGN-QUAL(SUB3)
382500           END-IF
382600        END-IF
382700     END-PERFORM
382800*CNC0572 - END
382900     MOVE SAVE-TRCN-FILE   TO WS-TRCN-FILE
383000     PERFORM P4345-GET-EMP-QUALIFICATIONS.
383100*
383200 P4340-SEARCH-CNTL-QUAL.
383300*
383400     MOVE SPACES      TO QUAL-SEARCH-FLAG
383500     MOVE 6           TO SUB2
383600     MOVE '*'         TO WK-CNTL-ASGN-POS(SUB2)
383700*
383800     PERFORM UNTIL QUAL-SEARCH-DONE
383900        PERFORM P8610-READ-CNTLFILE
384000        IF SUCCESS
384100           SET QUAL-FOUND            TO TRUE
384200           SET QUAL-SEARCH-DONE      TO TRUE
384300        ELSE
384400           IF SUB2 < 4
384500              SET QUAL-SEARCH-DONE   TO TRUE
384600           ELSE
384700              SUBTRACT 1 FROM SUB2
384800              MOVE '*'               TO WK-CNTL-ASGN-POS(SUB2)
384900           END-IF
385000        END-IF
385100     END-PERFORM.
385200*
385300 P4345-GET-EMP-QUALIFICATIONS.
385400*
385500     SET EMP-QUALIFIED TO TRUE
385600     MOVE EMP-NBR OF WS-MSTR TO QUAL-EMP-NO
385700     PERFORM VARYING SUB1 FROM 1 BY 1
385800        UNTIL SUB1 > ASGN-QUAL-ARRAY-MAX
385900
386000        IF WORK-ASGN-QUAL(SUB1) > SPACES
386100           MOVE WORK-ASGN-QUAL(SUB1) TO QUALIFICATION
386200           MOVE QUALEMP-KEY TO QUALEMP
386300           EXEC CICS READ
386400                     DATASET(QUAL-FILE-VIA-QUALEMP)
386500                     INTO(WS-QUAL-FILE)
386600                     LENGTH(QUALEMP-RLGTH)
386700                     RIDFLD(QUALEMP)
386800                     KEYLENGTH(QUALEMP-KLGTH)
386900                     RESP(WS-RESPONSE)
387000           END-EXEC
387100           MOVE WS-RESPONSE TO FILE-STATUS
387200           IF SUCCESS
387300              IF QUAL-DATE NOT > '000000'
387400                 MOVE '999999'      TO QUAL-DATE
387500              END-IF
387600*             *-------------------------------------------*
387700*             IF THE EMPLOYEE HAS THE QUALIFICATION CODE,
387800*             AND THE QUALIFICATION HAS "EXPIRED", THE
387900*             EMPLOYEE CANNOT BE CALLED FOR THE ASSIGNMENT
388000*             *-------------------------------------------*
388100              SET DE-YYMMDD-FORMAT      TO TRUE
388200              MOVE QUAL-DATE            TO DE-YYMMDD
388300              PERFORM P8998-DATEEDIT
388400              MOVE DE-CCYYMMDD          TO DE-COMPARE2-DATE
388500              SET DE-YYMMDD-FORMAT      TO TRUE
388600              MOVE P08ZCA-EFF-DATE      TO DE-YYMMDD
388700              PERFORM P8998-DATEEDIT
388800              MOVE DE-CCYYMMDD          TO DE-COMPARE1-DATE
388900              IF DE-COMPARE2-DATE < DE-COMPARE1-DATE
389000*             IF QUAL-DATE           < P08ZCA-EFF-DATE
389100*                STRING 'EMPLOYEE NOT QUALIFIED - '
389200*                       QUALIFICATION ' EXPIRED '
389300*                       QUAL-DATE
389400*                       DELIMITED BY SIZE
389500*                       INTO SCR08Z-ERRORMSG
389600*                MOVE 'I050'        TO MSGLOG-CODE
389700                 SET EMP-QUAL-EXPIRED TO TRUE
389800                 MOVE ASGN-QUAL-ARRAY-MAX TO SUB1
389900              END-IF
390000           ELSE
390100              IF (NO-RECORD-FND OR END-OF-FILE)
390200*                *-------------------------------------------*
390300*                IF THE EMPLOYEE DOES NOT HAVE THE
390400*                QUALIFICATION THE EMPLOYEE CANNOT BE CALLED
390500*                FOR THE ASSIGNMENT
390600*                *-------------------------------------------*
390700*                STRING 'EMPLOYEE NOT QUALIFIED - '
390800*                       QUALIFICATION
390900*                       DELIMITED BY SIZE
391000*                       INTO SCR08Z-ERRORMSG
391100                 SET EMP-NOT-QUALIFIED TO TRUE
391200                 MOVE ASGN-QUAL-ARRAY-MAX TO SUB1
391300              ELSE
391400                 MOVE 'P4345-1'       TO ERR-PARAGRAPH
391500                 MOVE QUALEMP         TO ERR-KEY
391600                 PERFORM P9999-GOT-PROBLEM
391700              END-IF
391800           END-IF
391900        END-IF
392000     END-PERFORM.
392100*
392200 P4350-CHECK-RESTRICTIONS.
392300*
392400     MOVE SPACES                  TO WORK-DEC-TABLE
392500     IF P08ZCA-DEC-KEY > SPACES
392600        MOVE P08ZCA-DEC-KEY       TO DECKEY
392700        PERFORM P8900-READ-DECISION
392800        IF NOT SUCCESS
392900           IF NOT (NO-RECORD-FND OR END-OF-FILE)
393000              MOVE 'P4300-2'      TO ERR-PARAGRAPH
393100              MOVE DECKEY         TO ERR-KEY
393200              PERFORM P9999-GOT-PROBLEM
393300           END-IF
393400        END-IF
393500      END-IF
393600      MOVE SPACES                 TO P947-COMMAREA-PARMS
393700      SET P947-EMP-RESTR-FUNCTION   TO TRUE
393800      MOVE EMP-NBR OF WS-MSTR       TO P947-EMP-NO
393900      IF P08ZCA-DHD-TYPE = 'A'
394000         MOVE P08ZCA-ASSIGNMENT     TO WORK-AJ-KEY
394100         MOVE WORK-AJ-DIST          TO P947-ASGN-DIST
394200         MOVE WORK-AJ-SUB-DIST      TO P947-ASGN-SUB-DIST
394300      ELSE
394400          MOVE P08ZCA-ASSIGNMENT    TO UFPTURN
394500          EXEC CICS READ
394600                    DATASET(UFP-VIA-TURN-NBR)
394700                    INTO(WS-UFP)
394800                    LENGTH(UFPTURN-RLGTH)
394900                    RIDFLD(UFPTURN)
395000                    KEYLENGTH(UFPTURN-KLGTH)
395100                    RESP(WS-RESPONSE)
395200          END-EXEC
395300          MOVE WS-RESPONSE          TO FILE-STATUS
395400          IF SUCCESS
395500             MOVE DIST2             TO P947-ASGN-DIST
395600             MOVE SUB-DIST2         TO P947-ASGN-SUB-DIST
395700          END-IF
395800      END-IF
395900      IF DEC-FURTHER-NOTICE
396000         SET P947-FROM-OWN-WORK     TO TRUE
396100      ELSE
396200         SET P947-FROM-WORK         TO TRUE
396300      END-IF
396400      MOVE P08ZCA-ASSIGNMENT        TO WORK-AJ-KEY
396500      MOVE WORK-AJ-KEY              TO AJJOBKEY-AREA
396600      IF P08ZCA-DHD-TYPE = 'A'
396700         MOVE AJ-JOB-ASSIGNMENT     TO P947-ASGN-ASSIGNMENT
396800         SET P947-ASGN-AJ           TO TRUE
396900      ELSE
397000         MOVE UFPTURN-5-12          TO P947-ASGN-ASSIGNMENT
397100         SET P947-ASGN-UFP          TO TRUE
397200      END-IF
397300      PERFORM P5000-LINK-TO-947.
397400*
397500 P4400-PROCESS-OFF-FUNCTION.
397600*
397700     IF P08ZCA-EMP-NO NOT > SPACES
397800*            'IMPROPER FUNCTION - NO EMPLOYEE PRESENT'
397900        MOVE 'I050'        TO MSGLOG-CODE
398000        MOVE -1            TO SCR08Z-FUNC-CURSOR
398100        MOVE REV-VIDEO     TO SCR08Z-FUNC-HI
398200        PERFORM P9000-SEND-MAP-AND-RETURN
398300     END-IF
398400     MOVE DEFAULT-ATTR TO SCR08Z-ST-HI
398500                          SCR08Z-ECC-HI
398600     MOVE SPACES           TO P917-COMMAREA-PARMS
398700     MOVE P08ZCA-EMP-NO    TO P917-EMP-NO
398800     IF NOT MISSING-CALL
398900        IF SCR08Z-ST NOT > SPACES
399000*               'ENTER STATUS CODE TO BOOKOFF'
399100           MOVE 'E061' TO MSGLOG-CODE
399200           MOVE -1            TO SCR08Z-ST-CURSOR
399300           MOVE REV-VIDEO     TO SCR08Z-ST-HI
399400           PERFORM P9000-SEND-MAP-AND-RETURN
399500        END-IF
399600        MOVE SCR08Z-ST        TO P917-STATUS-CODE1
399700        MOVE SCR08Z-ECC       TO P917-EDB-CODE
399800     END-IF
399900     IF P08ZCA-LEAD-TIME > '0000'
400000        MOVE ZEROS               TO DATE-CONVERSION-PARMS
400100        SET PARM-SUBTRACT        TO TRUE
400200        MOVE SCR08Z-DATE         TO PARM-PRI-DATE-GREG
400300        MOVE SCR08Z-TIME         TO PARM-PRI-HRMN
400400        MOVE P08ZCA-LEAD-TIME    TO PARM-SEC-HRMN
400500        EXEC CICS LINK
400600                  PROGRAM(P903-PGM)
400700                  COMMAREA(DATE-CONVERSION-PARMS)
400800                  LENGTH(P903-LGTH)
400900                  RESP(WS-RESPONSE)
401000        END-EXEC
401100        MOVE WS-RESPONSE         TO FILE-STATUS
401200        IF NOT SUCCESS
401300           MOVE 'P4400-1'        TO ERR-PARAGRAPH
401400           MOVE 'P903LINK'       TO ERR-KEY
401500           PERFORM P9999-GOT-PROBLEM
401600        END-IF
401700        MOVE PARM-RES-DATE-GREG  TO WS-CALL-ML-DATE
401800        MOVE PARM-RES-HRMN       TO WS-CALL-ML-TIME
401900     ELSE
402000        MOVE SCR08Z-DATE         TO WS-CALL-ML-DATE
402100        MOVE SCR08Z-TIME         TO WS-CALL-ML-TIME
402200     END-IF
402300     MOVE WS-TIME-ZONE        TO P917-TIME-ZONE
402400     SET  P917-ON-CALL        TO TRUE
402500     MOVE P08ZCA-EFF-DATE     TO P917-CALL-DATE
402600                                 P917-EFF-DATE
402700     MOVE P08ZCA-EFF-HRMN     TO P917-CALL-TIME
402800                                 P917-EFF-TIME
402900     MOVE WS-CALL-ML-DATE     TO P917-ACTION-DATE
403000     MOVE WS-CALL-ML-TIME     TO P917-ACTION-TIME
403100     IF MISSING-CALL
403200        MOVE SCR08Z-FUNC      TO P917-MISSED-CALL-FUNC
403300        SET  P08ZCA-RESUB                TO TRUE
403400     END-IF
403500*-------------------------------------------------------------
403600*    IF TURN WAS SELECTED FROM FASTSLOW SPAREBOARD, USE THE
403700*    FLAG RETURNED FROM DECISION TABLE PROCESSING TO DETERMINE
403800*    ROAD VS. YARD.
403900*----------------------------------------------------------PLS
404000     IF P08ZCA-FROM-FAST-BOARD
404100        SET P917-YARD                    TO TRUE
404200     ELSE
404300        IF P08ZCA-FROM-SLOW-BOARD
404400           SET P917-ROAD                 TO TRUE
404500        ELSE
404600           IF P08ZCA-DHD-TYPE = 'A'
404700              MOVE P08ZCA-ASSIGNMENT     TO WORK-AJ-KEY
404800              MOVE WORK-AJ-JOB-NO        TO JOB-DEF-CHECK
404900              IF JOB-DEF-YARD-ASGN
405000                 SET P917-YARD           TO TRUE
405100              ELSE
405200                 SET P917-ROAD           TO TRUE
405300              END-IF
405400           ELSE
405500              SET P917-ROAD              TO TRUE
405600           END-IF
405700        END-IF
405800     END-IF
405900     IF P08ZCA-DEC-KEY > SPACES
406000        MOVE P08ZCA-DEC-KEY              TO P917-DECKEY
406100     END-IF
406200     IF NOT P08ZCA-DHD-HOME
406300        IF P08ZCA-DHD-TYPE = 'A'
406400           MOVE 'A'                      TO P917-OC-ASGN-TYPE
406500        ELSE
406600           MOVE 'U'                      TO P917-OC-ASGN-TYPE
406700        END-IF
406800        MOVE P08ZCA-ASSIGNMENT           TO P917-OC-ASGN
406900                                            P917-TRAIN-AREA
407000     END-IF
407100     MOVE PSTCA-SUB                      TO P917-SUB-CODE
407200     SET P917-FROM-08Z                   TO TRUE
407300     EXEC CICS LINK
407400               PROGRAM(P917-PGM)
407500               COMMAREA(P917-COMMAREA-PARMS)
407600               LENGTH(P917-LGTH)
407700               RESP(WS-RESPONSE)
407800     END-EXEC
407900     MOVE WS-RESPONSE TO FILE-STATUS
408000     IF NOT SUCCESS
408100        MOVE 'P4400-2' TO ERR-PARAGRAPH
408200        PERFORM P9999-GOT-PROBLEM
408300     END-IF
408400     MOVE P917-ERRORMSG TO SCR08Z-ERRORMSG
408500     IF P917-ERROR-FOUND
408600        IF P917-EMPLOYEE-ERROR
408700           MOVE -1 TO SCR08Z-NAME-CURSOR
408800           MOVE REV-VIDEO TO SCR08Z-NAME-HI
408900           PERFORM P9000-SEND-MAP-AND-RETURN
409000        ELSE
409100           IF P917-STATUS-CODE-ERROR
409200              MOVE -1 TO SCR08Z-ST-CURSOR
409300              MOVE REV-VIDEO TO SCR08Z-ST-HI
409400              PERFORM P9000-SEND-MAP-AND-RETURN
409500           ELSE
409600              IF P917-DATE-ERROR
409700                 MOVE -1 TO SCR08Z-DATE-CURSOR
409800                 MOVE REV-VIDEO TO SCR08Z-DATE-HI
409900                 PERFORM P9000-SEND-MAP-AND-RETURN
410000              ELSE
410100                 IF P917-TIME-ERROR
410200                    MOVE -1 TO SCR08Z-TIME-CURSOR
410300                    MOVE REV-VIDEO TO SCR08Z-TIME-HI
410400                    PERFORM P9000-SEND-MAP-AND-RETURN
410500                 ELSE
410600                    IF P917-MISC-ERROR
410700                       MOVE -1 TO SCR08Z-NAME-CURSOR
410800                       MOVE REV-VIDEO TO SCR08Z-NAME-HI
410900                       PERFORM P9000-SEND-MAP-AND-RETURN
411000                    ELSE
411100                       IF P917-EDB-CODE-ERROR
411200                          MOVE -1 TO SCR08Z-ECC-CURSOR
411300                          MOVE REV-VIDEO TO SCR08Z-ECC-HI
411400                          PERFORM P9000-SEND-MAP-AND-RETURN
411500                       END-IF
411600                    END-IF
411700                 END-IF
411800              END-IF
411900           END-IF
412000        END-IF
412100     ELSE
412200*C1067 - 05/12/15 - BEG
412300***     MOVE P917-EMP-NO TO MSTRNBRK
412400***     PERFORM P8500-READ-MASTER
412500***     MOVE WS-RESPONSE TO FILE-STATUS
412600***     IF NOT SUCCESS
412700***        MOVE 'P4400-3 ' TO ERR-PARAGRAPH
412800***        MOVE MSTRNBRK   TO ERR-KEY
412900***        PERFORM P9999-GOT-PROBLEM
413000***     END-IF
413100***     PERFORM P4210-SETUP-NAME-INFO
413200*C1105 - BEG
413300        PERFORM P4200-PROCESS-FILL-FUNCTION
413400**      IF NOT REJECT-EMPLOYEE-FUNCTION
413500**         MOVE SCR08Z-FUNC    TO P923-FILL-FUNC-CODE
413600**         IF P923-REJECT-EMPLOYEE-FUN
413700**            MOVE SPACES      TO P923-COMMAREA-PARMS
413800**            PERFORM P4200-PROCESS-FILL-FUNCTION
413900**         ELSE
414000**            MOVE P917-EMP-NO TO MSTRNBRK
414100**            PERFORM P8500-READ-MASTER
414200**            MOVE WS-RESPONSE TO FILE-STATUS
414300**            IF NOT SUCCESS
414400**               MOVE 'P4400-3 ' TO ERR-PARAGRAPH
414500**               MOVE MSTRNBRK TO ERR-KEY
414600**               PERFORM P9999-GOT-PROBLEM
414700**            END-IF
414800**            PERFORM P4210-SETUP-NAME-INFO
414900**         END-IF
415000**      ELSE
415100**         MOVE P917-EMP-NO TO MSTRNBRK
415200**         PERFORM P8500-READ-MASTER
415300**         MOVE WS-RESPONSE TO FILE-STATUS
415400**         IF NOT SUCCESS
415500**            MOVE 'P4400-4 ' TO ERR-PARAGRAPH
415600**            MOVE MSTRNBRK TO ERR-KEY
415700**            PERFORM P9999-GOT-PROBLEM
415800**         END-IF
415900**         PERFORM P4210-SETUP-NAME-INFO
416000**      END-IF
416100*C1105 - END
416200*C1067 - 05/12/15 - END
416300     END-IF.
416400*
416500 P4500-ATTEMPTED-NOTIFY.
416600*
416700     IF P08ZCA-EMP-NO NOT > SPACES
416800*            'IMPROPER FUNCTION - NO EMPLOYEE PRESENT'
416900        MOVE 'I050'        TO MSGLOG-CODE
417000        MOVE -1            TO SCR08Z-FUNC-CURSOR
417100        MOVE REV-VIDEO     TO SCR08Z-FUNC-HI
417200        PERFORM P9000-SEND-MAP-AND-RETURN
417300     END-IF
417400
417500     MOVE SPACES                    TO P943-COMMAREA-PARMS
417600     MOVE P08ZCA-EMP-NO             TO P943-EMP-NBR
417700     SET P943-ATTEMPT-NTFY-FUN      TO TRUE
417800     MOVE SCR08Z-DIST               TO P943-DIST
417900     MOVE SCR08Z-SUB-DIST           TO P943-SDIST
418000     MOVE SCR08Z-CRAFT              TO P943-CRAFT
418100     MOVE SCR08Z-DATE               TO P943-E-DATE(1:6)
418200     MOVE SCR08Z-TIME               TO P943-E-TOD
418300     MOVE WS-TIME-ZONE              TO P943-EMP-TIME-ZONE
418400     MOVE SCR08Z-FUNC               TO P943-ATTEMPT-TYPE
418500     MOVE SCR08Z-ASGN               TO P943-NORM-ASGN
418600     MOVE LAYOFF-CODE OF WS-MSTR    TO P943-LO
418700     MOVE SCR08Z-CODE               TO P943-TEMP-ASGN-TRAIN
418800     PERFORM P8700-WRITE-HISTORY
418900*    IF SCR08Z-FUNC = 'CSPR'
419000*       MOVE 'EMPLOYEE SPREAD CALL COMPLETED'
419100*                                   TO SCR08Z-ERRORMSG
419200*    ELSE
419300        MOVE 'EMPLOYEE "ATTEMPT" NOTIFICATION COMPLETED'
419400                                    TO SCR08Z-ERRORMSG
419500*    END-IF
419600     MOVE '****'    TO SCR08Z-FUNC
419700     MOVE -1        TO SCR08Z-FUNC-CURSOR.
419800*================================================================*
419900 P4600-DISPLAY-HRS-SVC-INFO.
420000*================================================================*
420100*
420200     IF P08ZCA-EMP-NO NOT > SPACES
420300*            'IMPROPER FUNCTION - NO EMPLOYEE PRESENT'
420400        MOVE 'I050'        TO MSGLOG-CODE
420500        MOVE -1            TO SCR08Z-FUNC-CURSOR
420600        MOVE REV-VIDEO     TO SCR08Z-FUNC-HI
420700        PERFORM P9000-SEND-MAP-AND-RETURN
420800     END-IF
420900
421000     PERFORM P4610-GET-HRS-SVC-INFO
421100
421200     MOVE P08ZCA-EMP-NO          TO MSTRNBRK
421300     PERFORM P8500-READ-MASTER
421400*CNC0598-B
421500     MOVE SPACES                 TO CNTLKEY-AREA
421600     MOVE '02'                   TO CNTL-REC-TYPE
421700     MOVE DIST OF WS-MSTR        TO CNTL-DIST
421800     MOVE SUB-DIST OF WS-MSTR    TO CNTL-SUB-DIST
421900     MOVE CNTLKEY-AREA           TO CNTLKEY
422000     PERFORM P8800-READ-CNTLFILE
422100     IF NOT SUCCESS
422200        MOVE 'P4600-1'           TO ERR-PARAGRAPH
422300        MOVE CNTLKEY             TO ERR-KEY
422400        PERFORM P9999-GOT-PROBLEM
422500     END-IF
422600     MOVE CNTL-CAN-WRR-FLAG      TO WS-CAN-WRR-FLAG
422700*CNC0598-E
422800     IF P925-EMP-STATUS-NA
422900*       'HOURS OF SERVICE NOT APPLICABLE'
423000        MOVE 'H032'        TO MSGLOG-CODE
423100     ELSE
423200        MOVE SPACES              TO MSGLOG-CODE
423300*CNC0598-B
423400*CNLD-309 B COMMENTING
423400*       IF WS-CAN-WRR-NEW
423400*CNLD-309 E
423500           STRING 'STATUS=(' P925-REST-STATUS-FLAG ') '
423600                  'TTA=' P925-REST-STATUS-TTA ' '
423700                  'ERT=' P925-REST-STATUS-ERT ' '
423800                  'TTW=' P925-REST-STATUS-TTW ' '
423900                  'TTR=' P925-REST-STATUS-TTR ' '
424000                  'TWT=' P925-REST-STATUS-TWT ' '
424100                  DELIMITED BY SIZE
424200                  INTO SCR08Z-ERRORMSG
423400*CNLD-309 B COMMENTING
424300*       ELSE
423400*CNLD-309 E
424400*CNC0598-E
423400
423400*CNLD-309 B COMMENTING
424500*          IF P925-TIE-UP-YARD
424600*             STRING 'YD MTOY=(' EMP-MTOY ') '
424700*                    'STATUS=(' P925-REST-STATUS-FLAG ') '
424800*                    'TTA=' P925-REST-STATUS-TTA ' '
424900*                    'ERT=' P925-REST-STATUS-ERT ' '
425000*                    'TTW=' P925-REST-STATUS-TTW ' '
425100*                    'TTR=' P925-REST-STATUS-TTR ' '
425200*                    'TWT=' P925-REST-STATUS-TWT ' '
425300*                    DELIMITED BY SIZE
425400*                    INTO SCR08Z-ERRORMSG
425500*          ELSE
425600*             STRING 'RD MTOR=(' EMP-MTOR ') '
425700*                    'STATUS=(' P925-REST-STATUS-FLAG ') '
425800*                    'TTA=' P925-REST-STATUS-TTA ' '
425900*                    'ERT=' P925-REST-STATUS-ERT ' '
426000*                    'TTW=' P925-REST-STATUS-TTW ' '
426100*                    'TTR=' P925-REST-STATUS-TTR ' '
426200*                    'TWT=' P925-REST-STATUS-TWT ' '
426300*                    DELIMITED BY SIZE
426400*                    INTO SCR08Z-ERRORMSG
426500*          END-IF
426600**CNC0598-B
426700*       END-IF
426800**CNC0598-E
423400*CNLD-309 E
426900     END-IF
427000     MOVE -1                     TO SCR08Z-FUNC-CURSOR
427100     PERFORM P9000-SEND-MAP-AND-RETURN.
427200*
427300*================================================================*
427400 P4610-GET-HRS-SVC-INFO.
427500*================================================================*
427600     MOVE SPACES                 TO P925-COMMAREA-PARMS
427700     SET P925-CALC-REST-STATUS   TO TRUE
427800     MOVE P08ZCA-EMP-NO          TO P925-EMP-NO
427900     MOVE SCR08Z-DATE            TO P925-OD-DATE
428000*CNLD-207-RRS-B
428100                                    P925-ORDER-DATE
428200*CNLD-207-RRS-E
428300     MOVE SCR08Z-TIME            TO P925-OD-TIME
428400*CNLD-207-RRS-B
428500                                    P925-ORDER-TIME
428600*CNLD-207-RRS-E
428700
428800     MOVE P08CA-PROFILE-KEY      TO TRCNKEY1
428900                                    P925-TRCNKEY1
429000     PERFORM P8000-READ-TRCNKEY1
429100     IF P08ZCA-DHD-HOME
429200        MOVE CRAFT IN WS-MSTR    TO WS-CRAFT-CODE-CHECK
429300     ELSE
429400        MOVE P08ZCA-ASGN-CC      TO WS-CRAFT-CODE-CHECK
429500     END-IF
429600
429700     MOVE WS-CRAFT-CODE-CHECK    TO P925-ASGN-CC
429800
429900     IF ENGINE-CRAFT
430000        IF TRCN-EN-REST-REQ = ('C' OR 'B')
430100           CONTINUE
430200        ELSE
430300           SET P925-EMP-STATUS-NA
430400                                 TO TRUE
430500        END-IF
430600     ELSE
430700        IF TRCN-TR-REST-REQ = ('C' OR 'B')
430800           CONTINUE
430900        ELSE
431000           SET P925-EMP-STATUS-NA
431100                                 TO TRUE
431200        END-IF
431300     END-IF
431400
431500     IF P925-EMP-STATUS-NA
431600        MOVE 'N/A'               TO P925-REST-STATUS-TTA
431700                                    P925-REST-STATUS-TTW
431800                                    P925-REST-STATUS-TTR
431900                                    P925-REST-STATUS-ERT
432000                                    P925-REST-STATUS-TWT
432100     ELSE
432200        MOVE TRCN-JOB-TYPE       TO P925-JOB-TYPE
432300        MOVE WS-TIME-ZONE        TO P925-TIME-ZONE
432400        MOVE TRCN-ORIGIN-STN     TO P925-STATION
432500        IF P08ZCA-DHD-HOME
432600           IF TEMPORARY-ASGNMT > SPACES
432700              IF TEMP-ASGN-AJ
432800                 MOVE TA-1       TO JOB-DEF-CHECK
432900                 IF JOB-DEF-YARD-ASGN
433000                    SET P925-TIE-UP-YARD TO TRUE
433100                 ELSE
433200                    SET P925-TIE-UP-ROAD TO TRUE
433300                 END-IF
433400              ELSE
433500                 SET P925-TIE-UP-ROAD
433600                                 TO TRUE
433700              END-IF
433800           ELSE
433900              IF NORM-ASGN-AJ
434000                 MOVE NA-1       TO JOB-DEF-CHECK
434100                 IF JOB-DEF-YARD-ASGN
434200                    SET P925-TIE-UP-YARD TO TRUE
434300                 ELSE
434400                    SET P925-TIE-UP-ROAD TO TRUE
434500                 END-IF
434600              ELSE
434700                 SET P925-TIE-UP-ROAD
434800                                 TO TRUE
434900              END-IF
435000           END-IF
435100        ELSE
435200           IF P08ZCA-DHD-TYPE = 'A'
435300              MOVE P08ZCA-ASSIGNMENT TO WORK-AJ-KEY
435400              MOVE WORK-AJ-JOB-NO TO JOB-DEF-CHECK
435500              IF JOB-DEF-YARD-ASGN
435600                 SET P925-TIE-UP-YARD TO TRUE
435700              ELSE
435800                 SET P925-TIE-UP-ROAD TO TRUE
435900              END-IF
436000           ELSE
436100              SET P925-TIE-UP-ROAD TO TRUE
436200           END-IF
436300        END-IF
436400        MOVE 'A'                 TO P925-TERM
436500        MOVE TRCN-FNL-STN        TO P925-FINAL-STATION
436600        MOVE TRCN-ROUTE-DESIGNATION TO P925-ROUTE-DESGN
436700        EXEC CICS LINK
436800                  PROGRAM(P925-PGM)
436900                  COMMAREA(P925-COMMAREA-PARMS)
437000                  LENGTH(P925-LGTH)
437100                  RESP(WS-RESPONSE)
437200        END-EXEC
437300        MOVE WS-RESPONSE         TO FILE-STATUS
437400        IF NOT SUCCESS
437500           MOVE 'P4610-1'        TO ERR-PARAGRAPH
437600           MOVE 'P925LINK'       TO ERR-KEY
437700           PERFORM P9999-GOT-PROBLEM
437800        END-IF
437900*CNC0600-B
438000        IF P925-EMP-STATUS-RED
438100           MOVE P925-REASON-FOR-RED TO WS-REASON-FOR-RED
438200           MOVE P925-OVERRIDE-ALLOW-FLAG
438300                                 TO P08ZCA-HOSO-ALLOW-FL
438400           IF P08ZCA-HOSO-DONE
438500              SET P925-EMP-STATUS-YELLOW
438600                                 TO TRUE
438700           END-IF
438800*CNC0600 - RJA - B
438900*CNLD-207-DXC-B
439000        END-IF
439100        MOVE SPACES              TO WS-SAVE-REST-STATUS
      *CNLD-285-B
      * NOTE: CONTROL FLOWS TO THIS POINT ONLY WHEN
      *       TRCN-EN/TR-REST-REQ = ('C' OR 'B')
              MOVE SPACES              TO WS-EMP-UNDST-REST-FLAG
              MOVE ZEROS               TO WS-SAVE-UD-DTTM
      *CNLD-285-E
439200        IF P925-LOCAL-TM-REST-COND > SPACE
439300           IF P925-MTOD-GT-LOCAL
439400*CNLD-207-DXC-E
439500*          LOCAL TIME IS LESS THAN EMPLOYEE'S MTOD
439600              PERFORM P3040-CHECK-EMP-UNDST-REST
439700              IF WS-EMP-UNDST-REST
439800                 MOVE WS-UD-MESG TO SCR08Z-PHONE
439900                 MOVE YELLOW     TO SCR08Z-PHONE-COLOR
                       MOVE RED        TO SCR08Z-NAME-COLOR
440000                 MOVE P925-REST-STATUS-FLAG TO WS-SAVE-REST-STATUS
440100                 SET P925-EMP-STATUS-RED TO TRUE
440200                 SET P925-OVERRIDE-DENY  TO TRUE
440300                 MOVE P925-OVERRIDE-ALLOW-FLAG
440400                                 TO P08ZCA-HOSO-ALLOW-FL
440500              END-IF
440600*CNLD-207-DXC-B
440700           END-IF
234100*CNLD-259 B CNC0600
440800*          IF P925-LOCAL-LT-RESET
440800           IF P925-LOCAL-LE-UDR2
234100*CNLD-259 E CNC0600
440900                 MOVE P925-RB-MSG-1-HRMN(1:2)
441000                                 TO WS-RB-1-HH
441100                 MOVE P925-RB-MSG-1-HRMN(3:2)
441200                                 TO WS-RB-1-MM
441300                 MOVE WS-RB-1-MESG
441400                                 TO SCR08Z-PHONE
441500                 MOVE YELLOW     TO SCR08Z-PHONE-COLOR
441600                 MOVE P925-REST-STATUS-FLAG TO WS-SAVE-REST-STATUS
441700                 SET P925-EMP-STATUS-RED
441800                                 TO TRUE
441900                 SET P925-OVERRIDE-DENY
442000                                 TO TRUE
442100                 MOVE P925-OVERRIDE-ALLOW-FLAG
442200                                 TO P08ZCA-HOSO-ALLOW-FL
442300           END-IF
      *CNLD-244-B #3 CNC0600
442400*          IF P925-ORDR-LT-RESET
442400           IF P925-RESET-IN-LT-1HR
      *CNLD-244-E
442500                    MOVE P925-RB-MSG-2-MN TO WS-RB-2-MM
442600                                             WS-RB-2-MM-1
442700                    MOVE WS-RB-2-MESG     TO SCR08Z-PHONE
442800                    MOVE YELLOW  TO SCR08Z-PHONE-COLOR
443500                    PERFORM P9000-SEND-MAP-AND-RETURN
443600           END-IF
443700*CNLD-207-DXC-E
443800*CNC0600 - RJA - E
443900        END-IF
444000*CNC0600-E
444100*C1193 - BEG
444200*** PER KEVIN,
444300*** "REMOVE THE CODE THAT CAUSES THE SYSTEM TO FLAG SOMEONE WHO IS
444400***  CLOSE TO THE 64/7 CAP AS YELLOW. THIS IS CODE THAT WAS ADDED
444500***  WITH THE INITIAL ENHANCEMENT, BUT IS NOT REQUIRED ANY MORE."
444600***     PERFORM P4612-EXPECTED-ASGN-LENGTH
444700*C1193 - END
444800     END-IF.
444900*================================================================*
445000 P4612-EXPECTED-ASGN-LENGTH.
445100*================================================================*
445200     MOVE P925-REST-STATUS-TWT     TO WRK-TIME
445300     MOVE WRK-HR                   TO WS-TOTAL-HOURS
445400     MOVE WRK-MN                   TO WS-TOTAL-MINUTES
445500
445600     MOVE TRCN-INIT-DH-TIME        TO WRK-TIME
445700
445800     ADD WRK-HR                    TO WS-TOTAL-HOURS
445900     ADD WRK-MN                    TO WS-TOTAL-MINUTES
446000     PERFORM P4616-CALCULATE-64-TIME
446100*** 331E - CHANGE TO YELLOW AT 6401, NOT 6400
446200     IF WS-64-TOT-TIME-ON-DUTY >  6400
446300        SET P925-EMP-STATUS-YELLOW TO TRUE
446400     END-IF.
446500*================================================================*
446600 P4616-CALCULATE-64-TIME.
446700*================================================================*
446800     SET TIME-NOT-DONE             TO TRUE
446900     PERFORM UNTIL TIME-DONE
447000        IF WS-TOTAL-MINUTES > 59
447100           SUBTRACT 60           FROM WS-TOTAL-MINUTES
447200           ADD 1                   TO WS-TOTAL-HOURS
447300        ELSE
447400          SET TIME-DONE            TO TRUE
447500        END-IF
447600     END-PERFORM
447700     MOVE WS-TOTAL-HOURS           TO WS-64-TOT-HRS-ON-DUTY
447800     MOVE WS-TOTAL-MINUTES         TO WS-64-TOT-MNS-ON-DUTY.
447900*
448000*================================================================*
448100 P4700-REJECT-HRS-SVC.
448200*================================================================*
448300*
448400     IF P08ZCA-EMP-NO NOT > SPACES
448500*            'IMPROPER FUNCTION - NO EMPLOYEE PRESENT'
448600        MOVE 'I050'        TO MSGLOG-CODE
448700        MOVE -1            TO SCR08Z-FUNC-CURSOR
448800        MOVE REV-VIDEO     TO SCR08Z-FUNC-HI
448900        PERFORM P9000-SEND-MAP-AND-RETURN
449000     END-IF
449100     MOVE P08ZCA-EMP-NO              TO MSTRNBRK
449200     PERFORM P8500-READ-MASTER
449300
449400     PERFORM P4610-GET-HRS-SVC-INFO
449500     IF NOT P925-EMP-STATUS-YELLOW
449600*            'IMPROPER FUNCTION - NO EMPLOYEE PRESENT'
449700        MOVE 'E238'        TO MSGLOG-CODE
449800        MOVE -1            TO SCR08Z-FUNC-CURSOR
449900        MOVE REV-VIDEO     TO SCR08Z-FUNC-HI
450000        PERFORM P9000-SEND-MAP-AND-RETURN
450100     END-IF
450200     IF P08ZCA-RJHS-EMP-NO NOT > SPACES
450300        MOVE SPACES              TO CNTLKEY-AREA
450400        MOVE '01'                TO CNTL-REC-TYPE
450500        MOVE DIST IN WS-MSTR     TO CNTL-DIST
450600        MOVE CNTLKEY-AREA        TO CNTLKEY
450700        PERFORM P8800-READ-CNTLFILE
450800        IF NOT SUCCESS
450900           MOVE 'P4700-1'        TO ERR-PARAGRAPH
451000           MOVE CNTLKEY          TO ERR-KEY
451100           PERFORM P9999-GOT-PROBLEM
451200        END-IF
451300        IF P925-TIE-UP-YARD
451400           IF RUN-BY-PAY-YD-APPLICABLE
451500              MOVE P08ZCA-EMP-NO TO P08ZCA-RJHS-EMP-NO
451600              MOVE 'Y'           TO P923-RJHS-PAY-FLAG
451700           ELSE
451800              MOVE 'N'           TO P923-RJHS-PAY-FLAG
451900           END-IF
452000        ELSE
452100           IF RUN-BY-PAY-RD-APPLICABLE
452200              MOVE P08ZCA-EMP-NO TO P08ZCA-RJHS-EMP-NO
452300              MOVE 'Y'           TO P923-RJHS-PAY-FLAG
452400           ELSE
452500              MOVE 'N'           TO P923-RJHS-PAY-FLAG
452600           END-IF
452700        END-IF
452800     ELSE
452900        MOVE 'N'                 TO P923-RJHS-PAY-FLAG
453000     END-IF.
453100*
453200 P4800-CREATE-CALLBACK-TASK.
453300*
453400     IF P08ZCA-EMP-NO NOT > '000000000'
453500        MOVE -1                         TO SCR08Z-FUNC-CURSOR
453600*            'IMPROPER FUNCTION - NO EMPLOYEE PRESENT'
453700        MOVE 'I050'                     TO MSGLOG-CODE
453800        PERFORM P9000-SEND-MAP-AND-RETURN
453900     END-IF
454000*
454100*    MAKE SURE NO CALLBACK ALREADY EXISTS FOR THE EMPLOYEE
454200*
454300     MOVE SPACES                        TO WS-TASK
454400     MOVE P08ZCA-EMP-NO                 TO EMP-NBR OF WS-TASK
454500     SET TASK-CALL-BACK                 TO TRUE
454600     MOVE TASK-EMPLOYEE-KEY             TO TASKEMPK
454700     EXEC CICS READ
454800               DATASET(TASK-VIA-EMP-NBR)
454900               INTO(WS-TASK)
455000               LENGTH(TASKENBR-RLGTH)
455100               RIDFLD(TASKEMPK)
455200               KEYLENGTH(TASKENBR-KLGTH)
455300               RESP(WS-RESPONSE)
455400     END-EXEC
455500     MOVE WS-RESPONSE                   TO FILE-STATUS
455600     IF NOT SUCCESS
455700        IF NOT NO-RECORD-FND
455800           MOVE 'P4800-1'               TO ERR-PARAGRAPH
455900           MOVE TASKEMPK                TO ERR-KEY
456000           PERFORM P9999-GOT-PROBLEM
456100        END-IF
456200     ELSE
456300*            'A CALLBACK TASK ALREADY EXISTS FOR THIS EMPLOYEE'
456400        MOVE 'A149'                     TO MSGLOG-CODE
456500        MOVE -1                         TO SCR08Z-FUNC-CURSOR
456600        MOVE REV-VIDEO                  TO SCR08Z-FUNC-HI
456700        PERFORM P9000-SEND-MAP-AND-RETURN
456800     END-IF
456900*
457000*    GET THE EMPLOYEES REQUESTED LEAD TIME
457100*
457200     MOVE SPACES                        TO WS-MSTR
457300     MOVE P08ZCA-EMP-NO                 TO MSTRNBRK
457400     PERFORM P8500-READ-MASTER
457500     MOVE SPACES                        TO PS52-COMMAREA-PARMS
457600     MOVE P08ZCA-EMP-NO                 TO PS52-EMP-NBR
457700     SET PS52-CMA-MODE                  TO TRUE
457800     MOVE WS-LOCAL-DATE-TIME            TO PS52-INPUT-DATE-TIME
457900     PERFORM P8501-LINK-TO-PS52
458000     IF NOT SUCCESS
458100        OR PS52-REQ-LEAD-TIME = '0000'
458200*            'NO SHORT CALL TIME FOUND'
458300        MOVE 'N227'                     TO MSGLOG-CODE
458400        MOVE -1                         TO SCR08Z-FUNC-CURSOR
458500        MOVE REV-VIDEO                  TO SCR08Z-FUNC-HI
458600        PERFORM P9000-SEND-MAP-AND-RETURN
458700     END-IF
458800
458900     MOVE SPACES                        TO P927-COMMAREA-PARMS
459000     SET P927-CALLBACK-FUNCTION         TO TRUE
459100     MOVE ZEROS                         TO DATE-CONVERSION-PARMS
459200     SET PARM-SUBTRACT                  TO TRUE
459300     MOVE P08ZCA-EFF-DATE               TO PARM-PRI-DATE-GREG
459400     MOVE P08ZCA-EFF-HRMN               TO PARM-PRI-HRMN
459500     IF  PS52-REQ-LEAD-TIME > SPACES
459600     AND PS52-REQ-LEAD-TIME > '0000'
459700        IF  PS52-REQ-CALL-TIME > SPACES
459800        AND PS52-REQ-LEAD-TIME > '0000'
459900           IF PS52-REQ-CALL-TIME > PS52-REQ-LEAD-TIME
460000              MOVE PS52-REQ-LEAD-TIME   TO PARM-SEC-HRMN
460100           ELSE
460200              MOVE PS52-REQ-CALL-TIME   TO PARM-SEC-HRMN
460300           END-IF
460400        ELSE
460500           MOVE PS52-REQ-LEAD-TIME      TO PARM-SEC-HRMN
460600        END-IF
460700     ELSE
460800        MOVE PS52-REQ-CALL-TIME         TO PARM-SEC-HRMN
460900     END-IF
461000     EXEC CICS LINK
461100               PROGRAM(P903-PGM)
461200               COMMAREA(DATE-CONVERSION-PARMS)
461300               LENGTH(P903-LGTH)
461400               RESP(WS-RESPONSE)
461500     END-EXEC
461600     MOVE WS-RESPONSE                   TO FILE-STATUS
461700     IF NOT SUCCESS
461800        MOVE 'P4800-2'                  TO ERR-PARAGRAPH
461900        MOVE DATE-CONVERSION-PARMS      TO ERR-KEY
462000        PERFORM P9999-GOT-PROBLEM
462100     END-IF
462200     MOVE PARM-RES-DATE-GREG            TO P927-EFF-DATE
462300     MOVE PARM-RES-HRMN                 TO P927-EFF-TIME
462400     MOVE WS-TIME-ZONE                  TO P927-TIME-ZONE
462500     MOVE P08CA-PROFILE-KEY             TO TRCNKEY1
462600     PERFORM P8000-READ-TRCNKEY1
462700     MOVE TRCN-DIST                     TO P927-DIST
462800     MOVE TRCN-SDIST                    TO P927-SUB-DIST
462900     MOVE P08ZCA-EMP-NO                 TO P927-CB-EMP-NBR
463000     MOVE TRCN-ORIGIN-STN               TO P927-CB-ORG-STATION
463100     MOVE SCR08Z-CODE                   TO P927-CB-TRAIN
463200     MOVE P08ZCA-EFF-TIME               TO P927-CB-ORDER-DATE-TIME
463300     EXEC CICS LINK
463400               PROGRAM(P927-PGM)
463500               COMMAREA(P927-COMMAREA-PARMS)
463600               LENGTH(P927-LGTH)
463700               RESP(WS-RESPONSE)
463800     END-EXEC
463900     MOVE WS-RESPONSE                   TO FILE-STATUS
464000     IF NOT SUCCESS
464100        MOVE 'P4800-3'                  TO ERR-PARAGRAPH
464200        PERFORM P9999-GOT-PROBLEM
464300     END-IF
464400*
464500*         'CALLBACK LOGGED - PLEASE PUT EMPLOYEE ON DUTY'
464600     MOVE 'C228'                        TO MSGLOG-CODE
464700     MOVE -1                            TO SCR08Z-FUNC-CURSOR
464800     MOVE REV-VIDEO                     TO SCR08Z-FUNC-HI
464900*
465000*    WRITE WORK HISTORY FOR CALLBACK
465100*
465200     MOVE SPACES                        TO P943-COMMAREA-PARMS
465300     SET P943-EMPLOYEE-FUNCTION         TO TRUE
465400     SET P943-CALLBACK-FUN              TO TRUE
465500     MOVE P08ZCA-EMP-NO                 TO P943-EMP-NBR
465600     MOVE DIST      OF WS-MSTR          TO P943-DIST
465700     MOVE SUB-DIST  OF WS-MSTR          TO P943-SDIST
465800     MOVE CRAFT     OF WS-MSTR          TO P943-CRAFT
465900     MOVE SCR08Z-CODE(1:6)              TO P943-NORM-ASGN
466000     MOVE SCR08Z-CODE-CC                TO P943-NORM-ASGN-CC
466100     MOVE P927-EFF-DATE-TIME            TO P943-EFF-DATE-TIME
466200     MOVE WS-TIME-ZONE                  TO P943-EMP-TIME-ZONE
466300
466400     EXEC CICS ASSIGN
466500               USERID(P943-USERID)
466600     END-EXEC
466700
466800     EXEC CICS LINK
466900               PROGRAM(P943-PGM)
467000               COMMAREA(P943-COMMAREA-PARMS)
467100               LENGTH(P943-LGTH)
467200               RESP(WS-RESPONSE)
467300     END-EXEC
467400     MOVE WS-RESPONSE                   TO FILE-STATUS
467500     IF NOT SUCCESS
467600        MOVE 'P4800-4'                  TO ERR-PARAGRAPH
467700        MOVE 'P943'                     TO ERR-KEY
467800        PERFORM P9999-GOT-PROBLEM
467900     END-IF
468000*#1501
468100*
468200*    RESET THE EMPLOYEE'S SHORT CALL LEAD TIME
468300*
468400     PERFORM P6000-CLEAR-SHORT-CALL
468500     .
468600*================================================================*
468700 P4900-DISPLAY-HOS-INFO.
468800*================================================================*
468900*
469000     IF P08ZCA-EMP-NO NOT > SPACES
469100*            'IMPROPER FUNCTION - NO EMPLOYEE PRESENT'
469200        MOVE 'I050'        TO MSGLOG-CODE
469300        MOVE -1            TO SCR08Z-FUNC-CURSOR
469400        MOVE REV-VIDEO     TO SCR08Z-FUNC-HI
469500        PERFORM P9000-SEND-MAP-AND-RETURN
469600     END-IF
469700
469800     INITIALIZE PS94-COMMAREA-PARMS
469900     SET PS94-SUM-FUNC           TO TRUE
470000     MOVE P08ZCA-EMP-NO          TO PS94-EMP-NBR
470100     MOVE WS-LOCAL-DATE-TIME     TO PS94-HSL-EVENT-STRT-TS-DTTM
470200                                    PS94-HSL-EVENT-END-TS-DTTM
470300     MOVE WS-TIME-ZONE           TO PS94-TIME-ZONE
470400     PERFORM P9400-CALL-PS94-PROGRAM
470500     MOVE PS94-MTD-TOTAL-TM      TO WS-MISC-TOT-TM
470600     MOVE PS94-MTD-LIMBO-TM      TO WS-MISC-LIMBO-TM
470700     MOVE PS94-CONSECUTIVE-STARTS TO
470800                                    WS-MISC-CONSEC-STARTS
470900     IF P925-EMP-STATUS-NA
471000*       'HOURS OF SERVICE NOT APPLICABLE'
471100        MOVE 'H032'        TO MSGLOG-CODE
471200     ELSE
471300        MOVE SPACES        TO MSGLOG-CODE
471400        STRING 'HOS INFO : '
471500               'TOTAL(' WS-TOT-TM2(1:3) ':' WS-TOT-TM2(4:2) ') '
471600               'LIMBO(' WS-LIMBO-TM2(1:3) ':' WS-LIMBO-TM2(4:2)')'
471700               ' STARTS(' WS-CONSEC-STARTS ')'
471800                DELIMITED BY SIZE
471900                  INTO SCR08Z-ERRORMSG
472000     END-IF
472100     MOVE -1               TO SCR08Z-FUNC-CURSOR
472200     PERFORM P9000-SEND-MAP-AND-RETURN.
472300*
472400 P5000-LINK-TO-947.
472500*
472600     EXEC CICS LINK
472700               PROGRAM(P947-PGM)
472800               COMMAREA(P947-COMMAREA-PARMS)
472900               LENGTH(P947-LGTH)
473000               RESP(WS-RESPONSE)
473100     END-EXEC
473200     MOVE WS-RESPONSE       TO FILE-STATUS
473300     IF NOT SUCCESS
473400        MOVE 'P5000-1'      TO ERR-PARAGRAPH
473500        MOVE 'LINK947'      TO ERR-KEY
473600        PERFORM P9999-GOT-PROBLEM
473700     END-IF.
473800*
473900 P5100-PROCESS-IVR-CALL.
474000*
474100     PERFORM P5110A-IVR-CALL-EDITS
474200     PERFORM P4100-PROCESS-CALL-FUNCTION
474300     PERFORM P5150-CREATE-UPDATE-TASK
474400     PERFORM P5160-CREATE-UPDATE-VRU-INFO
474500     PERFORM P5170-SETUP-P0ESCOMM
474600     PERFORM P5180-LINK-TO-0ES
474700     PERFORM P5190-WRITE-VCLL-HISTORY
474800*#1501
474900*
475000*    RESET THE EMPLOYEE'S SHORT CALL LEAD TIME
475100*
475200*C1194 - BEG
475300***  IF P08ZCA-SAVE-CBCK-FLAG = 'Y'
475400***     PERFORM P6000-CLEAR-SHORT-CALL
475500***  END-IF
475600*C1194 - END
475700     .
475800*
475900 P5110-IVR-PFKEY-EDITS.
476000*
476100     MOVE SPACES                        TO WS-IVR-CALL-PROF
476200     SET  P08CA-IVR-CALL-NOT-ACTIVE     TO TRUE
476300     PERFORM P5111-COMPANY-EDIT
476400     IF CNTL-OUTBND-IVR-CALL-ACTIVE
476500        PERFORM P5112-SUB-DIST-EDIT
476600        IF CNTL-2B-IVR-CALL-FL           = 'Y'
476700           PERFORM P5113-IVR-CALL-PROFILE-EDIT
476800        END-IF
476900     END-IF
477000     .
477100*
477200 P5110A-IVR-CALL-EDITS.
477300*
477400
477500     MOVE SPACES                        TO WS-IVR-CALL-PROF
477600     SET  P08CA-IVR-CALL-NOT-ACTIVE     TO TRUE
477700     PERFORM P5111-COMPANY-EDIT
477800     IF CNTL-OUTBND-IVR-CALL-ACTIVE
477900        PERFORM P5112-SUB-DIST-EDIT
478000        IF CNTL-2B-IVR-CALL-FL           = 'Y'
478100           PERFORM P5113-IVR-CALL-PROFILE-EDIT
478200           PERFORM P5114-EMP-EDITS
478300        END-IF
478400     END-IF
478500
478600     .
478700*
478800 P5111-COMPANY-EDIT.
478900*
479000     MOVE SPACES                        TO WS-CNTL-FILE
479100     SET  COMPANY-TYPE-REC              TO TRUE
479200     MOVE CNTLKEY-AREA                  TO WORK-CNTLKEY
479300     PERFORM P8610-READ-CNTLFILE
479400     IF  SUCCESS
479500     AND COMPANY-TYPE-REC
479600     AND CNTL-OUTBND-IVR-CALL-ACTIVE
479700        CONTINUE
479800     ELSE
479900        MOVE SPACES                     TO WS-CNTL-FILE
480000     END-IF
480100     .
480200*
480300 P5112-SUB-DIST-EDIT.
480400*
480500     MOVE SPACES                        TO WS-CNTL-FILE
480600     SET  SUB-DIST-TYPE-2B-REC          TO TRUE
480700*#1448
480800     MOVE TRCN-DIST                     TO CNTL-DIST
480900     MOVE TRCN-SDIST                    TO CNTL-SUB-DIST
481000     MOVE CNTLKEY-AREA                  TO WORK-CNTLKEY
481100     PERFORM P8610-READ-CNTLFILE
481200     IF  SUCCESS
481300     AND CNTL-2B-IVR-CALL-FL             = 'Y'
481400        MOVE CNTL-2B-IVR-CALL-PROF      TO WS-IVR-CALL-PROF
481500     END-IF
481600     .
481700*
481800 P5113-IVR-CALL-PROFILE-EDIT.
481900*
482000     MOVE P08CA-PROFILE-KEY             TO TRCNKEY1
482100     PERFORM P8000-READ-TRCNKEY1
482200     IF TRCN-IVR-CALL-PROF               > SPACES
482300        MOVE TRCN-IVR-CALL-PROF         TO WS-IVR-CALL-PROF
482400     END-IF
482500
482600     IF WS-IVR-CALL-PROF                 > SPACES
482700*    CHECK IF THE IVR CALL PROFILE IS ACTIVE
482800        MOVE SPACES                     TO CNTLKEY-AREA
482900        SET  IVR-CALL-PROFILE-REC       TO TRUE
483000        MOVE WS-IVR-CALL-PROF           TO CNTL-IVR-CALL-PROF
483100        MOVE CNTLKEY-AREA               TO WORK-CNTLKEY
483200        PERFORM P8610-READ-CNTLFILE
483300        IF  SUCCESS
483400        AND CNTL-IVR-CALL-ACTIVE
483500           SET  P08CA-IVR-CALL-ACTIVE   TO TRUE
483600        ELSE
483700           MOVE SPACES                  TO WS-IVR-CALL-PROF
483800        END-IF
483900     END-IF
484000     .
484100*
484200 P5114-EMP-EDITS.
484300*
484400     MOVE P08ZCA-EMP-NO                 TO MSTRNBRK
484500     PERFORM P8500-READ-MASTER
484600
484700     MOVE SPACE                         TO WS-SHORT-CALL-REQ
484800*    READ TELE VIA PS52
484900     MOVE SPACES                        TO PS52-COMMAREA-PARMS
485000     MOVE EMP-NBR OF WS-MSTR            TO PS52-EMP-NBR
485100     SET PS52-CMA-MODE                  TO TRUE
485200     SET PS52-DISPLAY-ONLY              TO TRUE
485300     MOVE WS-LOCAL-DATE-TIME            TO PS52-INPUT-DATE-TIME
485400     PERFORM P8501-LINK-TO-PS52
485500     IF NOT SUCCESS
485600        MOVE 'P5110A-1'                 TO ERR-PARAGRAPH
485700        PERFORM P9999-GOT-PROBLEM
485800     END-IF
485900
486000     MOVE SPACE                         TO WS-SHORT-FLAG
486100     IF (PS52-REQ-LEAD-TIME     > SPACES
486200        AND PS52-REQ-LEAD-TIME  > '0000')
486300        MOVE PS52-REQ-LEAD-TIME         TO WS-SHORT-CALL-REQ
486400        SET WS-SHORT-LEAD               TO TRUE
486500     END-IF
486600     IF (PS52-REQ-CALL-TIME     > SPACES
486700        AND PS52-REQ-CALL-TIME  > '0000')
486800        IF WS-SHORT-CALL-REQ   = SPACES
486900           MOVE PS52-REQ-CALL-TIME      TO WS-SHORT-CALL-REQ
487000           SET WS-SHORT-CALL            TO TRUE
487100        ELSE
487200           IF PS52-REQ-CALL-TIME < WS-SHORT-CALL-REQ
487300              MOVE PS52-REQ-CALL-TIME   TO WS-SHORT-CALL-REQ
487400              SET WS-SHORT-CALL         TO TRUE
487500           END-IF
487600        END-IF
487700     END-IF
487800* #1529
487900     IF NOT DEADHEAD-HOME
488000        IF P08ZCA-EMP-NO               > ZEROES
488100           MOVE SPACE                 TO WS-EMP-RESTED-FLAG
488200           MOVE SCR08Z-DATE           TO WORK-DATE
488300           MOVE SCR08Z-TIME           TO WORK-TIME
488400           IF P08ZCA-LEAD-TIME > '0000'
488500              MOVE ZEROS         TO DATE-CONVERSION-PARMS
488600              SET PARM-SUBTRACT  TO TRUE
488700              MOVE SCR08Z-DATE   TO PARM-PRI-DATE-GREG
488800              MOVE SCR08Z-TIME   TO PARM-PRI-HRMN
488900              MOVE P08ZCA-LEAD-TIME TO PARM-SEC-HRMN
489000              EXEC CICS LINK
489100                        PROGRAM(P903-PGM)
489200                        COMMAREA(DATE-CONVERSION-PARMS)
489300                        LENGTH(P903-LGTH)
489400                        RESP(WS-RESPONSE)
489500              END-EXEC
489600              MOVE WS-RESPONSE   TO FILE-STATUS
489700              IF NOT SUCCESS
489800                 MOVE 'P4210-5'  TO ERR-PARAGRAPH
489900                 MOVE 'P903LINK' TO ERR-KEY
490000                 PERFORM P9999-GOT-PROBLEM
490100              END-IF
490200              MOVE PARM-RES-DATE-GREG TO WS-CALL-ML-DATE
490300              MOVE PARM-RES-HRMN TO WS-CALL-ML-TIME
490400           ELSE
490500              MOVE SCR08Z-DATE   TO WS-CALL-ML-DATE
490600              MOVE SCR08Z-TIME   TO WS-CALL-ML-TIME
490700           END-IF
490800
490900           MOVE P08ZCA-ASGN-CC        TO WS-CRAFT-CODE-CHECK
491000           IF ENGINE-CRAFT
491100              IF TRCN-EN-REST-REQ = ('C' OR 'B')
491200*                CHECK MANDITORY REST
491300                 IF EMP-MTOD > WS-CALL-MINUS-LEAD
491400                    SET WS-EMP-RESTED-NO TO TRUE
491500                 END-IF
491600                 IF P08ZCA-SHORTCALL-DATE-TIME > SPACES
491700                    IF P08ZCA-LEAD-TIME > '0000'
491800*                      IF WS-SHORT-LEAD
491900                       IF  EMP-MTOD NOT
492000                                     > P08ZCA-SHORTCALL-DATE-TIME
492100                          SET WS-EMP-RESTED-YES TO TRUE
492200                       ELSE
492300                          SET WS-EMP-RESTED-NO  TO TRUE
492400                       END-IF
492500                    ELSE
492600                       IF EMP-MTOD > P08ZCA-SHORTCALL-DATE-TIME
492700                          SET WS-EMP-RESTED-NO TO TRUE
492800                       END-IF
492900                    END-IF
493000                 END-IF
493100              END-IF
493200              IF TRCN-EN-REST-REQ = ('U' OR 'B')
493300*                CHECK UDR (US DOMICILED REST)
493400                 IF EMP-US-RSTD > WS-CALL-MINUS-LEAD
493500                    SET WS-EMP-RESTED-NO TO TRUE
493600                 END-IF
493700                 IF P08ZCA-SHORTCALL-DATE-TIME > SPACES
493800                    IF P08ZCA-LEAD-TIME > '0000'
493900*                      IF WS-SHORT-LEAD
494000                       IF  EMP-US-RSTD NOT
494100                                     > P08ZCA-SHORTCALL-DATE-TIME
494200                          SET WS-EMP-RESTED-YES TO TRUE
494300                       ELSE
494400                          SET WS-EMP-RESTED-NO  TO TRUE
494500                       END-IF
494600                    ELSE
494700                       IF EMP-US-RSTD
494800                                   > P08ZCA-SHORTCALL-DATE-TIME
494900                          SET WS-EMP-RESTED-NO TO TRUE
495000                       END-IF
495100                    END-IF
495200                 END-IF
495300              END-IF
495400           ELSE
495500              IF TRCN-TR-REST-REQ = ('C' OR 'B')
495600*                CHECK MANDITORY REST
495700                 IF EMP-MTOD > WS-CALL-MINUS-LEAD
495800                    SET WS-EMP-RESTED-NO TO TRUE
495900                 END-IF
496000                 IF P08ZCA-SHORTCALL-DATE-TIME > SPACES
496100                    IF P08ZCA-LEAD-TIME > '0000'
496200*                      IF WS-SHORT-LEAD
496300                       IF  EMP-MTOD NOT
496400                                     > P08ZCA-SHORTCALL-DATE-TIME
496500                          SET WS-EMP-RESTED-YES TO TRUE
496600                       ELSE
496700                          SET WS-EMP-RESTED-NO  TO TRUE
496800                       END-IF
496900                    ELSE
497000                       IF EMP-MTOD > P08ZCA-SHORTCALL-DATE-TIME
497100                          SET WS-EMP-RESTED-NO TO TRUE
497200                       END-IF
497300                    END-IF
497400                 END-IF
497500              END-IF
497600              IF TRCN-TR-REST-REQ = ('U' OR 'B')
497700*                CHECK UDR (US DOMICILED REST)
497800                 IF EMP-US-RSTD > WS-CALL-MINUS-LEAD
497900                    SET WS-EMP-RESTED-NO TO TRUE
498000                 END-IF
498100                 IF P08ZCA-SHORTCALL-DATE-TIME > SPACES
498200                    IF P08ZCA-LEAD-TIME > '0000'
498300*                      IF WS-SHORT-LEAD
498400                       IF  EMP-US-RSTD NOT
498500                                     > P08ZCA-SHORTCALL-DATE-TIME
498600                          SET WS-EMP-RESTED-YES TO TRUE
498700                       ELSE
498800                          SET WS-EMP-RESTED-NO  TO TRUE
498900                       END-IF
499000                    ELSE
499100                       IF EMP-US-RSTD
499200                                   > P08ZCA-SHORTCALL-DATE-TIME
499300                          SET WS-EMP-RESTED-NO TO TRUE
499400                       END-IF
499500                    END-IF
499600                 END-IF
499700              END-IF
499800           END-IF
499900
500000           IF WS-EMP-RESTED-NO
500100              MOVE -1                 TO SCR08Z-FUNC-CURSOR
500200              MOVE REV-VIDEO          TO SCR08Z-FUNC-HI
500300*          'USE OF IVR CALL NOT ALLOWED - EMPLOYEE UNDER UDR/MAND'
500400              MOVE 'U154'             TO MSGLOG-CODE
500500              PERFORM P9000-SEND-MAP-AND-RETURN
500600           END-IF
500700* #1529
500800           IF EMP-PERS-REST-NUM > ZEROES
500900              IF EMP-PERS-REST-NUM > WS-CALL-MINUS-LEAD
501000                 SET WS-EMP-RESTED-NO TO TRUE
501100              END-IF
501200              IF P08ZCA-SHORTCALL-DATE-TIME > SPACES
501300                 IF P08ZCA-LEAD-TIME > '0000'
501400*                   IF WS-SHORT-LEAD
501500                    IF  EMP-PERS-REST-NUM NOT
501600                                  > P08ZCA-SHORTCALL-DATE-TIME
501700                       SET WS-EMP-RESTED-YES TO TRUE
501800                    ELSE
501900                       SET WS-EMP-RESTED-NO  TO TRUE
502000                    END-IF
502100                 ELSE
502200                    IF EMP-PERS-REST-NUM
502300                                > P08ZCA-SHORTCALL-DATE-TIME
502400                       SET WS-EMP-RESTED-NO TO TRUE
502500                    END-IF
502600                 END-IF
502700              END-IF
502800           END-IF
502900           IF WS-EMP-RESTED-NO
503000              MOVE -1                 TO SCR08Z-FUNC-CURSOR
503100              MOVE REV-VIDEO          TO SCR08Z-FUNC-HI
503200*              'USE OF IVR CALL NOT ALLOWED - EMP UNDER PERS REST'
503300              MOVE 'U156'             TO MSGLOG-CODE
503400              PERFORM P9000-SEND-MAP-AND-RETURN
503500           END-IF
503600        END-IF
503700     END-IF
503800
503900*    ENSURE EMPLOYEE IS AT HOME AND NOTIFIED
504000*    IF P08ZCA-EMP-NO                    > ZEROES
504100*       MOVE SPACES                     TO WS-MSTR
504200*       MOVE P08ZCA-EMP-NO              TO MSTRNBRK
504300*       PERFORM P8500-READ-MASTER
504400*       IF NOT NORMAL
504500*          MOVE -1                      TO SCR08Z-FUNC-CURSOR
504600*          MOVE REV-VIDEO               TO SCR08Z-FUNC-HI
504700**              'IVR CALL NOT ALLOWED - EMPLOYEE STATUS IS XX'
504800*          MOVE 'I592'                  TO MSGLOG-CODE
504900*          PERFORM P9000-SEND-MAP-AND-RETURN
505000*       END-IF
505100*    END-IF
505200     .
505300*
505400 P5150-CREATE-UPDATE-TASK.
505500*
505600     MOVE SPACES                        TO P927-COMMAREA-PARMS
505700     SET  P927-IVR-CALL-FUNCTION        TO TRUE
505800     MOVE WS-PRESENT-TIME               TO P927-EFF-DATE-TIME
505900     MOVE SCR08Z-DATE                   TO P927-CALL-DATE
506000     MOVE SCR08Z-TIME                   TO P927-CALL-TIME
506100*#1490
506200*    IF P08ZCA-SHORTCALL-DATE > SPACES
506300*       MOVE P08ZCA-SHORTCALL-DATE      TO P927-CALL-DATE
506400*       MOVE P08ZCA-SHORTCALL-TIME      TO P927-CALL-TIME
506500*    END-IF
506600*#1448
506700     MOVE TRCN-DIST                     TO P927-DIST
506800     MOVE TRCN-SDIST                    TO P927-SUB-DIST
506900     MOVE SPACES                        TO CNTLKEY-AREA
507000     SET SUB-DIST-TYPE-REC              TO TRUE
507100     MOVE TRCN-DIST                     TO CNTL-DIST
507200     MOVE TRCN-SDIST                    TO CNTL-SUB-DIST
507300     MOVE CNTLKEY-AREA                  TO CNTLKEY
507400     PERFORM P8800-READ-CNTLFILE
507500     IF SUCCESS
507600        MOVE CNTL-TIME-ZONE             TO P927-TIME-ZONE
507700     ELSE
507800        MOVE WS-TIME-ZONE               TO P927-TIME-ZONE
507900     END-IF
508000     SET  P927-CREATE-CALL              TO TRUE
508100     MOVE TRCN-ASGN-TYPE                TO P927-CALL-ASGN-TYPE
508200     MOVE TRCN-DEP-STN                  TO P927-CALL-ORG-STATION
508300*    MOVE P08ZCA-ASSIGNMENT             TO P927-TRAIN
508400     MOVE 'O'                           TO P927-CALL-TYPE
508500     MOVE TRCN-FORMAT-TYPE              TO P927-CALL-TRAIN-TYPE
508600     MOVE TRCN-DEP-DIR                  TO P927-DIRECTION
508700*    MOVE SCR08Z-FUNC                   TO WS-FUNCTION-CODE
508800*    IF IVR-CALL-FUNCTION
508900*       IF P08ZCA-DHD-HOME
509000*          MOVE SCR08Z-CRAFT            TO P927-CALL-INFO (1:2)
509100*       ELSE
509200*          MOVE P08ZCA-ASGN-CC          TO P927-CALL-INFO (1:2)
509300*       END-IF
509400*    END-IF
509500     MOVE 'N'                           TO TASK-TRAIN-DELAYED
509600     MOVE TRCN-TRAIN-ASGN               TO P927-TRCN-TRAIN-ASGN
509700     MOVE TRCN-FNL-STN                  TO P927-CALL-FNL-STATION
509800     MOVE TRCN-JOB-TYPE                 TO P927-CALL-JOB-TYPE
509900     MOVE SCR08Z-MODE              TO P927-MODE-OF-TRANSPORTATION
510000*
510100* 08/06 JES
510200     MOVE SCR08Z-CODE              TO P927-TRAIN
510300     MOVE P08CA-PROFILE-KEY        TO P927-CALL-INFO
510400*    NEW FIELDS
510500     IF NOT P08ZCA-DHD-HOME
510600        PERFORM P7000-FIND-ASGN-CLASS
510700     END-IF
510800     MOVE WS-ASGN-MERG-CLASS       TO P927-ASGN-MERG-CLASS
510900     MOVE P925-REST-STATUS-FLAG    TO P927-REST-STATUS-FLAG
511000     MOVE P08ZCA-DHD-TYPE          TO P927-DHD-TYPE
511100     MOVE P08ZCA-ASSIGNMENT        TO P927-DHD-ASSIGNMENT
511200     MOVE SCR08Z-FURTHER-N         TO P927-DHD-FURTHER-N
511300     IF SCR08Z-FURTHER-N NOT = 'Y'
511400        IF P08ZCA-DEC-FURTHER-N  = 'Y'
511500           MOVE P08ZCA-DEC-FURTHER-N TO P927-DHD-FURTHER-N
511600        END-IF
511700     END-IF
511800     MOVE SCR08Z-HRMN              TO P927-DHD-DURATION
511900     MOVE SCR08Z-FUNC              TO P927-DHD-FUNC
512000     MOVE P08ZCA-EMP-NO            TO P927-DHD-EMP-NBR
512100     MOVE P08ZCA-FASTSLOW-BOARD    TO P927-DHD-FASTSLOW-BOARD
512200     MOVE SCR08Z-MILES             TO P927-DHD-MILES
512300     MOVE P08ZCA-RJHS-EMP-NO       TO P927-DHD-RJHS-EMPNO
512400     MOVE P08ZCA-LEAD-TIME         TO P927-DHD-LEAD-TIME
512500     MOVE PSTCA-SUB                TO P927-DHD-SUB
512600
512700*?*  IF WS-FROM-IVR
512800*?*     MOVE WS-FROM-IVR-ABEND-FLAG    TO P927-FROM-IVR-ABEND-FLAG
512900*?*     MOVE WS-FROM-IVR-INFO           TO P927-FROM-VRU-INFO
513000*?*  END-IF
513100
513200     EXEC CICS LINK
513300               PROGRAM (P927-PGM)
513400               COMMAREA(P927-COMMAREA-PARMS)
513500               LENGTH  (P927-LGTH)
513600               RESP    (WS-RESPONSE)
513700     END-EXEC
513800     MOVE WS-RESPONSE                   TO FILE-STATUS
513900
514000     IF NOT SUCCESS
514100*    OR P927-IVR-ABEND
514200        MOVE 'P5155-1'                  TO ERR-PARAGRAPH
514300        MOVE TASKTIME                   TO ERR-KEY
514400*       IF P927-IVR-ABEND
514500*          SET  WS-IVR-ABEND            TO TRUE
514600*       END-IF
514700        PERFORM P9999-GOT-PROBLEM
514800     ELSE
514900        MOVE P927-TASK-KEY              TO P08CA-TASK-KEY
515000                                           HOLD-TASK-KEY
515100
515200*       IF P08CA-PRE-CALL-TOC-KEY > SPACES
515300*          INITIALIZE WS-TOC-STORAGE
515400*          MOVE P08CA-PRE-CALL-TOC-KEY  TO TOC-TASK-KEY
515500*          PERFORM PSQL-TOCSEL01
515600*          IF SQL-SUCCESS
515700*             MOVE HOLD-TASK-KEY        TO TOC-TASK-KEY
515800*             PERFORM PSQL-TOCINS01
515900*             MOVE P08CA-PRE-CALL-TOC-KEY TO TOC-TASK-KEY
516000*             PERFORM PSQL-TOCDEL01
516100*          END-IF
516200*       END-IF
516300     END-IF
516400     .
516500*
516600 P5160-CREATE-UPDATE-VRU-INFO.
516700*
516800     MOVE SPACES                        TO VRUINFO-FILE
516900     MOVE HOLD-TASK-KEY                 TO VRUINFO-TASK-KEY
517000
517100     PERFORM P9310-READ-UPDATE-VRUINFO
517200     EVALUATE TRUE
517300        WHEN SUCCESS
517400             MOVE P08ZCA-EMP-NO         TO VRUINFO-EMP-NBR(1)
517500             SET  EMP-UNDER-VRU-CONTROL(1) TO TRUE
517600*            IF SCR08Z-FUNC              = 'VCLL'
517700             MOVE SCR08Z-FUNC           TO WS-FUNCTION-CODE
517800             IF IVR-CALL-FUNCTION
517900                MOVE SPACES  TO VRUINFO-CALL-STATUS-FLAG(1)
518000             END-IF
518100*#1447
518200             IF P08ZCA-SAVE-CBCK-FLAG     = 'Y'
518300                SET VRU-SHORT-CALLED(1)  TO TRUE
518400             END-IF
518500             PERFORM P9320-REWRITE-VRUINFO
518600        WHEN NO-RECORD-FND
518700             PERFORM P5167-WRITE-VRU-INFO
518800        WHEN OTHER
518900             CONTINUE
519000     END-EVALUATE
519100     EXEC CICS UNLOCK
519200               DATASET(VRU-INFO-FILE)
519300               RESP(WS-RESPONSE)
519400     END-EXEC
519500     .
519600*
519700 P5167-WRITE-VRU-INFO.
519800*
519900     MOVE SPACES                        TO VRUINFO-FILE
520000*                                          WS-FULL-CREW-EMP-NO
520100     MOVE HOLD-TASK-KEY                 TO VRUINFO-TASK-KEY
520200     MOVE HOLD-TASK-KEY(1:14)           TO VRUINFO-EFF-DTTM-CE
520300
520400     MOVE P08ZCA-EMP-NO                 TO VRUINFO-EMP-NBR(1)
520500*                                          WS-FULL-CREW-EMP-NO
520600     IF P08ZCA-DHD-HOME
520700        MOVE SCR08Z-CRAFT               TO VRUINFO-CRAFT  (1)
520800     ELSE
520900        MOVE P08ZCA-ASGN-CC             TO VRUINFO-CRAFT  (1)
521000     END-IF
521100     SET  EMP-UNDER-VRU-CONTROL(1)      TO TRUE
521200     MOVE SCR08Z-SEL-DIST               TO VRUINFO-XFER-DD(1)
521300     MOVE SCR08Z-SEL-SDIST              TO VRUINFO-XFER-SD(1)
521400*    MOVE WS-AHIST-KEY                  TO VRUINFO-AHIST-KEY
521500*    IF WS-FULL-CREW-EMP-NO              > SPACES
521600*       INITIALIZE WS-LVE-TABLE
521700*       MOVE WS-FULL-CREW-EMP-NO        TO LVE-EMP-NBR
521800*       PERFORM PSQL-LVESEL01
521900*       IF SQL-SUCCESS
522000*          IF LVE-FCLTY-CD             > SPACES
522100*             INITIALIZE WS-LVP-TABLE
522200*             MOVE LVE-LDG-STN          TO LVP-LDG-STN
522300*             MOVE LVE-FCLTY-CD         TO LVP-FCLTY-CD
522400*             PERFORM PSQL-LVPSEL08
522500*             IF SQL-SUCCESS
522600*                MOVE LVP-FULL-CREW-ACCPT-FL
522700*                                    TO VRUINFO-FULL-CREW-ACCPT-FL
522800*             END-IF
522900*          END-IF
523000*       END-IF
523100*    END-IF
523200
523300     SET  VRU-REQUIRED-CRAFT(1)      TO TRUE
523400*#1447
523500     IF P08ZCA-SAVE-CBCK-FLAG     = 'Y'
523600        SET VRU-SHORT-CALLED(1)      TO TRUE
523700     END-IF
523800
523900     EXEC CICS WRITE
524000               DATASET(VRU-INFO-FILE)
524100               FROM   (VRUINFO-FILE)
524200               LENGTH (VRU-INFO-TERM-RLGTH)
524300               RIDFLD (VRUINFOKEY)
524400               RESP   (WS-RESPONSE)
524500     END-EXEC
524600     MOVE WS-RESPONSE                 TO FILE-STATUS
524700     IF NOT SUCCESS
524800        MOVE 'P5167-1'                TO ERR-PARAGRAPH
524900        MOVE VRUINFOKEY               TO ERR-KEY
525000        PERFORM P9999-GOT-PROBLEM
525100     END-IF
525200     .
525300*
525400 P5170-SETUP-P0ESCOMM.
525500*
525600     MOVE HOLD-TASK-KEY               TO TASK-LOCATION-KEY
525700                                         TASKTIME
525800     PERFORM P8300-READ-TASK-BY-TIME
525900     IF NOT SUCCESS
526000        MOVE 'P5170-1'                  TO ERR-PARAGRAPH
526100        PERFORM P9999-GOT-PROBLEM
526200     END-IF
526300     MOVE SPACES                      TO P0ES-COMMAREA-PARMS
526400     SET  P0ES-CALL-TO-SERVICE        TO TRUE
526500     SET  P0ES-FIRST-TIME-CALL        TO TRUE
526600     MOVE P08ZCA-EMP-NO               TO P0ES-EMP-NBR
526700     MOVE HOLD-TASK-KEY               TO P0ES-TASK-KEY
526800     MOVE '0000'                      TO P0ES-ZEROES
526900     IF P08ZCA-DHD-HOME
527000        MOVE SCR08Z-CRAFT             TO WS-CRAFT-CODE-CHECK
527100     ELSE
527200        MOVE P08ZCA-ASGN-CC           TO WS-CRAFT-CODE-CHECK
527300     END-IF
527400     MOVE WS-IVR-CALL-PROF            TO P0ES-CALL-PROFILE
527500     MOVE SCR08Z-FUNC                 TO P0ES-CALL-FUNCTION
527600     MOVE SCR08Z-TYPE                 TO P0ES-DH-ASGN-TYPE
527700*#1501
527800     IF P08ZCA-SAVE-CBCK-FLAG = 'Y'
527900        MOVE WS-SHORT-CALL-REQ        TO P0ES-SHORT-CALL-REQ
528000     END-IF
528100     MOVE P08ZCA-RESUB-FLAG           TO P0ES-RESUB-FLAG
528200* WHEN THIS IS A FIRST TIME AUTOMATED IVR CALL, THE IEC EFF TIME
528300* WILL BE THE CALL TIME, NOT THE CURRENT TIME
528400*    IF PSTCA-FROM-PROGRAM             = P0EP-PGM
528500*       SET  P0ES-AUTOMATED-IVR-CALL  TO TRUE
528600*    END-IF
528700* 0EP DETERMINES SINGLE THREAD.  0ES WILL SET THE TASK TO WT ST
528800*    IF P08CA-SINGLE-THREAD(FUNC-SUB)
528900*       SET P0ES-SINGLE-THREAD        TO TRUE
529000*    ELSE
529100*       MOVE SPACES                   TO P0ES-SINGLE-THREAD-FL
529200*    END-IF
529300*
529400*    MOVE TASK-RUN-LONG-TRAIN         TO P0ES-RUN-LONG-TRAIN
529500*    INSPECT SCR08-NAME(FUNC-SUB) REPLACING
529600*            ALL LOW-VALUES BY SPACES
529700*    EVALUATE TRUE
529800*       WHEN SCR08-NAME(FUNC-SUB)(17:10) = SPACES
529900*            MOVE SPACES              TO P0ES-MAX-HR-REMAIN
530000*       WHEN SCR08-NAME(FUNC-SUB)(22:1)  = '"'
530100*            STRING SCR08-NAME(FUNC-SUB)(17:2),
530200*                   SCR08-NAME(FUNC-SUB)(20:2)
530300*                 DELIMITED BY SIZE INTO P0ES-MAX-HR-REMAIN
530400*       WHEN SCR08-NAME(FUNC-SUB)(17:10) = 'MAXED OUT '
530500*            MOVE '0000' TO P0ES-MAX-HR-REMAIN
530600*       WHEN SCR08-NAME(FUNC-SUB)(17:10) = '??????????'
530700*            MOVE '????' TO P0ES-MAX-HR-REMAIN
530800*       WHEN OTHER
530900*            MOVE '????' TO P0ES-MAX-HR-REMAIN
531000*    END-EVALUATE
531100     .
531200*
531300 P5180-LINK-TO-0ES.
531400*
531500*?*  IF WS-FROM-IVR
531600*?*     MOVE WS-FROM-IVR-ABEND-FLAG   TO P0ES-FROM-IVR-ABEND-FLAG
531700*?*     MOVE WS-FROM-IVR-INFO         TO P0ES-FROM-VRU-INFO
531800*?*  END-IF
531900
532000     EXEC CICS LINK
532100               PROGRAM (P0ES-PGM)
532200               COMMAREA(P0ES-COMMAREA-PARMS)
532300               LENGTH  (P0ES-LGTH)
532400               RESP    (WS-RESPONSE)
532500     END-EXEC
532600     MOVE WS-RESPONSE                 TO FILE-STATUS
532700     IF P0ES-IVR-ABEND
532800     OR NOT SUCCESS
532900        MOVE 'P5180-1'                TO ERR-PARAGRAPH
533000        MOVE 'P0ESLINK'               TO ERR-KEY
533100*       IF P0ES-IVR-ABEND
533200*          SET  WS-IVR-ABEND          TO TRUE
533300*       END-IF
533400        PERFORM P9999-GOT-PROBLEM
533500     END-IF
533600     .
533700*
533800 P5190-WRITE-VCLL-HISTORY.
533900*
534000     MOVE SPACES                    TO P943-COMMAREA-PARMS
534100     MOVE P08ZCA-EMP-NO             TO P943-EMP-NBR
534200     SET  P943-IVR-DH-INIT-FUN      TO TRUE
534300     MOVE SCR08Z-DIST               TO P943-DIST
534400     MOVE SCR08Z-SUB-DIST           TO P943-SDIST
534500     MOVE SCR08Z-CRAFT              TO P943-CRAFT
534600     MOVE SCR08Z-DATE               TO P943-E-DATE(1:6)
534700     MOVE SCR08Z-TIME               TO P943-E-TOD
534800     MOVE WS-TIME-ZONE              TO P943-EMP-TIME-ZONE
534900     MOVE LAYOFF-CODE OF WS-MSTR    TO P943-LO
535000     MOVE SCR08Z-CODE               TO CODE-AREA
535100     IF DEADHEAD-HOME
535200        SET  P943-FUN35-HOME        TO TRUE
535300        MOVE SCR08Z-CODE            TO P943-NORM-ASGN
535400     ELSE
535500        MOVE SCR08Z-FUNC            TO P943-FUN35-TYPE
535600        STRING SCR08Z-DIST
535700               SCR08Z-SUB-DIST
535800               SCR08Z-CODE
535900               DELIMITED BY SIZE  INTO P943-NORM-ASGN
536000     END-IF
536100     MOVE SCR08Z-MODE               TO P943-FUN35-MOT
536200     MOVE SCR08Z-MILES              TO P943-FUN35-HRMN
536300     MOVE SCR08Z-HRMN               TO P943-FUN35-MILES
536400     MOVE P925-REST-STATUS-FLAG     TO P943-FUN35-REST-STATUS
536500     SET  P943-FUN35-CALL-FR-IVR    TO TRUE
536600     PERFORM P8700-WRITE-HISTORY
536700     .
536800*
536900 P5200-CANCEL-IVR-CALL-HOME.
537000*
537100     MOVE P08CA-TASK-KEY             TO TASK-LOCATION-KEY
537200                                        TASKTIME
537300     PERFORM P8300-READ-TASK-BY-TIME
537400     MOVE P08ZCA-EMP-NO              TO MSTRNBRK
537500     MOVE P08CA-TASK-KEY             TO TASK-LOCATION-KEY
537600                                        TASKTIME
537700                                        VRUINFOKEY
537800     PERFORM P8310-DELETE-TASK
537900     PERFORM P9340-DELETE-VRUINFO
538000
538100     PERFORM P8550-READ-MASTER-UPDATE
538200     IF MSTR-LAST-LAYOFF-CODE         > SPACES
538300        MOVE MSTR-LAST-LAYOFF-CODE   TO LAYOFF-CODE
538400     END-IF
538500     MOVE SPACES                     TO MSTR-LAST-LAYOFF-CODE
538600                                        MSTR-IVR-SAVE-DEC-KEY
538700                                        MSTR-IVR-SAVE-LAST-POS
538800                                        MSTR-IVR-SAVE-LAST-SEN
538900                                        MSTR-IVR-SAVE-LAST-STARTS
539000     PERFORM P8560-REWRITE-MASTER
539100     MOVE SPACE                      TO P08ZCA-FROM-EXECUTE-PGMS
539200
539300     MOVE DEFAULT-ATTR               TO SCR08Z-FUNC-HI
539400                                        SCR08Z-ST-HI
539500                                        SCR08Z-ECC-HI
539600                                        SCR08Z-NAME-HI
539700     PERFORM P5210-WRITE-VCAN-HISTORY
539800*
539900*         'IVR DEADHEAD HOME CANCELLED'
540000     MOVE 'V171'                     TO MSGLOG-CODE
540100     MOVE -1                         TO SCR08Z-FUNC-CURSOR
540200     MOVE REV-VIDEO                  TO SCR08Z-FUNC-HI
540300     .
540400*
540500 P5210-WRITE-VCAN-HISTORY.
540600*
540700     MOVE SPACES                    TO P943-COMMAREA-PARMS
540800     MOVE P08ZCA-EMP-NO             TO P943-EMP-NBR
540900     SET  P943-IVR-CAN-DH-CALL-HOME-FUN  TO TRUE
541000     MOVE SCR08Z-DIST               TO P943-DIST
541100     MOVE SCR08Z-SUB-DIST           TO P943-SDIST
541200     MOVE SCR08Z-CRAFT              TO P943-CRAFT
541300     MOVE SCR08Z-DATE               TO P943-E-DATE(1:6)
541400     MOVE SCR08Z-TIME               TO P943-E-TOD
541500     MOVE WS-TIME-ZONE              TO P943-EMP-TIME-ZONE
541600     MOVE LAYOFF-CODE OF WS-MSTR    TO P943-LO
541700     MOVE SCR08Z-CODE               TO CODE-AREA
541800     IF DEADHEAD-HOME
541900        SET  P943-FUN35-HOME        TO TRUE
542000        MOVE SCR08Z-CODE            TO P943-NORM-ASGN
542100     ELSE
542200        MOVE SCR08Z-FUNC            TO P943-FUN35-TYPE
542300        STRING SCR08Z-DIST
542400               SCR08Z-SUB-DIST
542500               SCR08Z-CODE
542600               DELIMITED BY SIZE  INTO P943-NORM-ASGN
542700     END-IF
542800     MOVE SCR08Z-MODE               TO P943-FUN35-MOT
542900     MOVE SCR08Z-MILES              TO P943-FUN35-HRMN
543000     MOVE SCR08Z-HRMN               TO P943-FUN35-MILES
543100     MOVE P925-REST-STATUS-FLAG     TO P943-FUN35-REST-STATUS
543200     SET  P943-FUN35-CALL-FR-IVR    TO TRUE
543300     PERFORM P8700-WRITE-HISTORY
543400     .
543500*#1501
543600*CNC0600-B
543700*
543800 P5300-PROCESS-HOS-OVRD.
543900*
544000     IF P08ZCA-EMP-NO > SPACES
544100        MOVE SPACES                  TO SCR08Z-FUNC
544200        MOVE PSTS08Z                 TO P08Z-TSQ-DATA
544300        PERFORM P9550-REWRITE-TSQUEUE
544400        MOVE P08ZCA-EMP-NO           TO MSTRNBRK
544500        PERFORM P8500-READ-MASTER
544600
544700        MOVE P08Z-PGM                TO PSTCA-FROM-PROGRAM
544800        MOVE DIST      OF WS-MSTR    TO PSTCA-DIST
544900                                        P18CCA-TRN-ASSN(1:2)
545000        MOVE SUB-DIST  OF WS-MSTR    TO PSTCA-SUB-DIST
545100                                        P18CCA-TRN-ASSN(3:2)
545200        MOVE P08ZCA-EMP-NO           TO PSTCA-EMP-NBR
545300        SET P18CCA-HOS-OVRD          TO TRUE
545400*CNC0600-DXC-B
545500        MOVE SCR08Z-CODE             TO P18CCA-TRN-ASSN(5:8)
545600        MOVE SCR08Z-CODE(1:2)        TO P18CCA-POOL
545700*CNC0600-DXC-E
545800        EXEC CICS XCTL
545900               PROGRAM (P18C-PGM)
546000               COMMAREA(PSTCOMM-AREA)
546100               LENGTH  (PSTCOMM-LGTH)
546200               RESP    (WS-RESPONSE)
546300        END-EXEC
546400        MOVE WS-RESPONSE             TO FILE-STATUS
546500        IF NOT SUCCESS
546600           MOVE 'P5300-1'            TO ERR-PARAGRAPH
546700           PERFORM P9999-GOT-PROBLEM
546800        END-IF
546900     ELSE
547000*       'FUNCTION NOT YET AVAILABLE'
547100        MOVE 'F003'       TO MSGLOG-CODE
547200        PERFORM P9000-SEND-MAP-AND-RETURN
547300     END-IF.
547400*CNC0600-E
547500*
547600 P6000-CLEAR-SHORT-CALL.
547700*
547800     MOVE P08ZCA-EMP-NO                TO TELENBRK
547900     PERFORM P8400-READ-TELE-UPDATE
548000     IF NOT SUCCESS
548100        IF NOT NO-RECORD-FND
548200           MOVE 'P4800-5'              TO ERR-PARAGRAPH
548300           MOVE TELENBRK               TO ERR-KEY
548400           PERFORM P9999-GOT-PROBLEM
548500        ELSE
548600           EXEC CICS UNLOCK
548700                     DATASET(TELE-VIA-EMP-NBR)
548800                     RESP(WS-RESPONSE)
548900           END-EXEC
549000        END-IF
549100     ELSE
549200        MOVE SPACES                    TO TELE-REQ-LEAD-TIME
549300                                          TELE-REQ-CALL-TIME
549400        PERFORM P8450-REWRITE-TELE
549500     END-IF
549600     .
549700*
549800 P7000-FIND-ASGN-CLASS.
549900*
550000*
550100     MOVE SPACES                       TO WS-ASGN-MERG-CLASS
550200                                          WS-CNTL-FILE
243700*CNLD-302  B  COMMENTING
550300**CNC0600
550400*                                          WS-ASGN-OUTPOST
243700*CNLD-302  E
550500     MOVE P08ZCA-ASSIGNMENT            TO WS-MERG-KEY
550600     IF UFP-ASGN
550700        MOVE '3A'                      TO CNTL-REC-TYPE
550800        MOVE WS-MERG-DIST              TO CNTL-DIST
550900        MOVE WS-MERG-SUB               TO CNTL-SUB-DIST
551000        MOVE WS-MERG-POOL              TO CNTL-POOL-CODE
551100        MOVE 'F'                       TO CNTL-POOL-TYPE
551200        MOVE CNTLKEY-AREA              TO CNTLKEY
551300        PERFORM P8800-READ-CNTLFILE
551400        IF NOT SUCCESS
551500           MOVE 'P7000-1'       TO ERR-PARAGRAPH
551600           MOVE CNTLKEY         TO ERR-KEY
551700           PERFORM P9999-GOT-PROBLEM
551800        ELSE
551900           MOVE CNTL-POOL-MERGER-CLASS TO WS-ASGN-MERG-CLASS
243700*CNLD-302  B  COMMENTING
552000**CNC0600B
552100*           IF CNTL-POOL-IS-OUTPOST
552200*              MOVE 'Y'                 TO WS-ASGN-OUTPOST
552300*           END-IF
552400**CNC0600E
243700*CNLD-302  E
552500        END-IF
552600     ELSE
552700        IF AJ-ASGN
552800           MOVE WS-TRCN-FILE           TO SAVE-TRCN-FILE
552900           MOVE SPACES                 TO TRCN-KEY3
553000           MOVE WS-MERG-DIST           TO TRCN-DIST3
553100           MOVE WS-MERG-SUB            TO TRCN-SDIST3
553200           MOVE WS-MERG-REST           TO TRCN-ASSIGNMENT
553300           MOVE TRCN-KEY3              TO TRCNKEY3
553400           PERFORM P7900-READ-TRCNKEY3
553500           MOVE TRCN-MERGER-CLASS      TO WS-ASGN-MERG-CLASS
243700*CNLD-302  B  COMMENTING
553600**CNC0600
553700*           MOVE TRCN-OUTPOST-FL        TO WS-ASGN-OUTPOST
243700*CNLD-302  E
553800           MOVE SAVE-TRCN-FILE         TO WS-TRCN-FILE
553900        END-IF
554000     END-IF.
554100*
554200 P7000-WRITE-TSQUEUE.
554300*
554400*
554500*      WRITE MAP TSQUEUE
554600*
554700     EXEC CICS ASSIGN
554800          EXTDS(WS-CICS-EXTDS-CODE)
554900     END-EXEC
555000*
555100     IF SCREEN-HAS-EXT-ATTR
555200        EXEC CICS SEND STRFIELD
555300                  FROM(WS-STRFIELD)
555400                  LENGTH(WS-STRFIELD-LGTH)
555500                  RESP(WS-RESPONSE)
555600        END-EXEC
555700        MOVE WS-RESPONSE           TO FILE-STATUS
555800        IF NOT SUCCESS
555900           MOVE 'P7000-1'          TO ERR-PARAGRAPH
556000           MOVE 'SEND STRFIELD'    TO ERR-KEY
556100           PERFORM P9999-GOT-PROBLEM
556200        END-IF
556300     END-IF
556400*
556500     MOVE LENGTH OF WS-BUFFER-DATA TO WS-BUFFER-LGTH
556600     EXEC CICS RECEIVE BUFFER
556700               INTO(WS-BUFFER-DATA)
556800               LENGTH(WS-BUFFER-LGTH)
556900               RESP(WS-RESPONSE)
557000     END-EXEC
557100     MOVE WS-RESPONSE              TO FILE-STATUS
557200     IF NOT SUCCESS AND NOT EOC
557300        MOVE 'P7000-2'             TO ERR-PARAGRAPH
557400        MOVE 'RECEIVE BUFFER'      TO ERR-KEY
557500        PERFORM P9999-GOT-PROBLEM
557600     END-IF
557700     MOVE EIBCPOSN                 TO WS-BUFFER-CURSOR
557800
557900
558000     MOVE LENGTH OF WS-BUFFER-AREA TO P08ZTSQ-QLGTH
558100     MOVE EIBTRMID                 TO P08ZTSQ-MAP-TERM-ID
558200     EXEC CICS WRITEQ TS
558300               QUEUE(P08ZTSQ-MAP-QUEUE-ID)
558400               FROM(WS-BUFFER-AREA)
558500               LENGTH(P08ZTSQ-QLGTH)
558600               RESP(WS-RESPONSE)
558700     END-EXEC
558800     MOVE WS-RESPONSE              TO FILE-STATUS
558900     IF NOT SUCCESS
559000        MOVE 'P7000-3'             TO ERR-PARAGRAPH
559100        PERFORM P9999-GOT-PROBLEM
559200     END-IF
559300     MOVE EIBTRMID TO P08ZTSQ-CA-TERM-ID
559400     EXEC CICS WRITEQ TS
559500               QUEUE(P08ZTSQ-CA-QUEUE-ID)
559600               FROM(PSTCOMM-AREA)
559700               LENGTH(PSTCOMM-LGTH)
559800               ITEM(P08ZTSQ-QUEUE-ITEM)
559900               RESP(WS-RESPONSE)
560000     END-EXEC
560100     MOVE WS-RESPONSE              TO FILE-STATUS
560200     IF NOT SUCCESS
560300        MOVE 'P7000-4'             TO ERR-PARAGRAPH
560400        PERFORM P9999-GOT-PROBLEM
560500     END-IF.
560600*
560700 P7010-READ-TSQUEUE.
560800*
560900*              READ THE MAPS TSQUEUE
561000*
561100     MOVE LENGTH OF WS-BUFFER-AREA TO P08ZTSQ-QLGTH
561200     MOVE EIBTRMID                 TO P08ZTSQ-MAP-TERM-ID
561300     EXEC CICS READQ TS
561400               QUEUE(P08ZTSQ-MAP-QUEUE-ID)
561500               INTO(WS-BUFFER-AREA)
561600               LENGTH(P08ZTSQ-QLGTH)
561700               ITEM(P08ZTSQ-QUEUE-ITEM)
561800               RESP(WS-RESPONSE)
561900     END-EXEC
562000     MOVE WS-RESPONSE              TO FILE-STATUS
562100     IF SUCCESS
562200        SET SEND-BUFFER            TO TRUE
562300     ELSE
562400        SET CREATE-SCREEN          TO TRUE
562500        MOVE LOW-VALUES            TO PSTS08Z
562600     END-IF
562700     MOVE EIBTRMID TO P08ZTSQ-CA-TERM-ID
562800     EXEC CICS READQ TS
562900               QUEUE(P08ZTSQ-CA-QUEUE-ID)
563000               INTO(PSTCOMM-AREA)
563100               LENGTH(PSTCOMM-LGTH)
563200               ITEM(P08ZTSQ-QUEUE-ITEM)
563300               RESP(WS-RESPONSE)
563400     END-EXEC
563500     MOVE WS-RESPONSE TO FILE-STATUS
563600     IF NOT SUCCESS
563700        MOVE SPACES TO PSTCOMM-AREA
563800     END-IF
563900     PERFORM P7020-DELETE-TSQUEUE.
564000*
564100 P7020-DELETE-TSQUEUE.
564200*
564300     MOVE EIBTRMID TO P08ZTSQ-MAP-TERM-ID
564400     EXEC CICS DELETEQ TS
564500               QUEUE(P08ZTSQ-MAP-QUEUE-ID)
564600               RESP(WS-RESPONSE)
564700     END-EXEC
564800     MOVE EIBTRMID TO P08ZTSQ-CA-TERM-ID
564900     EXEC CICS DELETEQ TS
565000               QUEUE(P08ZTSQ-CA-QUEUE-ID)
565100               RESP(WS-RESPONSE)
565200     END-EXEC.
565300*
565400 P7900-READ-TRCNKEY3.
565500*
565600     EXEC CICS READ
565700               DATASET(TRAIN-CN-VIA-DSD-ASGN)
565800               INTO(WS-TRCN-FILE)
565900               LENGTH(TRAINCN-DSD-RLGTH)
566000               RIDFLD(TRCNKEY3)
566100               KEYLENGTH(TRAINCN-DSD-KLGTH)
566200               RESP(WS-RESPONSE)
566300     END-EXEC
566400     MOVE WS-RESPONSE TO FILE-STATUS
566500     IF NOT SUCCESS
566600        MOVE 'P7900-1' TO ERR-PARAGRAPH
566700        MOVE TRCNKEY3  TO ERR-KEY
566800        PERFORM P9999-GOT-PROBLEM
566900     END-IF.
567000*
567100 P8000-READ-TRCNKEY1.
567200*
567300     EXEC CICS READ
567400               DATASET(TRAIN-CN-VIA-TRCNKEY1)
567500               INTO(WS-TRCN-FILE)
567600               LENGTH(TRAINCN-RLGTH)
567700               RIDFLD(TRCNKEY1)
567800               KEYLENGTH(TRAINCN-KLGTH)
567900               RESP(WS-RESPONSE)
568000     END-EXEC
568100     MOVE WS-RESPONSE TO FILE-STATUS
568200     IF NOT SUCCESS
568300        MOVE 'P8000-1' TO ERR-PARAGRAPH
568400        MOVE TRCNKEY1  TO ERR-KEY
568500        PERFORM P9999-GOT-PROBLEM
568600     END-IF.
568700*
568800 P8200-READ-AHIST.
568900*
569000     EXEC CICS READ
569100               DATASET(AH-DATASET)
569200               INTO(WS-AHIST)
569300               LENGTH(AH1-RLGTH)
569400               RIDFLD(AH1KEY)
569500               KEYLENGTH(AH1-KLGTH)
569600               RESP(WS-RESPONSE)
569700     END-EXEC
569800     MOVE WS-RESPONSE TO FILE-STATUS.
569900*
570000 P8300-READ-TASK-BY-TIME.
570100*
570200     EXEC CICS READ
570300               DATASET(TASK-VIA-EFF-TIME)
570400               INTO(WS-TASK)
570500               LENGTH(TASKEFTM-RLGTH)
570600               RIDFLD(TASK-EFF-TIME-KEY)
570700               KEYLENGTH(TASKEFTM-KLGTH)
570800               RESP(WS-RESPONSE)
570900     END-EXEC
571000     MOVE WS-RESPONSE TO FILE-STATUS.
571100*
571200 P8310-DELETE-TASK.
571300*
571400     EXEC CICS DELETE
571500               DATASET(TASK-VIA-EFF-TIME)
571600               RIDFLD(TASK-EFF-TIME-KEY)
571700               RESP(WS-RESPONSE)
571800     END-EXEC
571900     MOVE WS-RESPONSE                   TO FILE-STATUS
572000     IF  NOT SUCCESS
572100     AND NOT NO-RECORD-FND
572200        MOVE 'P8310-1'                  TO ERR-PARAGRAPH
572300        MOVE TASK-EFF-TIME-KEY          TO ERR-KEY
572400        MOVE SPACES                     TO ERR-SENTENCE
572500        PERFORM P9999-GOT-PROBLEM
572600     END-IF
572700     .
572800*
572900 P8400-READ-TELE-UPDATE.
573000*
573100     EXEC CICS READ
573200               UPDATE
573300               DATASET(TELE-VIA-EMP-NBR)
573400               INTO(WS-TELE-FILE)
573500               LENGTH(TELEENBR-RLGTH)
573600               RIDFLD(TELENBRK)
573700               KEYLENGTH(TELEENBR-KLGTH)
573800               RESP(WS-RESPONSE)
573900     END-EXEC
574000     MOVE WS-RESPONSE                   TO FILE-STATUS
574100     .
574200*
574300 P8450-REWRITE-TELE.
574400*
574500     EXEC CICS REWRITE
574600               DATASET(TELE-VIA-EMP-NBR)
574700               FROM(WS-TELE-FILE)
574800               LENGTH(TELEENBR-RLGTH)
574900               RESP(WS-RESPONSE)
575000     END-EXEC
575100     MOVE WS-RESPONSE                   TO FILE-STATUS
575200     IF NOT SUCCESS
575300        MOVE 'P8450'                    TO ERR-PARAGRAPH
575400        MOVE TELENBRK                   TO ERR-KEY
575500        PERFORM P9999-GOT-PROBLEM
575600     END-IF
575700     .
575800*
575900 P8500-READ-MASTER.
576000*
576100     EXEC CICS READ
576200               DATASET(MSTR-VIA-EMP-NBR)
576300               INTO(WS-MSTR)
576400               LENGTH(MSTRENBR-RLGTH)
576500               RIDFLD(MSTRNBRK)
576600               KEYLENGTH(MSTRENBR-KLGTH)
576700               RESP(WS-RESPONSE)
576800     END-EXEC
576900     MOVE WS-RESPONSE TO FILE-STATUS
577000     IF NOT SUCCESS
577100        MOVE 'P8500'   TO ERR-PARAGRAPH
577200        MOVE MSTRNBRK  TO ERR-KEY
577300        PERFORM P9999-GOT-PROBLEM
577400     END-IF.
577500*CNC0600-NXA-B
577600 P8570-READ-MASTER3.
577700     EXEC CICS READ
577800               DATASET(MSTR3-VIA-EMP-NBR)
577900               INTO(WS-MSTR3)
578000               LENGTH(MSTR3ENBR-RLGTH)
578100               RIDFLD(MSTR3NBRK)
578200               KEYLENGTH(MSTR3ENBR-KLGTH)
578300               RESP(WS-RESPONSE)
578400     END-EXEC
578500     MOVE WS-RESPONSE           TO FILE-STATUS
578600     IF NOT SUCCESS
578700        IF NOT (NO-RECORD-FND OR END-OF-FILE)
578800           MOVE 'P8570'            TO ERR-PARAGRAPH
578900           MOVE MSTR3NBRK          TO ERR-KEY
579000           PERFORM P9999-GOT-PROBLEM
579100        END-IF
579200     ELSE
579300        SET WS-MSTR3-REC-FOUND  TO TRUE
579400     END-IF.
579500*
579600*CNC0600-NXA-E
579700*
579800 P8501-LINK-TO-PS52.
579900*
580000     EXEC CICS LINK
580100               PROGRAM(PS52-PGM)
580200               COMMAREA(PS52-COMMAREA-PARMS)
580300               LENGTH(PS52-LGTH)
580400               RESP(WS-RESPONSE)
580500     END-EXEC
580600     MOVE WS-RESPONSE        TO FILE-STATUS
580700     .
580800*
580900 P8510-MASTER-JOBS.
581000*
581100     MOVE SPACES             TO WS-ASGN-FILE
581200     MOVE EMP-NBR OF WS-MSTR TO ASGN-EMP-NO
581300     PERFORM PXXXX-JOB-OWNED
581400     MOVE ASGN-JOB-TYPE      TO NORMAL-ASGNMT-FLAG
581500     MOVE ASGN-ASSIGNMENT    TO NORMAL-ASGNMT
581600     MOVE SPACES             TO WS-ASGN-FILE
581700     MOVE EMP-NBR OF WS-MSTR TO ASGN-EMP-NO
581800     PERFORM PXXXX-LATEST-TEMP-JOB
581900     MOVE ASGN-JOB-TYPE      TO TEMPORARY-ASGNMT-FLAG
582000     MOVE SPACES             TO TEMP-ASGN-XB-AUG-FLAG
582100     IF ASGN-JOB-TYPE = 'X'
582200       AND AUGMENTED-TO-EXTRA-BOARD
582300           SET TEMP-ASGN-XB-AUG TO TRUE
582400     END-IF
582500     MOVE ASGN-ASSIGNMENT    TO TEMPORARY-ASGNMT
582600     MOVE SPACES             TO WS-ASGN-FILE
582700     MOVE EMP-NBR OF WS-MSTR TO ASGN-EMP-NO
582800     PERFORM PXXXX-JOB-ON-DUTY
582900     MOVE ASGN-JOB-TYPE      TO ON-DUTY-ASGNMT-FLAG
583000     MOVE ASGN-ASSIGNMENT    TO ON-DUTY-ASGNMT
583100     MOVE ASGN-ON-DUTY-DATE-TIME TO ON-DUTY-OUT-TOWN-CODE.
583200*
583300 P8550-READ-MASTER-UPDATE.
583400*
583500     EXEC CICS READ
583600               UPDATE
583700               DATASET(MSTR-VIA-EMP-NBR)
583800               INTO(WS-MSTR)
583900               LENGTH(MSTRENBR-RLGTH)
584000               RIDFLD(MSTRNBRK)
584100               KEYLENGTH(MSTRENBR-KLGTH)
584200               RESP(WS-RESPONSE)
584300     END-EXEC
584400     MOVE WS-RESPONSE TO FILE-STATUS
584500     IF NOT SUCCESS
584600        MOVE 'P8550'   TO ERR-PARAGRAPH
584700        MOVE MSTRNBRK  TO ERR-KEY
584800        PERFORM P9999-GOT-PROBLEM
584900     END-IF.
585000*
585100 P8560-REWRITE-MASTER.
585200*
585300     EXEC CICS REWRITE
585400               DATASET(MSTR-VIA-EMP-NBR)
585500               FROM(WS-MSTR)
585600               LENGTH(MSTRENBR-RLGTH)
585700               RESP(WS-RESPONSE)
585800     END-EXEC
585900     MOVE WS-RESPONSE TO FILE-STATUS
586000     IF NOT SUCCESS
586100        MOVE 'P8560'   TO ERR-PARAGRAPH
586200        MOVE MSTRNBRK  TO ERR-KEY
586300        PERFORM P9999-GOT-PROBLEM
586400     END-IF.
586500*
586600 P8610-READ-CNTLFILE.
586700*
586800     MOVE WORK-CNTLKEY TO CNTLKEY
586900     EXEC CICS READ
587000               DATASET(CNTL-FILE-VIA-CNTLKEY)
587100               INTO(WS-CNTL-FILE)
587200               LENGTH(CNTLFILE-RLGTH)
587300               RIDFLD(CNTLKEY)
587400               KEYLENGTH(CNTLFILE-KLGTH)
587500               RESP(WS-RESPONSE)
587600     END-EXEC
587700     MOVE WS-RESPONSE TO FILE-STATUS.
587800*
587900 P8700-WRITE-HISTORY.
588000*
588100     MOVE WS-LOCAL-DATE-TIME    TO WORK-HIST-TIME
588200     MOVE ZEROS                 TO WORK-HIST-TIME-TIE
588300     IF P943-EFF-DATE-TIME NOT > SPACES
588400        MOVE WS-LOCAL-DATE-TIME TO P943-EFF-DATE-TIME
588500     END-IF
588600     MOVE WORK-HIST-TIMEX       TO P943-CLOCK-TIME
588700     SET P943-EMPLOYEE-FUNCTION TO TRUE
588800
588900     EXEC CICS ASSIGN
589000               USERID(P943-USERID)
589100     END-EXEC
589200
589300     EXEC CICS LINK
589400               PROGRAM(P943-PGM)
589500               COMMAREA(P943-COMMAREA-PARMS)
589600               LENGTH(P943-LGTH)
589700               RESP(WS-RESPONSE)
589800     END-EXEC
589900
590000     MOVE WS-RESPONSE           TO FILE-STATUS
590100     IF NOT SUCCESS
590200        MOVE 'P8700'            TO ERR-PARAGRAPH
590300        MOVE 'P943'             TO ERR-KEY
590400        PERFORM P9999-GOT-PROBLEM
590500     END-IF.
590600*
590700 P8800-READ-CNTLFILE.
590800*
590900     EXEC CICS READ
591000               DATASET(CNTL-FILE-VIA-CNTLKEY)
591100               INTO(WS-CNTL-FILE)
591200               LENGTH(CNTLFILE-RLGTH)
591300               RIDFLD(CNTLKEY)
591400               KEYLENGTH(CNTLFILE-KLGTH)
591500               RESP(WS-RESPONSE)
591600     END-EXEC
591700     MOVE WS-RESPONSE TO FILE-STATUS.
591800*
591900 P8810-READ-MC-CONTROL.
592000*
592100     MOVE WK-CNTL-MC-CNTLKEY        TO CNTLKEY
592200     EXEC CICS READ
592300               DATASET(CNTL-FILE-VIA-CNTLKEY)
592400               INTO(WS-CNTL-FILE)
592500               LENGTH(CNTLFILE-RLGTH)
592600               RIDFLD(CNTLKEY)
592700               KEYLENGTH(CNTLFILE-KLGTH)
592800               GTEQ
592900               RESP(WS-RESPONSE)
593000     END-EXEC
593100     MOVE WS-RESPONSE               TO FILE-STATUS
593200     IF SUCCESS
593300        IF CNTL-REC-TYPE NOT = '69'
593400           OR CNTL-MC-CODE NOT = WK-CNTL-MC-CODE
593500           OR CNTL-MC-TYPE-SVC NOT = WK-CNTL-MC-TYPE-SVC
593600           OR CNTL-MC-DIST NOT = WK-CNTL-MC-DIST
593700           OR CNTL-MC-SDIST NOT = WK-CNTL-MC-SDIST
593800           OR CNTL-MC-XB NOT = WK-CNTL-MC-XB
593900           SET NO-RECORD-FND        TO TRUE
594000        END-IF
594100     ELSE
594200        IF NOT (NO-RECORD-FND OR END-OF-FILE)
594300           MOVE 'P8810-1'           TO ERR-PARAGRAPH
594400           MOVE CNTLKEY             TO ERR-KEY
594500           PERFORM P9999-GOT-PROBLEM
594600        END-IF
594700     END-IF.
594800*
594900 P8900-READ-DECISION.
595000*
595100     EXEC CICS READ
595200               DATASET(DEC-TABLE-VIA-DECKEY)
595300               INTO(WORK-DEC-TABLE)
595400               LENGTH(DECTABLE-RLGTH)
595500               RIDFLD(DECKEY)
595600               KEYLENGTH(DECTABLE-KLGTH)
595700               RESP(WS-RESPONSE)
595800     END-EXEC
595900     MOVE WS-RESPONSE    TO FILE-STATUS.
596000*
596100 PXXXX-JOB-OWNER.
596200*
596300     SET ASGN-OWNER-REC TO TRUE
596400     MOVE ZEROES        TO ASGN-DATE-TIME
596500     MOVE ASGNKEY1      TO ASGNJOB
596600     EXEC CICS READ
596700               DATASET(ASGN-VIA-ASGNJOB)
596800               INTO(ASGN-AREA)
596900               LENGTH(ASGNJOB-RLGTH)
597000               RIDFLD(ASGNJOB)
597100               KEYLENGTH(ASGNJOB-KLGTH)
597200               RESP(WS-RESPONSE)
597300     END-EXEC
597400     MOVE WS-RESPONSE TO FILE-STATUS
597500     IF SUCCESS
597600       CONTINUE
597700     ELSE
597800       IF NO-RECORD-FND OR END-OF-FILE
597900         MOVE ZEROES TO ASGN-EMP-NO
598000       ELSE
598100         MOVE 'PXXXX-JO' TO ERR-PARAGRAPH
598200         MOVE ASGNJOB    TO ERR-KEY
598300         PERFORM P9999-GOT-PROBLEM
598400       END-IF
598500     END-IF.
598600*
598700 PXXXX-ON-DUTY-EMP.
598800*
598900     SET ASGN-ON-DUTY-REC TO TRUE
599000     MOVE ZEROES          TO ASGN-DATE-TIME
599100     MOVE ASGNKEY1        TO ASGNJOB
599200     EXEC CICS READ
599300               DATASET(ASGN-VIA-ASGNJOB)
599400               INTO(ASGN-AREA)
599500               LENGTH(ASGNJOB-RLGTH)
599600               RIDFLD(ASGNJOB)
599700               KEYLENGTH(ASGNJOB-KLGTH)
599800               RESP(WS-RESPONSE)
599900     END-EXEC
600000     MOVE WS-RESPONSE TO FILE-STATUS
600100     IF SUCCESS
600200       CONTINUE
600300     ELSE
600400       IF NO-RECORD-FND OR END-OF-FILE
600500         MOVE ZERO TO ASGN-EMP-NO
600600       ELSE
600700         MOVE 'PXXXX-OD' TO ERR-PARAGRAPH
600800         MOVE ASGNJOB    TO ERR-KEY
600900         PERFORM P9999-GOT-PROBLEM
601000       END-IF
601100     END-IF.
601200*
601300 PXXXX-JOB-OWNED.
601400*
601500     MOVE '1'      TO ASGN-EMP-NO-REC-TYPE
601600     MOVE ZEROES   TO ASGN-EMP-DATE-TIME
601700     MOVE ASGNKEY2 TO ASGNEMP
601800     EXEC CICS READ
601900               DATASET(ASGN-VIA-ASGNEMP)
602000               INTO(WS-ASGN-FILE)
602100               LENGTH(ASGNEMP-RLGTH)
602200               RIDFLD(ASGNEMP)
602300               KEYLENGTH(ASGNEMP-KLGTH)
602400               RESP(WS-RESPONSE)
602500     END-EXEC
602600     MOVE WS-RESPONSE TO FILE-STATUS
602700     IF SUCCESS
602800        MOVE ASGNKEY1 TO SAVE-NORM-ASGN-KEY
602900     ELSE
603000        IF NO-RECORD-FND OR END-OF-FILE
603100           MOVE SPACE TO ASGN-ASSIGNMENT
603200        ELSE
603300           MOVE 'PXXXX-JO' TO ERR-PARAGRAPH
603400           MOVE ASGNEMP    TO ERR-KEY
603500           PERFORM P9999-GOT-PROBLEM
603600        END-IF
603700     END-IF.
603800*
603900 PXXXX-LATEST-TEMP-JOB.
604000*
604100     MOVE '2'           TO ASGN-EMP-NO-REC-TYPE
604200     MOVE ZEROES        TO ASGN-EMP-DATE-TIME
604300     MOVE ASGNKEY2      TO ASGNEMP
604400                           XXXX-ASGNKEY2
604500     MOVE SPACE         TO ASGN-AREA
604600     MOVE XXXX-ASGNKEY2 TO ASGNKEY2
604700     MOVE ASGN-AREA     TO SAVE-ASGN-AREA
604800     EXEC CICS STARTBR
604900               DATASET(ASGN-VIA-ASGNEMP)
605000               RIDFLD(ASGNEMP)
605100               GTEQ
605200               RESP(WS-RESPONSE)
605300     END-EXEC
605400     MOVE WS-RESPONSE TO FILE-STATUS
605500     IF SUCCESS
605600        MOVE 0 TO ASGN-DONE-CODE
605700        PERFORM UNTIL ASGN-DONE
605800           EXEC CICS READNEXT
605900                     DATASET(ASGN-VIA-ASGNEMP)
606000                     INTO(ASGN-AREA)
606100                     LENGTH(ASGNEMP-RLGTH)
606200                     RIDFLD(ASGNEMP)
606300                     KEYLENGTH(ASGNEMP-KLGTH)
606400                     RESP(WS-RESPONSE)
606500           END-EXEC
606600           MOVE WS-RESPONSE TO FILE-STATUS
606700           IF SUCCESS
606800              IF ASGN-EMP-NO = XX-ASGN-EMP AND
606900                 ASGN-EMP-NO-REC-TYPE = '2'
607000                   MOVE ASGN-AREA TO SAVE-ASGN-AREA
607100                   MOVE ASGNKEY1  TO SAVE-TEMP-ASGN-KEY
607200              ELSE
607300                 SET ASGN-DONE TO TRUE
607400              END-IF
607500           ELSE
607600              IF NO-RECORD-FND OR END-OF-FILE
607700                 MOVE SPACE TO ASGN-ASSIGNMENT
607800                 SET ASGN-DONE TO TRUE
607900              ELSE
608000                 SET ASGN-DONE TO TRUE
608100                 MOVE 'PXXXX-LTJ' TO ERR-PARAGRAPH
608200                 MOVE ASGNEMP     TO ERR-KEY
608300                 PERFORM P9999-GOT-PROBLEM
608400              END-IF
608500           END-IF
608600        END-PERFORM
608700        MOVE SAVE-ASGN-AREA TO ASGN-AREA
608800        EXEC CICS ENDBR
608900                  DATASET(ASGN-VIA-ASGNEMP)
609000                  RESP(WS-RESPONSE)
609100        END-EXEC
609200     ELSE
609300       IF NO-RECORD-FND OR END-OF-FILE
609400          MOVE SPACE TO ASGN-ASSIGNMENT
609500       ELSE
609600          MOVE 'PXXXX-LTJ' TO ERR-PARAGRAPH
609700          MOVE ASGNEMP     TO ERR-KEY
609800          PERFORM P9999-GOT-PROBLEM
609900       END-IF
610000     END-IF.
610100*
610200 PXXXX-LATEST-TEMP.
610300*
610400     MOVE SPACES       TO SAVE-ASGN-AREA
610500     SET ASGN-TEMP-REC TO TRUE
610600     MOVE ZEROS        TO ASGN-DATE-TIME
610700     MOVE ASGNKEY1     TO ASGNJOB XXXX-ASGNKEY1
610800     EXEC CICS STARTBR
610900               DATASET(ASGN-VIA-ASGNJOB)
611000               RIDFLD(ASGNJOB)
611100               GTEQ
611200               RESP(WS-RESPONSE)
611300     END-EXEC
611400     MOVE WS-RESPONSE TO FILE-STATUS
611500     IF NOT SUCCESS
611600       IF NO-RECORD-FND
611700         MOVE ZEROS TO ASGN-EMP-NO
611800       ELSE
611900         MOVE 'PXXXX-B1' TO ERR-PARAGRAPH
612000         MOVE ASGNJOB    TO ERR-KEY
612100         PERFORM P9999-GOT-PROBLEM
612200       END-IF
612300     ELSE
612400       MOVE 0 TO ASGN-DONE-CODE
612500       PERFORM UNTIL ASGN-DONE
612600         EXEC CICS READNEXT
612700                   DATASET(ASGN-VIA-ASGNJOB)
612800                   INTO(ASGN-AREA)
612900                   LENGTH(ASGNJOB-RLGTH)
613000                   RIDFLD(ASGNJOB)
613100                   KEYLENGTH(ASGNJOB-KLGTH)
613200                   RESP(WS-RESPONSE)
613300         END-EXEC
613400         MOVE WS-RESPONSE TO FILE-STATUS
613500         IF NOT SUCCESS
613600           IF NOT END-OF-FILE
613700             MOVE 'PXXXX-B2' TO ERR-PARAGRAPH
613800             MOVE ASGNJOB    TO ERR-KEY
613900             PERFORM P9999-GOT-PROBLEM
614000           END-IF
614100           SET ASGN-DONE TO TRUE
614200         ELSE
614300           IF ASGN-TEMP-REC
614400              AND XX-ASGN-DIST     = ASGN-DIST
614500              AND XX-ASGN-SUB-DIST = ASGN-SUB-DIST
614600              AND XX-ASGN-JOB      = ASGN-AJ-JOB
614700                                     OF ASGN-ASSIGNMENT
614800             MOVE ASGN-AREA TO SAVE-ASGN-AREA
614900             IF GET-FIRST-TEMP-EMP
615000               SET ASGN-DONE TO TRUE
615100             END-IF
615200           ELSE
615300             SET ASGN-DONE TO TRUE
615400           END-IF
615500         END-IF
615600       END-PERFORM
615700       EXEC CICS ENDBR
615800                 DATASET(ASGN-VIA-ASGNJOB)
615900                 RESP(WS-RESPONSE)
616000       END-EXEC
616100     END-IF
616200     IF SAVE-ASGN-AREA > SPACE
616300       MOVE SAVE-ASGN-AREA TO ASGN-AREA
616400     ELSE
616500       MOVE ZERO TO ASGN-EMP-NO
616600     END-IF.
616700*
616800 PXXXX-JOB-ON-DUTY.
616900*
617000     MOVE '3'      TO ASGN-EMP-NO-REC-TYPE
617100     MOVE ZEROES   TO ASGN-EMP-DATE-TIME
617200     MOVE ASGNKEY2 TO ASGNEMP
617300     EXEC CICS READ
617400               DATASET(ASGN-VIA-ASGNEMP)
617500               INTO(ASGN-AREA)
617600               LENGTH(ASGNEMP-RLGTH)
617700               RIDFLD(ASGNEMP)
617800               KEYLENGTH(ASGNEMP-KLGTH)
617900               RESP(WS-RESPONSE)
618000     END-EXEC
618100     MOVE WS-RESPONSE TO FILE-STATUS
618200     IF SUCCESS
618300        MOVE ASGN-AREA TO SAVE-ASGN-AREA
618400     ELSE
618500        IF NO-RECORD-FND OR END-OF-FILE
618600           MOVE SPACE TO ASGN-ASSIGNMENT
618700        ELSE
618800           MOVE 'PXXXX-JOD' TO ERR-PARAGRAPH
618900           MOVE ASGNEMP     TO ERR-KEY
619000           PERFORM P9999-GOT-PROBLEM
619100        END-IF
619200     END-IF.
619300*
619400 COPY TIMEEDIT.
619500*
619600 COPY DATEEDIT.
619700*
619800 COPY BIFEDIT.
619900*
620000 COPY TIMEZONE.
620100*
620200 COPY TZERROR.
620300*=================================================================
620400 P9000-SEND-MAP-AND-RETURN.
620500*=================================================================
620600     IF MSGLOG-CODE > SPACES
620700        PERFORM P9030-GET-MESSAGE
620800        MOVE MSGLOG-MESSAGE-AREA TO SCR08Z-ERRORMSG
620900        IF MSGLOG-CODE            = 'I592'
621000           MOVE LAYOFF-CODE      TO SCR08Z-ERRORMSG(43:2)
621100        END-IF
621200     END-IF
621300*CNLD-230-B
621400     IF MSGLOG-CODE  = 'E373'
621500                    OR 'E374'
621600                    OR 'E375'
621700                    OR 'E378'
621800                    OR 'E379'
621900                    OR 'E380'
622300*CNLD-257-DXC-B
621900                    OR 'E382'
621900                    OR 'E383'
622300*CNLD-257-DXC-E
622000        MOVE WS-RFR-MSG  TO SCR08Z-ERRORMSG(05:4)
622100*          'ERT=XXXX <<MESSAGE>>'
622200     END-IF
622300*CNLD-230-E
622400
622500     MOVE P08Z-MAP-VERSION(PSTCA-SUB) TO P08Z-MAP
622600     IF CREATE-SCREEN
622700        PERFORM P9500-WRITE-TSQUEUE
622800        PERFORM P9010-SEND-PHYSICAL-MAP
622900     ELSE
623000        IF CONTINUE-SCREEN
623100           MOVE PSTS08Z               TO P08Z-TSQ-DATA
623200           PERFORM P9550-REWRITE-TSQUEUE
623300           PERFORM P9020-SEND-DATAONLY-MAP
623400        ELSE
623500           IF SEND-BUFFER
623600              PERFORM P9035-SEND-BUFFER
623700           END-IF
623800        END-IF
623900     END-IF
624000     EXEC CICS RETURN
624100               TRANSID(P08Z-TRAN)
624200               COMMAREA(PSTCOMM-AREA)
624300               LENGTH(P08ZCOMM-LGTH)
624400     END-EXEC.
624500*
624600 P9010-SEND-PHYSICAL-MAP.
624700*
624800     EXEC CICS SEND MAP(P08Z-MAP)
624900                    MAPSET(P08Z-SET)
625000                    FROM(PSTS08Z)
625100                    CURSOR
625200                    FREEKB
625300                    ERASE
625400                    RESP(WS-RESPONSE)
625500     END-EXEC
625600     MOVE WS-RESPONSE TO FILE-STATUS
625700     IF NOT SUCCESS
625800        MOVE 'P9010'   TO ERR-PARAGRAPH
625900        PERFORM P9999-GOT-PROBLEM
626000     END-IF.
626100*
626200 P9020-SEND-DATAONLY-MAP.
626300*
626400     EXEC CICS SEND MAP(P08Z-MAP)
626500                    MAPSET(P08Z-SET)
626600                    FROM(PSTS08Z)
626700                    DATAONLY
626800                    CURSOR
626900                    FREEKB
627000                    RESP(WS-RESPONSE)
627100     END-EXEC
627200     MOVE WS-RESPONSE TO FILE-STATUS
627300     IF NOT SUCCESS
627400        MOVE 'P9020' TO ERR-PARAGRAPH
627500        PERFORM P9999-GOT-PROBLEM
627600     END-IF.
627700*
627800 P9030-GET-MESSAGE.
627900*
628000     MOVE PSTCA-SUB TO MSGLOG-SUB-CODE
628100     EXEC CICS READ
628200               DATASET(MSGLOG-VIA-CODE)
628300               INTO(MSGLOG-AREA)
628400               LENGTH(MSGLOG-RLGTH)
628500               RIDFLD(MSGLOG-KEY)
628600               KEYLENGTH(MSGLOG-KLGTH)
628700               RESP(WS-RESPONSE)
628800     END-EXEC
628900     MOVE WS-RESPONSE TO FILE-STATUS
629000     IF NOT SUCCESS
629100        IF PSTCA-SUB = 1
629200           MOVE 'NO MESSAGE ON FILE' TO MSGLOG-MESSAGE
629300        ELSE
629400           MOVE 'AUCUN MESSAGE'      TO MSGLOG-MESSAGE
629500        END-IF
629600     END-IF
629700     MOVE MSGLOG-CODE     TO MSGLOG-MSG-CODE
629800     MOVE '-'             TO MSGLOG-MSG-SEP
629900     MOVE MSGLOG-SUB-CODE TO MSGLOG-MSG-SUB-CODE.
630000*
630100 P9035-SEND-BUFFER.
630200*
630300     EXEC CICS SEND
630400               FROM(WS-BUFFER-DATA)
630500               LENGTH(WS-BUFFER-LGTH)
630600               ERASE
630700               RESP(WS-RESPONSE)
630800     END-EXEC
630900     MOVE WS-RESPONSE       TO FILE-STATUS
631000     IF NOT SUCCESS
631100        MOVE 'P9035-1'      TO ERR-PARAGRAPH
631200        MOVE 'SEND BUFFER'  TO ERR-KEY
631300        PERFORM P9999-GOT-PROBLEM
631400     END-IF
631500     EXEC CICS SEND
631600               CONTROL
631700               CURSOR(WS-BUFFER-CURSOR)
631800               RESP(WS-RESPONSE)
631900     END-EXEC
632000     MOVE WS-RESPONSE       TO FILE-STATUS
632100     IF NOT SUCCESS
632200        MOVE 'P9035-2'      TO ERR-PARAGRAPH
632300        MOVE 'SEND CURSOR'  TO ERR-KEY
632400        PERFORM P9999-GOT-PROBLEM
632500     END-IF.
632600*=================================================================
632700 P9050-RESET-ATTRIBUTES.
632800*=================================================================
632900     MOVE AUTOSKIP-MDT        TO SCR08Z-TYPE-ATTR
633000                                 SCR08Z-CODE-ATTR
633100                                 SCR08Z-MODE-ATTR
633200                                 SCR08Z-SEL-DIST-ATTR
633300                                 SCR08Z-SEL-SDIST-ATTR
633400                                 SCR08Z-FURTHER-N-ATTR
633500                                 SCR08Z-MILES-ATTR
633600                                 SCR08Z-HRMN-ATTR
633700                                 SCR08Z-DATE-ATTR
633800                                 SCR08Z-TIME-ATTR.
633900*=================================================================
634000 P9100-SETUP-SCR03.
634100*=================================================================
634200     EXEC CICS XCTL
634300               PROGRAM(P03-PGM)
634400               COMMAREA(PSTCOMM-AREA)
634500               LENGTH(PSTCOMM-LGTH)
634600               RESP(WS-RESPONSE)
634700     END-EXEC
634800     MOVE WS-RESPONSE TO FILE-STATUS
634900     IF NOT SUCCESS
635000         MOVE 'P9100' TO ERR-PARAGRAPH
635100         PERFORM P9999-GOT-PROBLEM
635200     END-IF.
635300*=================================================================
635400 P9130-SETUP-SCR03A.
635500*=================================================================
635600     EXEC CICS XCTL
635700               PROGRAM(P03A-PGM)
635800               COMMAREA(PSTCOMM-AREA)
635900               LENGTH(PSTCOMM-LGTH)
636000               RESP(WS-RESPONSE)
636100     END-EXEC
636200     MOVE WS-RESPONSE TO FILE-STATUS
636300     IF NOT SUCCESS
636400        MOVE 'P9130' TO ERR-PARAGRAPH
636500        PERFORM P9999-GOT-PROBLEM
636600     END-IF.
636700*=================================================================
636800 P9140-SETUP-SCR04S.
636900*=================================================================
637000     EXEC CICS XCTL
637100               PROGRAM(P04S-PGM)
637200               COMMAREA(PSTCOMM-AREA)
637300               LENGTH(PSTCOMM-LGTH)
637400               RESP(WS-RESPONSE)
637500     END-EXEC
637600     MOVE WS-RESPONSE TO FILE-STATUS
637700     IF NOT SUCCESS
637800        MOVE 'P9140' TO ERR-PARAGRAPH
637900        PERFORM P9999-GOT-PROBLEM
638000     END-IF.
638100*=================================================================
638200 P9150-SETUP-SCR997.
638300*=================================================================
638400     MOVE SPACES                        TO PSTCA-VARIABLE-AREA
638500     MOVE P08Z-PGM                      TO P997CA-FROM-PROGRAM
638600     SET P997CA-MSTR-BY-NAME            TO TRUE
638700     MOVE MSTR-VIA-EMP-NAME             TO P997CA-FILE
638800     MOVE MSTRENAM-RLGTH                TO P997CA-RLGTH
638900     MOVE MSTRENAM-KLGTH                TO P997CA-KLGTH
639000     MOVE SCR08Z-NAME                   TO P997CA-PASS-KEY
639100     EXEC CICS XCTL
639200               PROGRAM(P997-PGM)
639300               COMMAREA(PSTCOMM-AREA)
639400               LENGTH(PSTCOMM-LGTH)
639500               RESP(WS-RESPONSE)
639600     END-EXEC
639700     MOVE WS-RESPONSE                   TO FILE-STATUS
639800     IF NOT SUCCESS
639900        MOVE 'P9150-01'                 TO ERR-PARAGRAPH
640000        PERFORM P9999-GOT-PROBLEM
640100     END-IF.
640200*
640300 P9310-READ-UPDATE-VRUINFO.
640400*
640500     MOVE VRUINFO-KEY-AREA              TO VRUINFOKEY
640600     EXEC CICS READ
640700               UPDATE
640800               DATASET  (VRU-INFO-FILE)
640900               INTO     (VRUINFO-FILE)
641000               LENGTH   (VRU-INFO-TERM-RLGTH)
641100               RIDFLD   (VRUINFOKEY)
641200               KEYLENGTH(VRU-INFO-TERM-KLGTH)
641300               RESP     (WS-RESPONSE)
641400     END-EXEC
641500     MOVE WS-RESPONSE                   TO FILE-STATUS
641600     IF  NOT SUCCESS
641700     AND NOT NO-RECORD-FND
641800        MOVE 'P9310-1'                  TO ERR-PARAGRAPH
641900        MOVE VRUINFOKEY                 TO ERR-KEY
642000        PERFORM P9999-GOT-PROBLEM
642100     END-IF
642200     .
642300*
642400 P9320-REWRITE-VRUINFO.
642500*
642600     EXEC CICS REWRITE
642700               DATASET(VRU-INFO-FILE)
642800               FROM   (VRUINFO-FILE)
642900               LENGTH (VRU-INFO-TERM-RLGTH)
643000               RESP   (WS-RESPONSE)
643100     END-EXEC
643200     MOVE WS-RESPONSE                   TO FILE-STATUS
643300     IF NOT SUCCESS
643400        MOVE 'P9320-1'                  TO ERR-PARAGRAPH
643500        MOVE VRUINFOKEY                 TO ERR-KEY
643600        PERFORM P9999-GOT-PROBLEM
643700     END-IF
643800     .
643900*
644000 P9330-READ-VRUINFO.
644100*
644200     MOVE VRUINFO-KEY-AREA              TO VRUINFOKEY
644300     EXEC CICS READ
644400               DATASET  (VRU-INFO-FILE)
644500               INTO     (VRUINFO-FILE)
644600               LENGTH   (VRU-INFO-TERM-RLGTH)
644700               RIDFLD   (VRUINFOKEY)
644800               KEYLENGTH(VRU-INFO-TERM-KLGTH)
644900               RESP     (WS-RESPONSE)
645000     END-EXEC
645100     MOVE WS-RESPONSE                   TO FILE-STATUS
645200     IF  NOT SUCCESS
645300     AND NOT NO-RECORD-FND
645400        MOVE 'P9330-1'                  TO ERR-PARAGRAPH
645500        MOVE VRUINFOKEY                 TO ERR-KEY
645600        PERFORM P9999-GOT-PROBLEM
645700     END-IF
645800     .
645900*
646000 P9340-DELETE-VRUINFO.
646100*
646200     EXEC CICS DELETE
646300               DATASET(VRU-INFO-FILE)
646400               RIDFLD (VRUINFOKEY)
646500               RESP   (WS-RESPONSE)
646600     END-EXEC
646700
646800     MOVE WS-RESPONSE                   TO FILE-STATUS
646900     IF  NOT SUCCESS
647000     AND NOT NO-RECORD-FND
647100        MOVE 'P9340-1'                  TO ERR-PARAGRAPH
647200        MOVE VRUINFOKEY                 TO ERR-KEY
647300        MOVE SPACES                     TO ERR-SENTENCE
647400        PERFORM P9999-GOT-PROBLEM
647500     END-IF
647600     .
647700*
647800 P9400-CALL-PS94-PROGRAM.
647900*
648000     EXEC CICS LINK
648100               PROGRAM  (PS94-PGM)
648200               COMMAREA (PS94-COMMAREA-PARMS)
648300               LENGTH   (PS94-LGTH)
648400               RESP     (WS-RESPONSE)
648500     END-EXEC
648600
648700     MOVE WS-RESPONSE                   TO FILE-STATUS
648800     IF NOT SUCCESS
648900        MOVE 'P9400-S94'                TO ERR-PARAGRAPH
649000        PERFORM P9999-GOT-PROBLEM
649100     ELSE
649200        MOVE PS94-FILE-STATUS           TO FILE-STATUS
649300     END-IF
649400
649500     IF PS94-ERROR-ENCOUNTERED
649600        MOVE PS94-COMMAREA-PARMS(1:PSTCOMM-LGTH)
649700                  TO DFHCOMMAREA(1:PSTCOMM-LGTH)
649800        EXEC CICS RETURN END-EXEC
649900     END-IF.
650000*
650100*=================================================================
650200 P9500-WRITE-TSQUEUE.
650300*=================================================================
650400     MOVE EIBTRMID                      TO P08Z-TSQ-TERM
650500     EXEC CICS DELETEQ TS
650600               QUEUE(P08Z-TSQ-ID)
650700               RESP(WS-RESPONSE)
650800     END-EXEC
650900     MOVE WS-RESPONSE                   TO FILE-STATUS
651000     MOVE SPACES                        TO P08Z-TSQ-DATA
651100     MOVE PSTS08Z                       TO P08Z-TSQ-DATA
651200     MOVE PSTCOMM-AREA                  TO P08Z-TSQ-PSTCOMM-AREA
651300     MOVE P08ZCA-SCREEN-COMMAREA        TO P08Z-TSQ-SCREEN-AREA
651400     EXEC CICS WRITEQ TS
651500               QUEUE(P08Z-TSQ-ID)
651600               FROM(P08Z-TSQ-AREA)
651700               LENGTH(P08Z-TSQ-LGTH)
651800               ITEM(P08Z-TSQ-ITEM)
651900               RESP(WS-RESPONSE)
652000     END-EXEC
652100     MOVE WS-RESPONSE                   TO FILE-STATUS
652200     IF NOT SUCCESS
652300        MOVE 'P9500-01'                 TO ERR-PARAGRAPH
652400        PERFORM P9999-GOT-PROBLEM
652500     END-IF.
652600*=================================================================
652700 P9550-REWRITE-TSQUEUE.
652800*=================================================================
652900     MOVE EIBTRMID                      TO P08Z-TSQ-TERM
653000     MOVE PSTCOMM-AREA                  TO P08Z-TSQ-PSTCOMM-AREA
653100*CNC0600-B
653200     IF HOS-OVERRIDE-FUNC
653300        MOVE P08ZCOMM-AREA              TO P08Z-TSQ-SCREEN-AREA
653400     ELSE
653500*CNC0600-E
653600        MOVE P08ZCA-SCREEN-COMMAREA     TO P08Z-TSQ-SCREEN-AREA
653700*CNC0600-B
653800     END-IF
653900*CNC0600-E
654000     EXEC CICS WRITEQ TS
654100               QUEUE(P08Z-TSQ-ID)
654200               FROM(P08Z-TSQ-AREA)
654300               LENGTH(P08Z-TSQ-LGTH)
654400               ITEM(P08Z-TSQ-ITEM)
654500               REWRITE
654600               RESP(WS-RESPONSE)
654700     END-EXEC
654800     MOVE WS-RESPONSE                   TO FILE-STATUS
654900     IF NOT SUCCESS
655000        MOVE 'P9550-01'                 TO ERR-PARAGRAPH
655100        PERFORM P9999-GOT-PROBLEM
655200     END-IF.
655300*=================================================================
655400 P9600-READ-TSQUEUE.
655500*=================================================================
655600     MOVE EIBTRMID                      TO P08Z-TSQ-TERM
655700     EXEC CICS READQ TS
655800               QUEUE(P08Z-TSQ-ID)
655900               INTO(P08Z-TSQ-AREA)
656000               LENGTH(P08Z-TSQ-LGTH)
656100               ITEM(P08Z-TSQ-ITEM)
656200               RESP(WS-RESPONSE)
656300     END-EXEC
656400     MOVE WS-RESPONSE                   TO FILE-STATUS
656500     IF NOT SUCCESS
656600        MOVE 'P9600-01'                 TO ERR-PARAGRAPH
656700        PERFORM P9999-GOT-PROBLEM
656800     END-IF.
656900*=================================================================
657000 P9800-SETUP-SCR998.
657100*=================================================================
657200     MOVE SPACES            TO P998COMM-AREA
657300     MOVE P08Z-PGM          TO P998CA-FROM-PROGRAM
657400     MOVE P08Z-MAP          TO P998CA-SCREEN-ID
657500     MOVE EIBCPOSN          TO P998CA-CURSOR-POS
657600     EXEC CICS XCTL
657700               PROGRAM(P998-PGM)
657800               COMMAREA(PSTCOMM-AREA)
657900               LENGTH(PSTCOMM-LGTH)
658000               RESP(WS-RESPONSE)
658100     END-EXEC
658200     MOVE WS-RESPONSE       TO FILE-STATUS
658300     IF NOT SUCCESS
658400        MOVE 'P9800'        TO ERR-PARAGRAPH
658500        PERFORM P9999-GOT-PROBLEM
658600     END-IF.
658700*
658800 P9810-PROCESS-OFFSET.
658900*
659000     MOVE PSTCA-DT-OS-FUN       TO PARM-CONV-TYPE
659100     MOVE PSTCA-DT-OS-DAYS      TO PARM-SEC-JULIAN-DAY
659200     MOVE PSTCA-DT-OS-HRMN      TO PARM-SEC-HRMN
659300     EXEC CICS LINK
659400               PROGRAM(P903-PGM)
659500               COMMAREA(DATE-CONVERSION-PARMS)
659600               LENGTH(P903-LGTH)
659700               RESP(WS-RESPONSE)
659800     END-EXEC
659900     MOVE WS-RESPONSE           TO FILE-STATUS
660000     IF NOT SUCCESS
660100        MOVE 'P9810-1'          TO ERR-PARAGRAPH
660200        MOVE 'P903'             TO ERR-KEY
660300        PERFORM P9999-GOT-PROBLEM
660400     END-IF.
660500*
660600 P9990-CLEAR-SCREEN.
660700*
660800     EXEC CICS SEND CONTROL
660900                    ERASE
661000                    FREEKB
661100     END-EXEC
661200     EXEC CICS RETURN END-EXEC.
661300*
661400 P9999-GOT-PROBLEM.
661500*
661600     MOVE P08Z-PGM TO ERR-PROGRAM
661700     MOVE DFHEIBLK TO ERR-EIBLK
661800     EXEC CICS XCTL
661900               PROGRAM(PSTERR-PGM)
662000               COMMAREA(PSTERAR-AREA)
662100               LENGTH(PSTERAR-LGTH)
662200               RESP(WS-RESPONSE)
662300     END-EXEC
662400     EXEC CICS ABEND
662500               ABCODE(PSTERR-ABCODE)
662600               CANCEL
662700     END-EXEC.
662800*
662900 X9999-GOBACK.
663000     GOBACK.
663100*
663200     EXEC SQL INCLUDE HSTCUR02 END-EXEC.
663300     EXEC SQL INCLUDE HSTSHARE END-EXEC.
