000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. CNP925.
000300*****************************************************************
000400* C A L C U L A T E  E M P L O Y E E  R E S T  R E Q U I R E D  *
000500*****************************************************************
000600*  DATE   INITIAL  LOG#   DESCRIPTION
000700*-------- ------- ------  ---------------------------------------
000800*09/23/91   MOO           ORIGINAL.
000900*04/23/94   GER           TIMEZONE UPGRDES
001000*07/17/95   PLS  CNC0079  ADD PROCESSING FOR 'SPECIAL HELD AWAY'
001100*                         CALCULATIONS.  ALSO ADDED CHECK FOR
001200*                         OVERRIDING THE MISC. CLAIM CODE '11'
001300*                         FOR HELD AWAY, BASED ON THE STATION.
001400*03/22/96   PLS  CNC0114  ADD EXTENDED RUN HELDAWAY CALCULATION.
001500*05/30/96   PLS   A-169   IF MISCELLANEOUS CLAIM CODE FROM
001600*                         STATION TABLE NOT FOUND FOR HELDAWAY,
001700*                         DEFAULT TO '11' AND TRY TO FIND THAT
001800*                         CLAIM.  OTHERWISE DEFAULT TO 11 HOURS,
001900*                         STRAIGHT HELDAWAY.
002000*11/11/96   RCW   A-186   IF MISC CLAIM ISN'T FOUND FOR ANY
002100*                         COMBINATION ABOVE, DON'T BUILD HELDAWAY
002200*                         INFO.
002300*12/09/96   MFS           ADDED WSEDDATE/DATEEDIT COPYBOOKS TO
002400*                         FORMAT CENTURY FOR DATE COMPARISON.
002500*01/29/97   PLS  YEAR2000 ADJUST TKCR EXPIRATION FOR YEAR 2000.
002600*02/21/97   RCW  CNC0113  US PAYROLL
002700*04/30/97   JES  CNC0113  US PAYROLL - HELD AWAY ELAPSED TIME.
002800*07/07/97   GJK  CNC0134  PERS REST CALC UNDER TIE-UP RESTRICTED
002900*07/28/97   RCW  BUG      MEAL ALLOWANCE (HELDAWAY ELAPSED TIME)
003000*                         NOT CALCULATED WHEN NO HELDAWAY CLAIM.
003100*05/21/98   LMB  CNC0134  IF NO SCHEDULED TIMES SUPPLIED, DON'T
003200*                         DO ALT BOARD PLACEMENT LOGIC, EVEN IF
003300*                         SUB-DIST SPECIFIES ALT BOARD PLACEMENT
003400*                         APPLIES TO ASSIGNED JOBS.
003500*07/02/98   LMB  C-424    P4000 - COMPARE SCHED END TO OD-TIME,
003600*                         NOT SCHED TIME.
003700*07/02/98   LMB  C-421    P4000 - CONVERT SCHEDULED END TIME TO
003800*                         EMP TIME ZONE.
003900*07/10/98   LMB  C-425    RECOMPILE FOR NEW COPY BOOK
004000*08/05/98   LMB  C-426    GET SCHED-END-DATE FROM COMMAREA INSTEAD
004100*                         OF BUILDING IT.
004200*12/07/98   AMF           YEAR 2000 SWEEP.
004300*04/07/99   DCK           CHANGE TO ALLOW CNP983 RETRIEVE MISC
004400*                         CLAIM CONTROL RECS
004500*12/12/99   MOO  CNC0183  ADD CALCULATIONS FOR MTOY & MTOR.
004600*                         ALSO EXPAND COMMAREA AREA FROM 150
004700*                         TO 200 BYTES.
004800*09/26/00   PLS  BUG      INCLUDE HOURS FOR CANCEL AFTER WORKING
004900*                         OR CANCEL AFTER REPORTING, IN HOURS OF
005000*                         SERVICE CALCULATION.
005100*11/28/00   PLS  BUG      CORRECT CALC OF HOURS WHEN MINUTES = 60
005200*03/10/01   SWS  CNC0331  MANDATORY REST / HOURS OF SERVICE
005300*10/31/01   AJK  CNC0331A MANDATORY REST/HOS ADDENDUM A.
005400*05/01/02   BLD  CNC0361  HELDAWAY PAYMENT ENHANCEMENT.
005500*03/06/03   JAJ  CNC0331B ADD FUNCTION TO CALCULATE 24 IMPOSED
005600*                         REST PLUS ANY REST EXTENSION.
005700*05/16/03   JAJ  BUG C549 ACTUAL TIME DEFINITION DOES NOT APPLY
005800*                         TO US HOURS.
005900*09/02/03   TJR  BUG C549 IN RTN P2010-, MOVE DATE TO PRI, NOT SEC
006000*09/23/03   GER  C531     REST EDITS NOT BEING APPLIED ON SHFT-TIE
006100*03/11/04   NRL  CNC0331F ADD FUNCTION TO CALCULATE ACTUAL TIME.
006200*04/08/04   AJK  CNC0331G RESPITE PERIOD CALCULATIONS.
006300*05/10/04   AJK           CHECK FOR EXISTENCE OF EMPTOD-DIST
006400*                         BEFORE LOOKING UP SUB-DISTRICT CNTL REC.
006500*                         ALWAYS PERFORM THE UNINTERRUPTED REST
006600*                         EDITS IN P6110, REGARDLESS OF THE EMP'S
006700*                         STATUS (RED, YELLOW)
006800*07/06/04   NRL  C591     RETRIEVE THE LEAD TIME BASED ON THE TRCN
006900*                         POOL CREWING TERMINAL NUMBER.
007000*08/10/04   NRL  C598     UNINTERRUPTED REST COMPARE NOT USING
007100*                         DAYS IF REST IS GREATER THAN 24 HOURS.
007200*08/24/04   AJK           ALWAYS CONSIDER LOCAL ASGNS TO BE AT
007300*                         HOME WHEN PERFORMING THE 64/7 MTOD
007400*                         CHECK.
007500*09/14/04   AJK           BEGIN USING EMPTOD RECORDS FROM 48 HRS.
007600*                         EARLIER RATHER THAN 24 HRS. EARLIER
007700*                         WHEN GATHERING UP ALL OF THE APPLICABLE
007800*                         LOG ENTRIES (P6110).
007900*09/28/04   TRK  CNC0387  COMMUTER HOS RULES.
008000*10/15/04   KJS  CNC0386A BYPASS 24 HOUR PERSONAL REST LIMIT FOR
008100*                         BC RAIL EMPLOYEES
008200*04/05/05   AJK  CNC0331I 3 HOUR BREAK ENH.
008300*05/05/05   MET  CNC0331H HOURS OF SERVICE CLAIMS.
008400*05/12/05   MET  CNC0391  INCLUSION/EXCLUSION OF PREPARATORY TIME
008500*05/31/05   AJK           REWORK P6460 AND 6480 (INCL/EXCL PREP
008600*                         TIME FOR COMMUTERS AND YARDS).
008700*06/17/05   AJK           ONLY EXCLUDE LEAD TIME FROM TTW CALCS
008800*                         FOR REGULAR OWNERS OF GO TRAINS (P6130).
008900*06/29/05   MET           IN P6420, P6460 AND P6480 CHECK IF
009000*                         ORDER DATE AND ON DUTY DATE ARE > ZERO.
009100*08/09/05   AJK           IGNORE LEAD TIME FOR REGULAR OWNERS OF
009200*                         COMMUTER (GO-TRAIN) ASSIGNMENTS, EVEN
009300*                         IF THEY'RE BEING VACANCY FILLED TO THIER
009400*                         OWN JOB.
009500*09/15/05   VER  CNC0396  HOS MAY NOW SPAN 36 HOURS.
009600*                           MUST CHECK THE PARM-RES-TOT-DAYS
009700*                           FIELD TO SEE IF IT IS GREATER THAN
009800*                           ZERO. IF > ZERO, THEN WE MUST
009900*                           ADD IN 24 HOURS FOR EACH "DAY" ALONG
010000*                           WITH THE HOURS AND MINUTES RETURNED
010100*                           FROM P903 IN THE PARM-RES-HRMN FIELD
010200*                           TO ENDURE PROPER MTOD CALULATIONS.
010300*                          CHANGE FLAG = @CNC0396
010400*09/19/05   AJK           CORRECT P3015 LOGIC TO HANDLE TRIPS
010500*                         'SPLIT' DUE TO RESPITE
010600*10/05/05   AJK  C634     P6110 - START BROWSING THROUGH EMPTOD
010700*                         RECORD 80 HRS PRIOR TO CALL TIME, AS
010800*                         OPPOSED TO 48 HRS.  THIS WILL ADDRESS
010900*                         18/24 HR. LOGIC HOLE.
011000*02/21/06   AJK  C648     IGNORE LEAD TIME FOR EMPLOYEES FILLING
011100*                         ON TO A COMMUTER ASSIGNMENT IF IT'S
011200*                         THE SAME AS THEIR REGULAR ASSIGNMENT
011300*                         EXCEPT FOR THE CRAFT (AC IS BOOSTING UP
011400*                         TO CO POSITION, FOR EXAMPLE).
011500*05/23/06   AJK  C641     64/7 EDIT CHANGES: REWORK HOW SYSTEM
011600*                         DETERMINES IF AN EMPLOYEE IS BEING
011700*                         CALLED FROM THE HOME TERMINAL.  USE
011800*                         P925-TERM IN CONJUNCTION WITH THE
011900*                         EXISTENCE (OR NOT) OF A FURTHER NOTICE
012000*                         ASSIGNMENT.
012100*12/26/06   JES  CNC0413  INCLUDE/EXCLUDE VIRTUAL TOD RECORDS
012200*                         BASED ON CALLING PROGRAM COMM FLAG.
012300*05/02/07   AJK  CNC0413  IF WE PASS IN A LEAD TIME, USE IT.
012400*05/29/07   RAL  CNC0331E DON'T PERFORM 64/7 EDIT FOR OWNERS
012500*                         OF WORK TRAINS JOBS
012600*06/22/07   RAL  CNC0331E BYPASS LEAD TIME CALCS IF FLAGS SET
012700*                         INDICATE "IGNORE LEAD TIME"
012800*07/13/07   RAL  CNC0331E USE ADJ ONDUTY TIME FOR HOS IF > ORDERED
012900*08/29/07   RAL  CNC0331E MTOD STARTS AT 6401, NOT AT 6400
013000*08/31/07   JLH  CNC0331E WORK TRAIN MUST BE ON SAME TURN
013100*11/18/07   KAD  CNC0429  USE APPLY LIMBO TO TTOD FLAG
013200*                        (LIMBO IS BETWEEN WORK-ENDED & OFF-DUTY)
013300*                        +IF Y, TTOD = ON-DUTY  THRU  OFF-DUTY.
013400*                        +IF N, TTOD = ON-DUTY  THRU  WORK-ENDED.
013500*02/14/07   SXK  CNC0453  LOOK FOR A MATCHING PERSONAL REST EDIT
013600*                         RECORD BASED ON THE CURRENT ASSIGNMENT
013700*                         INSTEAD OF ON-DUTY ASSIGNMENT.
013800*03/04/08   AJK           COURTESY FIX: CN NO LONGER WANTS U.S.
013900*                         TTOD CALCULATIONS TO USE WORK BEGAN
014000*                         TIMES.  ON-DUTY SHOULD BE USED, INSTEAD.
014100*                         (P1010)
014200*04/23/08   SXK  CNC0453  CHANGED SEARCH CRITERIA LOGIC TO CHECK
014300*                         THE JOB TYPE FOR ROAD SWITCHER (RS).
014400*                         PASS BACK THE MIN/MAX REST VALUES.
014500*05/06/08   AJK  CNC0453  REVAMP PERS REST SEARCH PROCESS TO LOOP
014600*                         THROUGH AS MANY RECORDS AS NEEDED IN
014700*                         ORDER TO FIND THE RIGHT MATCH.
014800*                         ALSO, REMOVE PERSONAL REST BYPASS EDITS
014900*                         FOR BC RAIL EMPLOYEES.  THE CN WOULD
015000*                         NOW LIKE TO BE ABLE TO CONTROL ALL
015100*                         PERSONAL REST THROUGH THE CONTROL TABLE
015200*                         SETTINGS, REGARDLESS OF COMPANY CODE.
015300*04/13/09   MXS  CNC0484  MODIFY US REST CALCULATIONS FOR TIE-UP
015400*                         PROCESSING
015500*06/12/09   RXS  CNC0484  ADDED P925-US-PREV-TOT-DUTY IN P925COMM
015600*01/08/10   BLD  COURTESY DO NOT ADJUST THE ERT BY ON DUTY TIME
015700*02/19/10   SZV  C853     A CREW PROFILE THAT HAS THE REST REQ
015800*                         FLAG SET TO 'C' FOR CANADIAN EMPS
015900*                         OR 'B' FOR BOTH CANADIAN AND US EMPS ARE
016000*                         APPLICABLE FOR THE 64/7 RULE.
016100*03/26/12   AXK  CNC0524  CALCULATE TTA VALUE IN DATE/TIME FORMAT
016200*08/13/13   AXK  CNC0531   == RECOMPILE ONLY ==
016300*                         ADDED YARD CRAFTS Y0-Y9 AND YT
016400*03/07/14   BXS  CNC0544  USE EST-RUN-TM FROM ALT CREW SOURCE
016500*07/21/14   BLD  C948     WHEN DETERMINING UDR USED OD TIME WHEN
016600*                         MORE THAN 15 BEFORE ORDER TIME, ELSE
016700*                         USE ORDER TIME.
016800*07/21/14   BLD  C949     REWORK PARAGRAPH P6160 SO THAT TTA-DTTM
016900*                         IS CALCULATED REGARDLESS OF WHETHER PREP
017000*                         TIME EXISTS OR NOT.
017100*03/11/16   MFO  CNC0575  CHK FOR ALT H/A CODES WHEN CALC HELDAWAY
017200*03/16/16   RXB  C1117    ADD LOGIC TO CALCULATE THE CORRECT
017300*                         US REST APPLICABLE TO HOS OF DUTY
017400*06/07/16   RXB  CNC0533  PERSONAL REST EDITS ENHANCEMENT
017500*03/12/19   MFO  C1207    CHK P925-ALT-CREW-EST-RUN-TM POPULATED
017600*02/24/23   SXP  CNC0598  WRR PHASE 1: WHEN THE FLAG IS SET TO NEW
017700*                         POPULATE THE FIXED MTOD FOR EVERY TOUR
017800*                         AND SPACEOUT MTOY AND MTOR FIELDS
017900*03/10/23   SXP  CNC0600  WRR PHASE 2: CHANGED TTOD LIMITS TO
018000*                         60,192 HRS IN 7,28 DAYS RESPECTIVELY.
018100*03/17/23   RJA  CNC0600  G.15 INCLUDE PREP/FINAL TIME IN HOS CALC
018200*04/11/23   SXP  CNC0600  SET STATUS TO RED WHEN EMP IS PRESENTED
018300*                         DURING HIS UNDISTURBED PERIODS
018400*05/02/23   DXC  CNLD-207 ADD EMP WILL RESET SHORLTY MSG AND
018500*                         PROHIBIT CALL WHEN P925-LOCAL-LT-RESET.
018600*05/08/23   RJA  CNLD-214 CHECK PREVIOUS HOS' NATURAL RESETS
018700*05/12/23   SXP  CNLD-230 SET REASON FOR RED FLAGS FOR 7 DAY EDITS
018800*05/13/23   RJA  CNLD-230 ADD ERT CHECK AGAINST 60/192 CLOCK;
018900*                         ADD MORE REASON FOR RED FLAGS.
019000*05/22/23   SKG  CNLD-238 ADD OUTPOST CHECK TO UPDATE MTOD BASED
019100*                         ON THE TRCN-OUTPOST-FL.
019200*06/05/23   RJA  CNLD-251 ALL EMPS MUST AVAIL MIN 2HR LEAD TIME
019300*                         FROM MTOD TO ON-DUTY TIME.
019400*                         IF IGNORE-LEAD-TIME IS TRUE ON CREW-PROF
019500*                         OR POOL, REG OWNERS NEEDN'T AVAIL LEAD
019600*                         TIME TO BE CONSIDERED NATURALLY RESTED.
019700*06/05/23   RJA  CNLD-244 EMPLOYEES SHOULD BE RESTED FOR ON-DUTY
019800*                      #3 TIME (PER EARLIER SPEC THEY NEEDED TO BE
019900*                         RESTED FOR ORDER TIME)
020000*06/06/23   DXC  CNLD-253 FIX EXTND MTOD WHEN TOUR TIME EXCEDES 24
020100*                         HOURS.
020200*06/15/23   DXC  CNLD-250 DO NOT APPLY LOCAL TIME EDITS WHEN BOOST
020300*                         EMPLOYEES.
020400*06/20/23   DXC  CNLD-257 7/28 DAYS MESSAGE CHANGE
020500*06/26/23   RJA  CNLD-259 E95 DUEBACK IS END OF MSTR3-SYSTEM-UD2,
020600*                         BUT EMP CANNOT BE PUT ON-DUTY UNTIL
020700*                         AFTER MSTR3-SYSTEM-RESET-BRK;
020800*                         IF RESET STARTS AT 0000, IT SHOULD END
020900*                         AT 0759 THE NEXT DAY - DURATION IN THIS
021000*                         CASE WILL BE 31 HR 59 MIN INSTEAD OF A
021100*                         32 HR MINIMUM.
021200*07/14/23   SXP  CNLD-265 RETURN STATUS RED WHEN PERS REST >
021300*                         ORDER MINUS LEAD TIME.
021400*07/26/23   RJA  CNLD-269 USING DECISION RULE FLAGS TO IDENTIFY
021500*                         PROMOTED(BOOSTED) EMPLOYEE
021600*10/02/23   RJA  CNLD-280 SET AT-HOME-TERM WHEN TEMP-ASSIGNMENT
021700*                         IS NOT FURTHER NOTICED.
021800*11/01/23   SXM  CNLD-274 USE ESTIMATED LEFTOVER TIME TO CALC
021900*                         7DAYS ERT INSTEAD OF 10 HOURS
      *01/17/24   RJA  CNLD-304 MINIMUM RESET DURATION IS CHANGED FROM
      *                         3200 TO 3159.
      *02/07/24   NRK  CNLD-271 FIX TOPC FEED: MODIFY "TIE-UP BY" TIME
      *                         CALCULATION TO ALWAYS USE ON-DUTY TIME.
      *02/20/24   RJA  CNLD-287 WITH NEW WRR, P925-CALC-TTW-ONLY FUNC
      *                         IS OBSOLETE; ALSO COMMENTING SOME CODE
      *                         THAT'S NO LONGER REQUIRED WITH NEW WRR.
000910*           RJA  CNLD-310 MODIFY P925-RECALC-CAN-HRS-SVC FOR
000910*                         HOS CLAIMS WRT NEW WRR.
000910*07/08/24   RJA  CNLD-334 SET REST EXTENSION FLAGS FOR HOS CLAIMS.
      *07/22/24   RJA  CNLD-302 IMPOSED REST IS OBSOLETE PER NEW WRR.
      *                         REMOVING RELATED CODE.
009000*08/16/24   RJA  CNLD-309 MTOY AND MTOR ARE OBSOLETE.
022000*****************************************************************
022100 ENVIRONMENT DIVISION.
022200 CONFIGURATION SECTION.
022300 SOURCE-COMPUTER. IBM-9370.
022400 OBJECT-COMPUTER. IBM-9370.
022500 DATA DIVISION.
022600 WORKING-STORAGE SECTION.
022700 01  FILLER                   PIC X(10)  VALUE 'P925 W/S'.
022800
022900 01  WS-FLAGS.
023000     02  WS-DONE-CODE                  PIC X(001) VALUE 'N'.
023100         88  NOT-DONE                             VALUE 'N'.
023200         88  DONE                                 VALUE 'Y'.
023300     02  WS-MISC-CLM-FLAG              PIC X(001) VALUE ' '.
023400         88  MISC-CLM-FOUND                       VALUE '1'.
023500         88  MISC-CLM-NOT-FOUND                   VALUE ' '.
023600     02  WS-ENTRY-FOUND-FLAG           PIC X(001) VALUE 'N'.
023700         88  ENTRY-FOUND                          VALUE 'Y'.
023800         88  ENTRY-NOT-FOUND                      VALUE 'N'.
023900     02  WS-JOB-TYPE-FOUND-FLAG        PIC X(001) VALUE 'N'.
024000         88  JOB-TYPE-FOUND                       VALUE 'Y'.
024100         88  JOB-TYPE-NOT-FOUND                   VALUE 'N'.
024200     02  WS-HIST-DONE-CODE             PIC X(001) VALUE 'N'.
024300         88  HIST-DONE                            VALUE 'Y'.
024400         88  HIST-NOT-DONE                        VALUE 'N'.
024500     02  WS-TOD-DONE-CODE              PIC X(001) VALUE 'N'.
024600         88  TOD-DONE                             VALUE 'Y'.
024700         88  TOD-NOT-DONE                         VALUE 'N'.
024800     02  WS-AHM-DONE-CODE              PIC X(001) VALUE 'N'.
024900         88  AHM-DONE                             VALUE 'Y'.
025000     02  HSVC-FOUND-CODE               PIC 9(001) VALUE ZERO.
025100         88  HSVC-FOUND                           VALUE 1.
025200     02  AT-HOME-TERM-FLAG             PIC X(001) VALUE 'N'.
025300         88  NOT-AT-HOME-TERM                     VALUE 'N'.
025400         88  AT-HOME-TERM                         VALUE 'Y'.
396200*CNLD-287-B COMMENTING
025500*    02  WS-RED-STATUS-FLAG            PIC X(001) VALUE SPACES.
025600*        88  WS-RED-STATUS                        VALUE 'Y'.
025700*    02  WS-YELLOW-STATUS-FLAG         PIC X(001) VALUE SPACES.
025800*        88  WS-YELLOW-STATUS                     VALUE 'Y'.
025900*    02  WS-GREEN-STATUS-FLAG          PIC X(001) VALUE SPACES.
026000*        88  WS-GREEN-STATUS                      VALUE 'Y'.
396200*CNLD-287-E
026100     02  TRCN-FOUND-FLAG               PIC X(001) VALUE 'N'.
026200         88  TRCN-NOT-FOUND                       VALUE 'N'.
026300         88  TRCN-FOUND                           VALUE 'Y'.
026400     02  SHIFT-CALLED-FLAG             PIC X(001) VALUE SPACES.
026500         88  SHIFT-CALLED                         VALUE 'Y'.
026600     02  VACANCY-FILLED-FLAG           PIC X(001) VALUE SPACES.
026700         88  VACANCY-FILLED                       VALUE 'Y'.
026800     02  SPLIT-SHIFT-FLAG              PIC X(001) VALUE SPACES.
026900         88  NOT-SPLIT-SHIFT                      VALUE 'N'.
027000         88  SPLIT-SHIFT                          VALUE 'Y'.
027100     02  WS-ADJUST-ERT-FLAG            PIC X(001) VALUE SPACES.
027200         88  WS-ADJUST-ERT                        VALUE 'Y'.
027300     02  DEADHEAD-FOUND-FLAG           PIC X(001) VALUE 'N'.
027400         88  DEADHEAD-FOUND                       VALUE 'Y'.
027500         88  NO-DEADHEAD-FOUND                    VALUE 'N'.
027600     02  POINTER-DONE-FLAG             PIC X(001) VALUE 'N'.
027700         88  POINTER-DONE                         VALUE 'Y'.
027800         88  POINTER-NOT-DONE                     VALUE 'N'.
027900     02  ASGN-TO-WRKTRN-POOL-FLAG      PIC X(001) VALUE ' '.
028000         88  ASGN-TO-WRKTRN-POOL                  VALUE 'Y'.
028100     02  IGNORE-LEAD-TIME-FLAG         PIC X(001) VALUE ' '.
028200         88  IGNORE-LEAD-TIME                     VALUE 'Y'.
028300     02  FIRST-TIME-FLAG               PIC X(001) VALUE 'Y'.
028400         88  FIRST-TIME-YES                       VALUE 'Y'.
028500         88  FIRST-TIME-NO                        VALUE 'N'.
028600     02  CRAFT-DONE-FLAG               PIC X(001) VALUE 'N'.
028700         88  CRAFT-NOT-DONE                       VALUE 'N'.
028800         88  CRAFT-DONE                           VALUE 'Y'.
028900     02  CC-WORKED-FLAG                PIC X(001) VALUE 'N'.
029000         88  CC-WORKED-NOT-FOUND                  VALUE 'N'.
029100         88  CC-WORKED-FOUND                      VALUE 'Y'.
029200     02  CNTL-REC-FOUND-FLAG           PIC X(001) VALUE 'N'.
029300         88  CNTL-REC-NOT-FOUND                   VALUE 'N'.
029400         88  CNTL-REC-FOUND                       VALUE 'Y'.
029500     02  WS-HS-US-ACTIVATE-FL          PIC X(001) VALUE 'N'.
029600         88 WS-HS-US-ACTIVATE                     VALUE 'Y'.
029700     02  WS-US-DOM-FLAG                PIC X(001) VALUE 'N'.
029800         88  WS-US-DOM-YES                        VALUE 'Y'.
029900     02  WS-HOS-RULE-FLAG              PIC X(001) VALUE 'N'.
030000         88  DONT-CHECK-HOS-RULE                  VALUE 'N'.
030100         88  CHECK-HOS-RULE                       VALUE 'Y'.
030200*CNC0598-B
030300     02  WS-CAN-WRR-FLAG               PIC X(001) VALUE ' '.
030400         88  WS-CAN-WRR-NEW                       VALUE 'N'.
030500*CNC0598-E
030600*CNC0600-B
030700     02  WS-TIEUP-HOME-FLAG            PIC X(001) VALUE ' '.
030800         88  WS-TIEUP-HOME                        VALUE 'Y'.
030900     02  WS-CURRENT-TOUR-FLAG          PIC X(001) VALUE ' '.
031000         88  WS-CURRENT-TOUR                      VALUE 'Y'.
031100*CNC0600-E
031200*
031300*CNLD-207-DXC-B
031400     02  EMP-RST-IN-HR-FLAG            PIC X(001) VALUE 'N'.
031500         88  EMP-RST-IN-HR-YES                    VALUE 'Y'.
031600     02  MORE-THAN-1-DAY-FLAG          PIC X(001) VALUE 'N'.
031700         88  MORE-THAN-1-DAY-YES                  VALUE 'Y'.
031800         88  MORE-THAN-1-DAY-NO                   VALUE 'N'.
031900*CNLD-207-DXC-E
032000* CNLD-214 B CNC0600
032100     02  WS-READ-DONE-CODE             PIC X(001) VALUE SPACES.
032200         88  READ-DONE                            VALUE 'Y'.
032300     02  DONT-CHECK-RB-OR-7D-FL        PIC X(001) VALUE SPACES.
032400         88  DONT-CHECK-RB-OR-7D                  VALUE 'Y'.
032500* CNLD-214 E
032600*CNLD-230-B
032700     02  WS-OUTPOST-HOME-FL            PIC X(001) VALUE SPACES.
032800         88  WS-OUTPOST-HOME                      VALUE 'Y'.
032900*CNLD-230-E
033000
033100*CNLD-238-B
033200     02  WS-OUTPOST-FL                 PIC X(001) VALUE SPACES.
033300         88  WS-ASGN-IS-OUTPOST                   VALUE 'Y'.
033400     02  WS-HOME-IS-AN-OUTPOST-FL      PIC X(001) VALUE SPACES.
033500         88  WS-HOME-IS-AN-OUTPOST                VALUE 'Y'.
033600*CNLD-238-E
033700
033800*07/26/23 RJA B CNC0600 CNLD-269
033900**CNLD-250-DXC-B
034000*     02  BOOSTED-EMPL-FLAG           PIC X(001) VALUE 'N'.
034100*         88  BOOSTED-EMPL-YES                   VALUE 'Y'.
034200*     02  WS-REC-FLAG                 PIC X(001) VALUE 'N'.
034300*         88  WS-REC-FND                         VALUE 'Y'.
034400*     02  WS-BOOSTED-EMP-SM-ASGN-FL   PIC X(001) VALUE 'N'.
034500*         88  WS-BOOSTED-EMP-SM-ASGN-YES         VALUE 'Y'.
034600**CNLD-250-DXC-E
034700*07/26/23 RJA E
034800
034900*07/26/23 RJA B CNC0600 CNLD-269
035000     02  PROMOTING-EMP-IGNORE-LD-TM-FL PIC X(001) VALUE 'N'.
035100         88  PROMOTING-EMP-IGNORE-LD-TM           VALUE 'Y'.
035200*07/26/23 RJA E
035300
035400*RJA  5/17/2023 B CNC0600
035500 01  WS-WRR-START-DTTM.
035600     05  WS-WRR-START-DATE             PIC X(06)  VALUE SPACES.
035700     05  WS-WRR-START-TIME             PIC X(04)  VALUE SPACES.
035800 01  WS-8DAYS-AGO-DTTM.
035900     05  WS-8DAYS-AGO-DATE             PIC X(06)  VALUE SPACES.
036000     05  WS-8DAYS-AGO-TIME             PIC X(04)  VALUE SPACES.
036100*RJA  5/17/2023 E
036200
036300* CNLD-214 B CNC0600
036400 01  WS-7DAY-START-DTTM.
036500     05  WS-7DAY-START-DATE            PIC X(06)  VALUE SPACES.
036600     05  WS-7DAY-START-TIME            PIC X(04)  VALUE SPACES.
036700 01  WS-WRR-7DAY-END.
036800     05  WS-WRR-7DAY-END-DATE          PIC X(06)  VALUE SPACES.
036900     05  WS-WRR-7DAY-END-TIME          PIC X(04)  VALUE SPACES.
037000 01  WS-EMP-EFF-DATE-TIME                         VALUE SPACES.
037100     05  WS-EMP-EFF-DATE               PIC X(006).
037200     05  WS-EMP-EFF-TIME               PIC X(004).
037300 01  LAST-EMPTOD-OFFD-YYMMDD-HRMN      PIC X(10)  VALUE SPACES.
037400 01  NATURAL-RESET-AT-CALL-FL          PIC X(01)  VALUE SPACES.
037500     88  NATURAL-RESET-AT-CALL                    VALUE 'A'.
037600 01  NATURAL-RESET-BEFORE-CALL-FL      PIC X(01)  VALUE SPACES.
037700     88  NATURAL-RESET-BEFORE-CALL                VALUE 'B'.
037800* CNLD-214 E
037900 01  WS-TERM-CHECK                     PIC X(001).
038000     88  HOME-TERM                                VALUE '0'.
038100     88  AWAY-TERM                                VALUE '1'
038200                                                        '2'
038300                                                        '3'
038400                                                        '4'
038500                                                        '5'.
038600
038700 01  WS-SUBSCRIPTS.
038800     02  SUB1                          PIC S9(004) COMP VALUE +0.
038900     02  SUB2                          PIC  9(002)      VALUE 0.
039000     02  HSUB                          PIC S9(004) COMP VALUE +0.
039100     02  I                             PIC 9(002)       VALUE 0.
039200     02  J                             PIC 9(002)       VALUE 0.
039300     02  ARRAY-MAX                     PIC 9(002)       VALUE 10.
039400*CNC0575 - BEG
039500     02  SUB3                          PIC 9(002)       VALUE 0.
039600     02  SUB3-MAX                      PIC 9(002)       VALUE 03.
039700     02  SUB4                          PIC 9(002)       VALUE 0.
039800     02  SUB4-MAX                      PIC 9(002)       VALUE 08.
039900*CNC0575 - END
040000
040100*07/26/23 RJA B CNC0600 CNLD-269
040200**CNLD-250-DXC-B
040300*    02  K                             PIC 9(002)     VALUE ZEROS.
040400**CNLD-250-DXC-E
040500*07/26/23 RJA E
040600
040700*\/* - BEGIN - @CNC0396 - NEW WS FIELDS
040800 01  WS-CNC0396-CALC-FIELDS.
040900     05  WS-TOT-DAYS                 PIC 9(5).
041000     05  WS-TOT-HOURS                PIC 9(4).
041100     05  WS-REMAINDER-HOURS          PIC 9(4).
041200*/\* - END   - @CNC0396
041300
041400*07/26/23 RJA B CNC0600 CNLD-269
041500**CNLD-250-DXC-B
041600* 01  WS-CNLD251-FIELDS.
041700*     05  WS-CALL-DAY                 PIC 9(3)   VALUE ZERO.
041800*     05  ASSGN-OWNER-SCHDL           PIC 9(4)   VALUE ZERO.
041900*     05  SEL-EMP-SCHDL               PIC 9(4)   VALUE ZERO.
042000*     05  WS-JSK-1-KEY                PIC X(12)  VALUE SPACES.
042100**CNLD-250-DXC-E
042200*07/26/23 RJA E
042300*
042400*CNC0600-B
042500 01  WS-CNC0600-CALC-FIELDS.
042600     02  TEMP-TIME1                  PIC 9(005) VALUE ZERO.
042700     02  TEMP-TIME1-SPLIT
042800         REDEFINES TEMP-TIME1.
042900         04  TEMP-TIME1-HR           PIC 9(003).
043000         04  TEMP-TIME1-MN           PIC 9(002).
043100     02  FILLER
043200         REDEFINES TEMP-TIME1.
043300         04  FILLER                  PIC 9(001).
043400         04  TEMP-TIME1-4            PIC 9(004).
043500     02  TEMP-CALC-MNS               PIC 9(003) VALUE ZEROES.
043600*CNC0600-E
043700*CNLD-274-B
043800 01  WS-EST-LAYOVER-TIME             PIC 9(004) VALUE ZEROES.
043900*CNLD-274-E
044000
044100 01  WS-EMP-WORK-AREA.
044200     02  WS-EMP-TIME-ZONE              PIC X(001).
044300     02  WORK-EMP-MTOD                 PIC 9(004).
044400     02  WORK-EMP-LAST-MTOD            PIC 9(004).
044500     02  WORK-EMP-4HR-BREAK-FLAG       PIC X(001).
044600         88  EMP-HAD-4HR-BREAK             VALUE 'Y'.
044700     02  WORK-EMP-3HR-BREAK-FLAG       PIC X(001) VALUE SPACES.
044800         88  EMP-HAD-3HR-BREAK             VALUE 'Y'.
044900     02  WS-RESPITE-FROM-DTTM.
045000         04  WS-RESPITE-FROM-DATE-CENT.
045100             06  WS-RESPITE-FROM-CC     PIC X(002) VALUE SPACES.
045200             06  WS-RESPITE-FROM-DATE.
045300                 08  WS-RESPITE-FROM-YY PIC X(002) VALUE SPACES.
045400                 08  WS-RESPITE-FROM-MM PIC X(002) VALUE SPACES.
045500                 08  WS-RESPITE-FROM-DD PIC X(002) VALUE SPACES.
045600         04  WS-RESPITE-FROM-TIME.
045700             06  WS-RESPITE-FROM-HR     PIC X(002) VALUE SPACES.
045800             06  WS-RESPITE-FROM-MN     PIC X(002) VALUE SPACES.
045900     02  WS-RESPITE-TO-DTTM.
046000         04  WS-RESPITE-TO-DATE-CENT.
046100             06  WS-RESPITE-TO-CC       PIC X(002) VALUE SPACES.
046200             06  WS-RESPITE-TO-DATE.
046300                 08  WS-RESPITE-TO-YY   PIC X(002) VALUE SPACES.
046400                 08  WS-RESPITE-TO-MM   PIC X(002) VALUE SPACES.
046500                 08  WS-RESPITE-TO-DD   PIC X(002) VALUE SPACES.
046600         04  WS-RESPITE-TO-TIME.
046700             06  WS-RESPITE-TO-HR       PIC X(002) VALUE SPACES.
046800             06  WS-RESPITE-TO-MN       PIC X(002) VALUE SPACES.
046900
047000     02  WORK-TIME.
047100         04  WORK-HR                   PIC 9(002) VALUE ZEROS.
047200         04  WORK-MN                   PIC 9(002) VALUE ZEROS.
047300     02  WORK-TIME-NUM REDEFINES
047400         WORK-TIME                     PIC 9(004).
047500     02  WORK-TIME1                    PIC 9(005) VALUE ZERO.
047600     02  WORK-TIME1-SPLIT
047700         REDEFINES WORK-TIME1.
047800         04  WORK-TIME1-HR             PIC 9(003).
047900         04  WORK-TIME1-MN             PIC 9(002).
048000     02  FILLER
048100         REDEFINES WORK-TIME1.
048200         04  FILLER                    PIC 9(001).
048300         04  WORK-TIME1-4              PIC 9(004).
048400     02  WORK-TIME2                    PIC 9(005).
048500     02  WORK-TIME2-SPLIT
048600         REDEFINES WORK-TIME2.
048700         04  WORK-TIME2-HR             PIC 9(003).
048800         04  WORK-TIME2-MN             PIC 9(002).
048900     02  FILLER
049000         REDEFINES WORK-TIME2.
049100         04  FILLER                    PIC 9(001).
049200         04  WORK-TIME2-4              PIC 9(004).
049300     02  WORK-TIME3                    PIC 9(005).
049400     02  CALC-HRS                      PIC 9(002) VALUE ZEROES.
049500     02  CALC-MNS                      PIC 9(003) VALUE ZEROES.
049600     02  WORK-MISC-CLM-KEY.
049700         04  WORK-MISC-CLM-REC-TYPE    PIC X(002).
049800         04  WORK-MISC-CLAIM-CD        PIC X(002).
049900         04  WORK-MISC-CRAFT-CD        PIC X(002).
050000         04  WORK-MISC-JOB-TYPE        PIC X(002).
050100         04  WORK-MISC-DIST            PIC X(002).
050200         04  WORK-MISC-SDIST           PIC X(002).
050300         04  FILLER                    PIC X(010).
050400         04  WORK-MISC-CLM-EXP-DATE-CENT.
050500             08  WORK-MISC-CLM-EXP-CE      PIC X(002).
050600             08  WORK-MISC-CLM-EXP-DATE    PIC X(006).
050700     02  WORK-HELDAWAY-GROUP.
050800         04  WORK-HELDAWAY-CALC          PIC X(001) VALUE SPACES.
050900             88  WORK-SPEC-HELDAWAY-CALC-USED       VALUE 'A' 'B'
051000                                                      'C' 'X' 'Y'.
051100             88  WORK-USE-HELDAWAY-9-11             VALUE 'A'.
051200             88  WORK-USE-HELDAWAY-9-14             VALUE 'B'.
051300             88  WORK-USE-HELDAWAY-11-15            VALUE 'C'.
051400             88  WORK-USE-SPEC-HELDAWAY-CALC        VALUE 'Y'.
051500             88  WORK-USE-EXTENDED-RUN-CALC         VALUE 'X'.
051600         04  WORK-HELDAWAY-CLAIM-CODE    PIC X(002) VALUE SPACES.
051700         04  WORK-HELD-AWAY-LIMIT        PIC 9(004) VALUE ZERO.
051800         04  FILLER REDEFINES WORK-HELD-AWAY-LIMIT.
051900             06  WORK-HELD-AWAY-LIMIT-HR PIC 9(002).
052000             06  WORK-HELD-AWAY-LIMIT-MN PIC 9(002).
052100         04  WORK-HELD-AWAY-EXTRN.
052200             06  WORK-HELD-AWAY-EXTRN-HR PIC 9(002) VALUE ZERO.
052300             06  WORK-HELD-AWAY-EXTRN-MN PIC 9(002) VALUE ZERO.
052400     02  WORK-HELD-AWAY-ELAPSED        PIC 9(005) VALUE ZERO.
052500     02  FILLER REDEFINES WORK-HELD-AWAY-ELAPSED.
052600         04  WORK-HELD-AWAY-ELAPSED-HR PIC 9(003).
052700         04  WORK-HELD-AWAY-ELAPSED-MN PIC 9(002).
052800     02  FILLER REDEFINES WORK-HELD-AWAY-ELAPSED.
052900         04  FILLER                    PIC X.
053000         04  WORK-HELD-AWAY-ELAPSED-X  PIC X(004).
053100     02  WORK-REST-CLAIMED-A           PIC X(004).
053200     02  WORK-REST-CLAIMED REDEFINES
053300         WORK-REST-CLAIMED-A           PIC 9(004).
053400     02  WORK-TOTAL-RESPITE            PIC S9(005) VALUE 0 COMP-3.
053500     02  WORK-PREV-DUTY-MINUTES        PIC S9(005) VALUE 0 COMP-3.
053600
053700     02  WS-OLD-TOD.
053800         04  WS-OLD-HR                 PIC 9(002)  VALUE 0.
053900         04  WS-OLD-MN                 PIC 9(002)  VALUE 0.
054000     02  WS-OLD-TOD-NUM REDEFINES WS-OLD-TOD PIC 9(004).
054100
054200     02  WS-NEW-TOD.
054300         04  WS-NEW-HR                 PIC 9(002)  VALUE 0.
054400         04  WS-NEW-MN                 PIC 9(002)  VALUE 0.
054500     02  WS-NEW-TOD-NUM REDEFINES WS-NEW-TOD PIC 9(004).
054600
054700     02  WS-ADD-ARB                    PIC X(01) VALUE SPACES.
054800         88  ADD-PREP                            VALUE 'Y' 'P'.
054900         88  ADD-FINAL                           VALUE 'Y'.
055000         88  DONT-ADD-PREP                       VALUE 'N'.
055100         88  DONT-ADD-FINAL                      VALUE 'N' 'P'.
055200     02  WS-SHORT-CALL                 PIC X(01) VALUE SPACES.
055300         88  SHORT-CALL-YES                      VALUE 'Y'.
055400         88  SHORT-CALL-NO                       VALUE 'N' ' '.
055500     02  WS-OFFSET-HR.
055600         04  WS-OFFSET-HR-1            PIC 9(01) VALUE ZERO.
055700         04  WS-OFFSET-HR-2            PIC 9(01) VALUE ZERO.
055800     02  WS-OFFSET-HR-NUM
055900         REDEFINES WS-OFFSET-HR        PIC 9(02).
056000     02  WS-OFFSET-MN                  PIC 9(02) VALUE ZERO.
056100*CNC0600 RJA B
056200     02  WS-MTOD-PLUS-LEAD-DTTM.
056300         04  WS-MTOD-PLUS-LEAD-DT      PIC X(06) VALUE ZERO.
056400         04  WS-MTOD-PLUS-LEAD-TM      PIC X(04) VALUE ZERO.
056500     02  WS-SD-LEAD-TIME               PIC 9(04) VALUE ZERO.
056600*CNC0600 RJA E
056700*CNLD-265-B
056800     02  WS-PERS-PLUS-LEAD-DTTM.
056900         04  WS-PERS-PLUS-LEAD-DT      PIC X(06) VALUE ZERO.
057000         04  WS-PERS-PLUS-LEAD-TM      PIC X(04) VALUE ZERO.
057100*CNLD-265-E
057200
057300*CNLD-244-B #3 CNC0600
057400**CNLD-207-DXC-B
057500*     02  WS-ORDER-MINUS-LEAD-DTTM.
057600*         04  WS-ORDER-MINUS-LEAD-DT   PIC X(06)  VALUE SPACES.
057700*         04  WS-ORDER-MINUS-LEAD-TM   PIC X(04)  VALUE SPACES.
057800**CNLD-207-DXC-E
057900     02  WS-OD-MINUS-LEAD-DTTM.
058000         04  WS-OD-MINUS-LEAD-DT       PIC X(06)  VALUE SPACES.
058100         04  WS-OD-MINUS-LEAD-TM       PIC X(04)  VALUE SPACES.
058200*CNLD-244-E
058300     02  WS-LEAD-TIME.
058400         04  WS-LEAD-HR                PIC 9(02).
058500         04  WS-LEAD-MN                PIC 9(02).
058600     02  WS-ADDL-LEAD-TIME.
058700         04  WS-ADDL-LEAD-HR           PIC 9(02).
058800         04  WS-ADDL-LEAD-MN           PIC 9(02).
058900     02  WS-HRMN.
059000         04  WS-HR                     PIC 9(02).
059100         04  WS-MN                     PIC 9(03).
059200     02  LAST-TTW-END.
059300         04  LAST-TTW-CENT             PIC X(02) VALUE SPACES.
059400         04  LAST-TTW-DATE-TIME.
059500             06 LAST-TTW-DATE          PIC X(06) VALUE SPACES.
059600             06 LAST-TTW-TIME          PIC X(04) VALUE SPACES.
059700     02  LAST-TTW-TIME-ZONE            PIC X(01) VALUE SPACES.
059800     02  WS-PROCESS-DATE               PIC X(06) VALUE SPACES.
059900     02  WS-RESPITE-2-DTTM.
060000         04  WS-RESPITE-2-CE           PIC X(02) VALUE SPACES.
060100         04  WS-RESPITE-2-DATE         PIC X(06) VALUE SPACES.
060200         04  WS-RESPITE-2-TIME         PIC X(04) VALUE SPACES.
060300     02  WS-POINT-EFF-DATE-TIME.
060400         04  WS-POINT-EFF-DATE         PIC X(08) VALUE SPACES.
060500         04  WS-POINT-EFF-TIME         PIC X(04) VALUE SPACES.
060600*CNC0429
060700 01  WS-APPLY-LIMBO-FLAG               PIC X(01) VALUE SPACES.
060800     88  WS-APPLY-LIMBO-NO                       VALUE 'N' SPACE.
060900     88  WS-APPLY-LIMBO-YES                      VALUE 'Y'.
061000
061100 01  WS-ALT-REST-PLACEMENT             PIC X(01) VALUE SPACES.
061200     88  WS-ALT-REST                             VALUE 'Y'.
061300 01  WS-HOLD-QUAL-DATE                 PIC X(08).
061400 01  WS-HOLD-P925-OD-DT-TM-CE.
061500     02  WS-HOLD-P925-OD-DATE          PIC X(08).
061600     02  WS-HOLD-P925-OD-TIME          PIC X(04).
061700 01  WS-HOLD-2ND-OD-DT-TM-CE.
061800     02  WS-HOLD-2ND-OD-DATE           PIC X(08).
061900     02  WS-HOLD-2ND-OD-TIME           PIC X(04).
062000 01  WS-RESPITE-OD-DT-TM-CE.
062100     02  WS-RESPITE-OD-DT-CE.
062200         04  WS-RESPITE-OD-CE              PIC X(02).
062300         04  WS-RESPITE-OD-DATE            PIC X(06).
062400     02  WS-RESPITE-OD-TIME            PIC X(04).
062500 01  COMPARE-DATE-TIME.
062600     02  COMPARE-DATE                  PIC X(06).
062700     02  COMPARE-TIME                  PIC X(04).
062800 01  WS-SCHED-OFFD-DATE-TIME.
062900     02  WS-SCHED-OFFD-DATE            PIC X(06).
063000     02  WS-SCHED-OFFD-TIME            PIC X(04).
063100 01  WS-REST-STATUS-ERT.
063200     02  WS-REST-STATUS-ERT-HR         PIC 9(02).
063300     02  WS-REST-STATUS-ERT-MN         PIC 9(02).
063400
063500 01  WS-RSA-TIME-HRMN.
063600     05  WS-RSA-HR                PIC 9(02).
063700     05  WS-RSA-MN                PIC 9(02).
063800
063900 01  WORK-SAVE-TKCR.
064000     02  FILLER                        PIC X(256).
064100 01  WORK-SAVE-POOL.
064200     02  FILLER                        PIC X(256) VALUE SPACES.
064300 01  WORK-SAVE-CNTL.
064400     02  FILLER                        PIC X(256).
064500
064600 01  WS-TOD-AREA.
064700     02  WS-TOD-DIST                   PIC X(002).
064800     02  WS-TOD-SDIST                  PIC X(002).
064900     02  WS-TOD-TRAIN-ASGN             PIC X(010).
065000     02  WS-TOD-CRAFT                  PIC X(002).
065100
065200 01  WORK-TKCRKEY-A2.
065300     02  WK-TKCR-A2-REC-TYPE           PIC X(002).
065400     02  WK-TKCR-A2-DIST               PIC X(002).
065500     02  WK-TKCR-A2-SUB-DIST           PIC X(002).
065600     02  WK-TKCR-A2-CRAFT-SB           PIC X(002).
065700     02  WK-TKCR-A2-ASGN-TYPE          PIC X(001).
065800     02  WK-TKCR-A2-ASGN               PIC X(006).
065900     02  WK-TKCR-A2-ARR-STATION        PIC X(005).
066000     02  WK-TKCR-A2-HOME-STATION       PIC X(005).
066100     02  WK-TKCR-A2-SEQ-NUM            PIC X(001).
066200
066300 01  WORK-TKCR-A2-AREA.
066400     02  WORK-TKCR-ARRAY-A2 OCCURS 36.
066500         03  WK-TKCR-A2-SERVICE        PIC X(002) VALUE SPACES.
066600         03  WK-TKCR-A2-CC-WORKED      PIC X(002) VALUE SPACES.
066700*CNC0533-BEG
066800         03  WK-TKCR-A2-EXT-RUN        PIC X(001) VALUE SPACES.
066900*CNC0533-END
067000         03  WK-TKCR-A2-MIN-REST       PIC X(002) VALUE SPACES.
067100         03  WK-TKCR-A2-MAX-REST       PIC X(002) VALUE SPACES.
067200*CNC0533-BEG
067300 01  WS-ASSIGNMENT                     PIC X(010) VALUE SPACES.
067400*CNC0533-END
067500
067600 01  WORK-REST-AREA.
067700     02  WK-MIN-REST1                  PIC X(002) VALUE SPACES.
067800     02  WK-MAX-REST1                  PIC X(002) VALUE SPACES.
067900     02  WK-MIN-REST2                  PIC X(002) VALUE SPACES.
068000     02  WK-MAX-REST2                  PIC X(002) VALUE SPACES.
068100     02  WK-MIN-REST3                  PIC X(002) VALUE SPACES.
068200     02  WK-MAX-REST3                  PIC X(002) VALUE SPACES.
068300     02  WK-MIN-REST4                  PIC X(002) VALUE SPACES.
068400     02  WK-MAX-REST4                  PIC X(002) VALUE SPACES.
068500     02  WK-MIN-REST5                  PIC X(002) VALUE SPACES.
068600     02  WK-MAX-REST5                  PIC X(002) VALUE SPACES.
068700     02  WK-MIN-REST6                  PIC X(002) VALUE SPACES.
068800     02  WK-MAX-REST6                  PIC X(002) VALUE SPACES.
068900     02  HOLD-TKCR-A2-MIN-REST         PIC X(002) VALUE SPACES.
069000     02  HOLD-TKCR-A2-MAX-REST         PIC X(002) VALUE SPACES.
069100
069200 01  WS-HOLD-ON-DUTY-CC                PIC X(002) VALUE SPACES.
069300 01  WS-HOLD-MSTR-CC                   PIC X(002) VALUE SPACES.
069400
069500 01  WS-EMP-MTOD-CENT.
069600     05  WS-EMP-MTOD-DATE-CENT.
069700         10  WS-EMP-MTOD-CE          PIC 9(002) VALUE ZEROS.
069800         10  WS-EMP-MTOD-DATE        PIC 9(006) VALUE ZEROS.
069900     05  WS-EMP-MTOD-HRMN            PIC 9(004) VALUE ZEROS.
070000
070100 01  WS-EMP-US-RSTD-CENT.
070200     05  WS-EMP-US-RSTD-DATE-CENT.
070300         10  WS-EMP-US-RSTD-CE       PIC 9(002) VALUE ZEROS.
070400         10  WS-EMP-US-RSTD-DATE     PIC 9(006) VALUE ZEROS.
070500     05  WS-EMP-US-RSTD-HRMN         PIC 9(004) VALUE ZEROS.
070600
070700 01  WS-EMP-PERS-REST-CENT.
070800     05  WS-EMP-PERS-REST-DATE-CENT.
070900         10  WS-EMP-PERS-REST-CE     PIC 9(002) VALUE ZEROS.
071000         10  WS-EMP-PERS-REST-DATE   PIC 9(006) VALUE ZEROS.
071100     05  WS-EMP-PERS-REST-HRMN       PIC 9(004) VALUE ZEROS.
071200
071300 01  WS-LAST-TUT-CENT.
071400     05  WS-LAST-TUT-DATE-CENT.
071500         10  WS-LAST-TUT-CE          PIC 9(002) VALUE ZEROS.
071600         10  WS-LAST-TUT-DATE        PIC 9(006) VALUE ZEROS.
071700     05  WS-LAST-TUT-HRMN            PIC 9(004) VALUE ZEROS.
071800
071900 01  WS-LAST-ARRT-CENT.
072000     05  WS-LAST-AT-DATE-CENT.
072100         10  WS-LAST-AT-CENT         PIC 9(002) VALUE ZEROS.
072200         10  WS-LAST-AT-DATE         PIC 9(006) VALUE ZEROS.
072300     05  WS-LAST-AT-HRMN             PIC 9(004) VALUE ZEROS.
072400
072500 01  WS-OD-CENT-DATE-TIME.
072600     02  WS-OD-CENT-DATE.
072700         03  WS-OD-CENT              PIC X(002).
072800         03  WS-OD-DATE              PIC X(006).
072900     02  WS-OD-TIME                  PIC X(004).
073000
073100 01  WS-ORDER-CENT-DATE-TIME.
073200     02  WS-ORDER-CENT-DATE.
073300         03  WS-ORDER-CENT           PIC X(002).
073400         03  WS-ORDER-DATE           PIC X(006).
073500     02  WS-ORDER-TIME               PIC X(004).
073600
073700 01  WS-80HRS-AGO.
073800     02  WS-80HRS-AGO-DATE           PIC X(008).
073900     02  WS-80HRS-AGO-TIME           PIC X(004).
074000 01  WS-24HRS-AGO.
074100     02  WS-24HRS-AGO-DATE           PIC X(008).
074200     02  WS-24HRS-AGO-TIME           PIC X(004).
074300 01  WS-24HRS-LATER.
074400     02  WS-24HRS-LATER-DATE         PIC X(008).
074500     02  WS-24HRS-LATER-TIME         PIC X(004).
074600 01  WS-COMPARE.
074700     02  WS-COMPARE-DATE             PIC X(008).
074800     02  WS-COMPARE-TIME             PIC X(004).
074900 01  WS-MINUTES.
075000     02  WS-MIN-HR                   PIC 9(002) VALUE ZERO.
075100     02  WS-MIN-MN                   PIC 9(002) VALUE ZERO.
075200 01  WS-CALC1                        PIC 9(004) VALUE ZERO.
075300 01  WS-CALC2                        PIC 9(004) VALUE ZERO.
075400 01  WS-TOD-ADD-TOTAL.
075500     02  WS-TOD-ADD-HR               PIC 9(002) VALUE ZERO.
075600     02  WS-TOD-ADD-MN               PIC 9(002) VALUE ZERO.
075700 01  WS-TOD-SUB-TOTAL.
075800     02  WS-TOD-SUB-HR               PIC 9(002) VALUE ZERO.
075900     02  WS-TOD-SUB-MN               PIC 9(002) VALUE ZERO.
076000 01  WS-TEMP-MN                      PIC 9(003) VALUE ZERO.
076100
076200 01  FILLER                          PIC X(025) VALUE
076300     'FROZEN AREA BEGINS HERE  '.
076400 01  WS-FROZEN-AREA.
076500     02  WS-FROZEN-START.
076600         03  WS-FROZEN-START-DATE    PIC X(008).
076700         03  WS-FROZEN-START-TIME    PIC X(004).
076800     02  WS-FROZEN-END.
076900         03  WS-FROZEN-END-DATE      PIC X(008).
077000         03  WS-FROZEN-END-TIME      PIC X(004).
077100     02  WS-FROZEN-ENTRY-FLAG        PIC X(001).
077200         88  WS-FROZEN-ENTRY-FOUND       VALUE 'Y'.
077300
077400 01  TTW-SUB                         PIC S9(004) COMP VALUE +0.
077500 01  FILLER                          PIC X(025) VALUE
077600     'TTW AREA BEGINS HERE     '.
077700 01  WS-TTW-AREA.
077800     02  WS-TTW-ARRAY OCCURS 10.
077900         03  WS-TTW-START.
078000             04  WS-TTW-START-CENT   PIC X(002).
078100             04  WS-TTW-START-DATE   PIC X(006).
078200             04  WS-TTW-START-TIME   PIC X(004).
078300         03  WS-TTW-END.
078400             04  WS-TTW-END-CENT     PIC X(002).
078500             04  WS-TTW-END-DATE     PIC X(006).
078600             04  WS-TTW-END-TIME     PIC X(004).
078700         03  WS-TTW-TTOD.
078800             04  WS-TTW-TTOD-HR      PIC 9(002).
078900             04  WS-TTW-TTOD-MN      PIC 9(002).
079000         03  WS-TTW-AJ-SCH-DUR       PIC X(004).
079100         03  WS-TTW-ZONE             PIC X(001).
079200         03  WS-TTW-IMP-REST-FLAG    PIC X(001).
079300             88  WS-TTW-IMP-REST         VALUE 'Y'.
079400*CNC0600-B
079500         03  WS-TTW-RESETBRK-FLAG    PIC X(001).
079600             88  WS-TTW-RESETBRK         VALUE 'Y'.
079700         03  WS-TTW-CONTACT-FLAG     PIC X(001).
079800             88  WS-TTW-CONTACT          VALUE 'Y'.
079900*CNC0600-E
080000     02  WS-TTW.
080100         03  WS-TTW-HR               PIC 9(002).
080200         03  WS-TTW-MN               PIC 9(002).
080300     02  WS-TTW-NUM REDEFINES
080400         WS-TTW                      PIC 9(004).
080500 01  TTR-SUB                         PIC S9(004) COMP VALUE +0.
080600 01  FILLER                          PIC X(025) VALUE
080700     'TTR AREA BEGINS HERE     '.
080800 01  WS-TTR-AREA.
080900     02  WS-TTR-ARRAY OCCURS 10.
081000         03  WS-TTR-START.
081100             04  WS-TTR-START-CENT   PIC X(002).
081200             04  WS-TTR-START-DATE   PIC X(006).
081300             04  WS-TTR-START-TIME   PIC X(004).
081400         03  WS-TTR-END.
081500             04  WS-TTR-END-CENT     PIC X(002).
081600             04  WS-TTR-END-DATE     PIC X(006).
081700             04  WS-TTR-END-TIME     PIC X(004).
081800         03  WS-TTR-TTOD.
081900             04  WS-TTR-TTOD-HR      PIC 9(002).
082000             04  WS-TTR-TTOD-MN      PIC 9(002).
082100     02  WS-TTR.
082200         03  WS-TTR-HR               PIC 9(002).
082300         03  WS-TTR-MN               PIC 9(002).
082400     02  WS-TTR-NUM REDEFINES
082500         WS-TTR                      PIC 9(004).
082600 01  FILLER                          PIC X(025) VALUE
082700     'TTA AREA BEGINS HERE     '.
082800 01  WS-TTA                          PIC 9(004).
082900
083000*CNLD-302 B  COMMENTING              PIC 9(004)  VALUE 2400.
083000*01  WS-24-IMPOSED-REST              PIC 9(004)  VALUE 2400.
083100*01  WS-IMPOSED-REST-START           PIC 9(004)  VALUE 0400.
083000*CNLD-302 E
083200
083300 01  WS-UNADJ-OD-CENT-DATE-TIME.
083400     02  WS-UNADJ-OD-CENT-DATE.
083500         03  WS-UNADJ-OD-CENT        PIC X(002)  VALUE SPACES.
083600         03  WS-UNADJ-OD-DATE        PIC X(006)  VALUE SPACES.
083700     02  WS-UNADJ-OD-TIME            PIC X(004)  VALUE SPACES.
083800 01  FILLER REDEFINES WS-UNADJ-OD-CENT-DATE-TIME.
083900     02  FILLER                      PIC X(002).
084000     02  WS-UNADJ-OD-DATE-TIME       PIC X(010).
084100
084200 01  WS-LAST-OD-DATE-TIME.
084300     02  WS-LAST-OD-CE               PIC X(002)  VALUE SPACES.
084400     02  WS-LAST-OD-DATE             PIC X(006)  VALUE SPACES.
084500     02  WS-LAST-OD-TIME             PIC X(004)  VALUE SPACES.
084600 01  WS-LAST-OD-TZ                   PIC X(001)  VALUE SPACES.
084700
084800 01  WS-TOUR-ARRAY.
084900     02  WS-TOUR-ARRAY-AREA OCCURS 10.
085000         04  WS-TOUR-DIST            PIC X(002)  VALUE SPACES.
085100         04  WS-TOUR-SUB-DIST        PIC X(002)  VALUE SPACES.
085200         04  WS-TOUR-TRAIN-ASGN      PIC X(010)  VALUE SPACES.
085300         04  WS-TOUR-CRAFT           PIC X(002)  VALUE SPACES.
085400         04  WS-TOUR-RESPITE-FL      PIC X(001)  VALUE SPACES.
085500             88  WS-TOUR-RESPITE-1               VALUE '1'.
085600             88  WS-TOUR-RESPITE-2               VALUE '2'.
085700
085800*CNC0524
085900 01  WS-TEMP-DATE-TIME.
086000     02  WS-TEMP-DATE                PIC X(006)  VALUE SPACES.
086100     02  WS-TEMP-TIME                PIC X(004)  VALUE SPACES.
086200 01  WS-TEMP-DATE-TIME1.
086300     02  WS-TEMP-DATE1.
086400         04 WS-TEMP-DATE1-YY         PIC X(002)  VALUE SPACES.
086500         04 WS-TEMP-DATE1-MM         PIC X(002)  VALUE SPACES.
086600         04 WS-TEMP-DATE1-DD         PIC X(002)  VALUE SPACES.
086700     02  WS-TEMP-TIME1               PIC X(004)  VALUE SPACES.
086800*C1117-BEG
086900 01  WS-RESP-FROM-HRMN.
087000     02  WS-RESP-FROM-HR             PIC 9(02)   VALUE ZEROES.
087100     02  WS-RESP-FROM-MN             PIC 9(02)   VALUE ZEROES.
087200*
087300 01  WS-RESP-TO-HRMN.
087400     02  WS-RESP-TO-HR               PIC 9(02)   VALUE ZEROES.
087500     02  WS-RESP-TO-MN               PIC 9(02)   VALUE ZEROES.
087600*
087700 01  WS-RESPITE-HRMN.
087800     02  WS-RESPITE-HR               PIC 9(02)   VALUE ZERO.
087900     02  WS-RESPITE-MN               PIC 9(02)   VALUE ZERO.
088000*
088100 01  WS-RESP-TEMP                    PIC 9(05)   VALUE ZERO.
088200 01  WS-RESP-TEMP1                   PIC 9(05)   VALUE ZERO.
088300*C1117-END
088400*CNC0600-B
088500 01  WS-TTOD-ERT                     PIC 9(07)   VALUE ZERO.
088600 01  WS-7DAY-ERT                     PIC 9(07)   VALUE ZERO.
088700*CNLD-230-B
088800 01  WS-7DAY-ERT-NUM                 PIC 9(04)   VALUE ZERO.
088900 01  WS-TRCN-ASGN-TYPE               PIC X(01).
089000     88  WS-TRCN-YARD-REC                        VALUE 'Y'.
089100*CNLD-230-E
089200 01  WORK-EMP-MTOD-1                 PIC 9(004)  VALUE ZERO.
089300 01  WS-EXTENDING-MTOD.
089400     03 WS-MTOD-1                    PIC 9(004)  VALUE ZERO.
089500     03 WS-MTOD-TEMP                 PIC 9(004)  VALUE ZERO.
089600     03 WS-ORIG-MTOD-DATE            PIC X(06)   VALUE SPACES.
089700     03 WS-ORIG-MTOD-TIME            PIC X(04)   VALUE SPACES.
089800     03 WS-MTOD-W-EXTENDED-DT        PIC X(06)   VALUE SPACES.
089900     03 WS-MTOD-W-EXTENDED-TM        PIC X(04)   VALUE SPACES.
090000 01  WS-OD-ERT-DATE-TIME.
090100     02  WS-OD-ERT-DATE              PIC X(06)   VALUE SPACES.
090200     02  WS-OD-ERT-TIME              PIC X(04)   VALUE SPACES.
090300 01  WS-DAY1-DATE-TIME.
090400     02  WS-DAY1-DATE                PIC X(06)   VALUE SPACES.
090500     02  WS-DAY1-TIME                PIC X(04)   VALUE SPACES.
090600 01  WS-DAY2-DATE-TIME.
090700     02  WS-DAY2-DATE                PIC X(06)   VALUE SPACES.
090800     02  WS-DAY2-TIME                PIC X(04)   VALUE SPACES.
090900 01  WS-DAY3-DATE-TIME.
091000     02  WS-DAY3-DATE                PIC X(06)   VALUE SPACES.
091100     02  WS-DAY3-TIME                PIC X(04)   VALUE SPACES.
091200 01  WS-UPD-PROJ-DATE-TIME.
091300     02  WS-UPD-PROJ-DATE            PIC X(06)   VALUE SPACES.
091400     02  WS-UPD-PROJ-TIME            PIC X(04)   VALUE SPACES.
091500*CNC0600-E
091600* CNLD-214 B CNC0600
091700 01  WS-UPD-PROJ-UD1-FROM            PIC X(10)  VALUE SPACES.
091800 01  WS-UPD-PROJ-UD1-TO              PIC X(10)  VALUE SPACES.
091900 01  WS-UPD-PROJ-UD2-FROM            PIC X(10)  VALUE SPACES.
092000*CNLD-259 B CNC0600
092100*01  WS-UPD-PROJ-UD2-TO              PIC X(10)  VALUE SPACES.
092200 01  WS-UPD-PROJ-UD2-TO.
092300     02  WS-UPD-PROJ-UD2-TO-DATE     PIC X(06)   VALUE SPACES.
092400     02  WS-UPD-PROJ-UD2-TO-TIME     PIC X(04)   VALUE SPACES.
092500*CNLD-259 E CNC0600
092600* CNLD-214 E
092700*CNC0600-RPV-B
092800 01  WS-30HRS-AFTER-DATE-TIME.
092900     02  WS-30HRS-AFTER-DATE         PIC X(06)   VALUE SPACES.
093000     02  WS-30HRS-AFTER-TIME         PIC X(04)   VALUE SPACES.
093100*CNC0600-RPV-E
093200*****************************************************************
093300***                 I/O STATUS CHECK FIELDS
093400*****************************************************************
093500 01  WS-RESPONSE              PIC S9(8) COMP VALUE ZEROES.
093600 01  FILE-STATUS              PIC 9(4)  VALUE ZEROES.
093700     COPY IOCODES.
093800*****************************************************************
093900***                   COMMAREA COPYBOOKS
094000*****************************************************************
094100     COPY P925COMM.
094200*CNC0600-RPV-B
094300*****************************************************************
094400***                   PROGRAM NAMES COPYBOOKS
094500*****************************************************************
094600     COPY PSTCB08.
094700     COPY PSTCB08S.
094800     COPY PSTCB08Z.
095000*CNC0600-RPV-E
095000*CNLD-310 B
094800     COPY PSTCB31B.
095000*CNLD-310 E
095100*****************************************************************
095200***                  CALLED ROUTINES COPYBOOKS.
095300*****************************************************************
095400     COPY PSTERAR.
095500     COPY PS52COMM.
095600     COPY P901COMM.
095700     COPY P903COMM.
095800     COPY P983COMM.
095900     COPY PS08COMM.
096000*****************************************************************
096100***                       FILE COPYBOOKS
096200*****************************************************************
096300     COPY WSAHMISC.
096400     COPY WSASGN.
096500     COPY WSCNTL.
096600     COPY WSEMPTOD.
096700     COPY WSHIST.
096800     COPY WSMSTR.
096900*CNC0600-B
097000     COPY WSMSTR3.
097100*CNC0600-E
097200     COPY WSPOINTR.
097300     COPY WSQUAL.
097400     COPY WSTKCR.
097500     COPY WSTRCN.
097600*07/26/23 RJA B CNC0600 CNLD-269
097700**CNLD-250-DXC-B
097800*     COPY WSJS.
097900**CNLD-250-DXC-E
098000*07/26/23 RJA E
098100*****************************************************************
098200***                     FILE COPYBOOKS
098300*****************************************************************
098400*CNC0533-BEG
098500     EXEC SQL INCLUDE WSCOMMON END-EXEC.
098600     EXEC SQL INCLUDE AALV     END-EXEC.
098700     EXEC SQL INCLUDE AALWS    END-EXEC.
098800*CNC0533-END
098900*
099000*****************************************************************
099100*****************************************************************
099200***                       MISC COPYBOOKS
099300*****************************************************************
099400     COPY PSTCCRFT.
099500     COPY WSAJDEFN.
099600     COPY WSEDDATE.
099700     COPY WSEDTIME.
099800     COPY WSSYDTTM.
099900     COPY WSZONE.
100000*CNC0533-BEG
100100*****************************************************************
100200***                        DB2 INCLUDES
100300*****************************************************************
100400     EXEC SQL INCLUDE SQLCA    END-EXEC.
100500*CNC0533-END
100600
100700 LINKAGE SECTION.
100800 01  DFHCOMMAREA.
100900*CNC0533-BEG
101000*    05  FILLER            PIC X(350).
101100     05  FILLER            PIC X(400).
101200*CNC0533-END
101300
101400******************************************************************
101500 PROCEDURE DIVISION.
101600*
101700******************************************************************
101800 P0000-MAINLINE.
101900******************************************************************
102000*
102100     EXEC CICS IGNORE CONDITION
102200               ERROR
102300     END-EXEC
102400     EXEC CICS HANDLE ABEND
102500               LABEL(P9999-GOT-PROBLEM)
102600     END-EXEC
102700     IF EIBCALEN = ZERO
102800        PERFORM P9999-GOT-PROBLEM
102900     END-IF
103000     MOVE DFHCOMMAREA TO P925-COMMAREA-PARMS
103100
103200*-----------------------------------------------------------------
103300*   BUG C549-ACTUAL TIME DEFINITION DOES NOT APPLY TO US HOURS.
103400*   USE THE UNADJUSTED ON DUTY DATE TIME INSTEAD OF PASSED IN
103500*   P925-OD-DATE-TIME FOR US CALCULATIONS IN P1010, P2000, P2010 &
103600*   P5900.
103700*
103800*   P925-UNADJ-OD-DATE-TIME IS PASSED IN RETURN AREA DUE TO SPACE
103900*   CONSTRAINTS AND NEEDS TO BE SAVED IMMEDIATELY TO WORKING
104000*   STORAGE.
104100*-----------------------------------------------------------------
104200     IF P925-UNADJ-OD-DATE-TIME > SPACES
104300        SET DE-REFORMAT-ONLY       TO TRUE
104400        SET DE-YYMMDD-FORMAT       TO TRUE
104500        MOVE P925-UNADJ-OD-DATE    TO DE-YYMMDD
104600        PERFORM P8998-DATEEDIT
104700        MOVE DE-CCYYMMDD           TO WS-UNADJ-OD-CENT-DATE
104800        MOVE P925-UNADJ-OD-TIME    TO WS-UNADJ-OD-TIME
104900     END-IF
105000     IF P925-VACANCY-FILLED
105100        SET VACANCY-FILLED         TO TRUE
105200     END-IF
105300
105400     MOVE SPACES                   TO P925-RETURN-PARMS
105500     PERFORM P1000-PROCESS
105600     PERFORM P9000-RETURN.
105700*
105800******************************************************************
105900 P1000-PROCESS.
106000******************************************************************
106100*
106200*    ACTUAL TIME WILL BE CALCULATED IN THE ASSIGNMENT TIME ZONE
106300*    IF THE EMPLOYEE NUMBER IS NOT POPULATED
106400*
106500     MOVE SPACES                   TO WS-EMP-WORK-AREA
106600     MOVE P925-EMP-NO              TO MSTRNBRK
106700     EXEC CICS READ
106800               DATASET(MSTR-VIA-EMP-NBR)
106900               INTO(WS-MSTR)
107000               LENGTH(MSTRENBR-RLGTH)
107100               RIDFLD(MSTRNBRK)
107200               KEYLENGTH(MSTRENBR-KLGTH)
107300               RESP(WS-RESPONSE)
107400     END-EXEC
107500     MOVE WS-RESPONSE TO FILE-STATUS
107600     IF NOT SUCCESS
107700        MOVE 'P1000-1'             TO ERR-PARAGRAPH
107800        MOVE MSTRNBRK              TO ERR-KEY
107900        PERFORM P9999-GOT-PROBLEM
108000     END-IF
108100     MOVE SPACES                   TO CNTLKEY-AREA
108200     MOVE '02'                     TO CNTL-REC-TYPE
108300     MOVE DIST OF WS-MSTR          TO CNTL-DIST
108400     MOVE SUB-DIST OF WS-MSTR      TO CNTL-SUB-DIST
108500     MOVE CNTLKEY-AREA             TO CNTLKEY
108600     EXEC CICS READ
108700               DATASET(CNTL-FILE-VIA-CNTLKEY)
108800               INTO(WS-CNTL-FILE)
108900               LENGTH(CNTLFILE-RLGTH)
109000               RIDFLD(CNTLKEY)
109100               KEYLENGTH(CNTLFILE-KLGTH)
109200               RESP(WS-RESPONSE)
109300     END-EXEC
109400     MOVE WS-RESPONSE              TO FILE-STATUS
109500     IF NOT SUCCESS
109600        MOVE 'P1000-2'             TO ERR-PARAGRAPH
109700        MOVE CNTLKEY               TO ERR-KEY
109800        PERFORM P9999-GOT-PROBLEM
109900     END-IF
110000     MOVE CNTL-TIME-ZONE           TO WS-EMP-TIME-ZONE
110100*CNC0598-B
110200     MOVE CNTL-CAN-WRR-FLAG        TO WS-CAN-WRR-FLAG
110300*CNC0598-E
110400*RJA  5/17/2023 B CNC0600
110500     MOVE CNTL-02-WRR-BEGINNING-DTTM TO WS-WRR-START-DTTM
110600*RJA  5/17/2023 E
110700*CNC0429
110800     MOVE CNTL-APPLY-LIMBO         TO WS-APPLY-LIMBO-FLAG
110900     MOVE CNTL-US-DOM              TO WS-US-DOM-FLAG
111000*-----------------------------------------------------------------
111100*    P925-OD-DATE-TIME SHOULD NOT NEED TO BE CONVERTED SINCE
111200*    IT WAS CONVERTED TO THE EMPLOYEES TIME ZONE AT CALL TIME
111300*-----------------------------------------------------------------
111400     IF P925-OD-DATE-TIME > '0000000000'
111500        MOVE SPACES                    TO TZ-PARAMETERS
111600        MOVE P925-TIME-ZONE            TO TZ-IN-ZONE
111700        MOVE P925-OD-DATE-TIME         TO TZ-IN-DATE-TIME
111800        MOVE WS-EMP-TIME-ZONE          TO TZ-OUT-ZONE
111900        PERFORM P8996-TIMEZONE
112000        IF TZ-INVALID-PARAMETERS
112100           MOVE 'P1000TZ1'              TO ERR-PARAGRAPH
112200           PERFORM P8996-TZERROR
112300        END-IF
112400        MOVE TZ-OUT-DATE-TIME          TO P925-OD-DATE-TIME
112500     END-IF
112600*
112700     IF P925-ORDER-DATE-TIME > '0000000000'
112800        MOVE SPACES                    TO TZ-PARAMETERS
112900        MOVE P925-TIME-ZONE            TO TZ-IN-ZONE
113000        MOVE P925-ORDER-DATE-TIME      TO TZ-IN-DATE-TIME
113100        MOVE WS-EMP-TIME-ZONE          TO TZ-OUT-ZONE
113200        PERFORM P8996-TIMEZONE
113300        IF TZ-INVALID-PARAMETERS
113400           MOVE 'P1000TZ2'              TO ERR-PARAGRAPH
113500           PERFORM P8996-TZERROR
113600        END-IF
113700        MOVE TZ-OUT-DATE-TIME          TO P925-ORDER-DATE-TIME
113800     END-IF
113900*
114000     IF P925-TTA-ORDER-DATE-TIME > '0000000000'
114100        MOVE SPACES                    TO TZ-PARAMETERS
114200        MOVE P925-TIME-ZONE            TO TZ-IN-ZONE
114300        MOVE P925-TTA-ORDER-DATE-TIME  TO TZ-IN-DATE-TIME
114400        MOVE WS-EMP-TIME-ZONE          TO TZ-OUT-ZONE
114500        PERFORM P8996-TIMEZONE
114600        IF TZ-INVALID-PARAMETERS
114700           MOVE 'P1000TZ3'              TO ERR-PARAGRAPH
114800           PERFORM P8996-TZERROR
114900        END-IF
115000        MOVE TZ-OUT-DATE-TIME          TO P925-TTA-ORDER-DATE-TIME
115100     END-IF
115200*
115300     IF P925-OFFD-DATE-TIME > '0000000000'
115400        MOVE SPACES                    TO TZ-PARAMETERS
115500        MOVE P925-TIME-ZONE            TO TZ-IN-ZONE
115600        MOVE P925-OFFD-DATE-TIME       TO TZ-IN-DATE-TIME
115700        MOVE WS-EMP-TIME-ZONE          TO TZ-OUT-ZONE
115800        PERFORM P8996-TIMEZONE
115900        IF TZ-INVALID-PARAMETERS
116000           MOVE 'P1000TZ4'              TO ERR-PARAGRAPH
116100           PERFORM P8996-TZERROR
116200        END-IF
116300        MOVE TZ-OUT-DATE-TIME          TO P925-OFFD-DATE-TIME
116400     END-IF
116500*
116600     IF P925-YARD-DATE-TIME > '0000000000'
116700        MOVE SPACES                    TO TZ-PARAMETERS
116800        MOVE P925-TIME-ZONE            TO TZ-IN-ZONE
116900        MOVE P925-YARD-DATE-TIME       TO TZ-IN-DATE-TIME
117000        MOVE WS-EMP-TIME-ZONE          TO TZ-OUT-ZONE
117100        PERFORM P8996-TIMEZONE
117200        IF TZ-INVALID-PARAMETERS
117300           MOVE 'P1000TZ5'              TO ERR-PARAGRAPH
117400           PERFORM P8996-TZERROR
117500        END-IF
117600        MOVE TZ-OUT-DATE-TIME          TO P925-YARD-DATE-TIME
117700     END-IF
117800*
117900     IF P925-SCHED-END-DATE-TIME > '0000000000'
118000        MOVE SPACES                    TO TZ-PARAMETERS
118100        MOVE P925-TIME-ZONE            TO TZ-IN-ZONE
118200        MOVE P925-SCHED-END-DATE-TIME  TO TZ-IN-DATE-TIME
118300        MOVE WS-EMP-TIME-ZONE          TO TZ-OUT-ZONE
118400        PERFORM P8996-TIMEZONE
118500        IF TZ-INVALID-PARAMETERS
118600           MOVE 'P1000TZ6'              TO ERR-PARAGRAPH
118700           PERFORM P8996-TZERROR
118800        END-IF
118900        MOVE TZ-OUT-DATE-TIME          TO P925-SCHED-END-DATE-TIME
119000     END-IF
119100*
119200     IF WS-UNADJ-OD-DATE-TIME > '0000000000'
119300        MOVE SPACES                    TO TZ-PARAMETERS
119400        MOVE P925-TIME-ZONE            TO TZ-IN-ZONE
119500        MOVE WS-UNADJ-OD-DATE-TIME     TO TZ-IN-DATE-TIME
119600        MOVE WS-EMP-TIME-ZONE          TO TZ-OUT-ZONE
119700        PERFORM P8996-TIMEZONE
119800        IF TZ-INVALID-PARAMETERS
119900           MOVE 'P1000TZ7'             TO ERR-PARAGRAPH
120000           PERFORM P8996-TZERROR
120100        END-IF
120200        MOVE TZ-OUT-DATE-TIME          TO WS-UNADJ-OD-DATE-TIME
120300     END-IF
120400*
120500     MOVE P925-TERM TO WS-TERM-CHECK
120600     IF HOME-TERM
120700        MOVE 'H'    TO P925-TERM
120800     END-IF
120900     IF AWAY-TERM
121000        MOVE 'A'    TO P925-TERM
121100     END-IF
121200*
121300     IF P925-CALC-US-CONT-DUTY
121400        PERFORM P5900-CALCULATE-US-CONT-DUTY
121500        MOVE P925-US-CONT-DUTY TO EMP-PREV-DUTY
121600     END-IF
121700     IF P925-CALC-US-HRS-SVC
121800        PERFORM P2000-CALCULATE-USPD
121900        PERFORM P2010-CALCULATE-US-REST
122000     END-IF
122100     IF P925-CALC-CAN-HRS-SVC
122200        OR P925-RECALC-CAN-HRS-SVC
122300        PERFORM P3000-CALCULATE-MTOD
122400        PERFORM P3010-CALCULATE-MTOD-REST
122500     END-IF
122600     IF P925-CALC-PERS-REST
122700        PERFORM P4000-CALCULATE-PERS-REST
122800     END-IF
122900     IF P925-CALC-PENALTY
123000        PERFORM P5000-CALCULATE-PENALTY
123100     END-IF
123200     IF P925-PERS-REST-EDIT
123300        PERFORM P6000-PERSONAL-REST-EDITS
123400     END-IF
123500     IF P925-CALC-REST-STATUS
123600        PERFORM P6100-CALC-REST-STATUS
123700     END-IF
123800*CNLD-302 B  COMMENTING
123800*    IF P925-CALC-24-IMP-REST
123900*       PERFORM P6200-CALC-24-IMP-REST
124000*    END-IF
123800*CNLD-302 E
124100     IF P925-CALC-ACTUAL-TIME
124200        PERFORM P6400-CALC-ACTUAL-TIME
124300     END-IF.
124400*
124500******************************************************************
124600 P1010-CALCULATE-ACT-PD.
124700******************************************************************
124800*
124900     MOVE ZEROS                     TO DATE-CONVERSION-PARMS
125000     SET  PARM-DIFF                 TO TRUE
125100*    COURTESY FIX: WORK BEGAN SHOULD NOT BE USED ANYMORE
125200*    IF P925-WORK-BEGAN-DATE-TIME    > SPACES
125300*       MOVE P925-WORK-BEGAN-DATE   TO PARM-SEC-DATE-GREG
125400*       MOVE P925-WORK-BEGAN-TIME   TO PARM-SEC-HRMN
125500*    ELSE
125600*BUG C549-S
125700*-----------------------------------------------------------------
125800*   IF P1010 IS TO BE USED BY CANADIAN CALCULATIONS, THE BELOW
125900*   CODE WILL NEED TO BE EVALUATED.  THE UNADJUSTED ON DUTY TIME
126000*   SHOULD NOT BE USED BY CANADIAN CALCULATIONS.
126100*-----------------------------------------------------------------
126200        IF WS-UNADJ-OD-CENT-DATE-TIME > SPACES
126300           MOVE WS-UNADJ-OD-DATE    TO PARM-SEC-DATE-GREG
126400           MOVE WS-UNADJ-OD-TIME    TO PARM-SEC-HRMN
126500        ELSE
126600           MOVE P925-OD-DATE        TO PARM-SEC-DATE-GREG
126700           MOVE P925-OD-TIME        TO PARM-SEC-HRMN
126800        END-IF
126900*BUG C549-E
127000*    END-IF
127100************************************************************
127200*CNC0429
127300*IF APPLY-LIMBO-TO-TTOD = N, CALC TTOD = ON-DUTY THRU WORK-ENDED.
127400*IF APPLY-LIMBO-TO-TTOD = Y, CALC TTOD = ON-DUTY THRU OFF-DUTY.
127500*THIS NEW CALC OF TTOD WILL AFFECT THE US REST.
127600*NOTE: P925-WORK-END-DATE & TIME MAY BE BLANK.
127700*NOTE: P925-OFFD-DATE & TIME WILL NOT BE BLANK.
127800************************************************************
127900     IF P925-WORK-END-DATE-TIME      > SPACES  AND
128000        WS-APPLY-LIMBO-NO
128100        MOVE P925-WORK-END-DATE     TO PARM-PRI-DATE-GREG
128200        MOVE P925-WORK-END-TIME     TO PARM-PRI-HRMN
128300     ELSE
128400        MOVE P925-OFFD-DATE         TO PARM-PRI-DATE-GREG
128500        MOVE P925-OFFD-TIME         TO PARM-PRI-HRMN
128600     END-IF
128700     EXEC CICS LINK
128800               PROGRAM (P903-PGM)
128900               COMMAREA(DATE-CONVERSION-PARMS)
129000               LENGTH  (P903-LGTH)
129100               RESP    (WS-RESPONSE)
129200     END-EXEC
129300     MOVE WS-RESPONSE               TO FILE-STATUS
129400     IF NOT SUCCESS
129500        MOVE 'P1010-1'              TO ERR-PARAGRAPH
129600        PERFORM P9999-GOT-PROBLEM
129700     END-IF
129800     MOVE ZEROS                     TO WORK-TIME3
129900     IF PARM-RES-TOT-DAYS            > ZERO
130000        MULTIPLY PARM-RES-TOT-DAYS BY 2400
130100           GIVING WORK-TIME3
130200     END-IF
130300     MOVE WORK-TIME3                TO WORK-TIME1
130400     ADD  PARM-RES-HR               TO WORK-TIME1-HR
130500     MOVE PARM-RES-MN               TO WORK-TIME1-MN
130600     IF WORK-TIME1                   > 09959
130700        MOVE 09959                  TO WORK-TIME1
130800     END-IF
130900     MOVE WORK-TIME1-4              TO P925-ACTUAL-TIME-ON-DUTY
131000*
131100*CNC0484 - POPULATE THE NEW FIELD P925-US-PREV-TOT-DUTY WITH FULL
131200*    TOUR OF DUTY TIME IF WS-APPLY-LIMBO-NO IS SET
131300*
131400     IF P925-WORK-END-DATE-TIME      > SPACES  AND
131500        WS-APPLY-LIMBO-NO
131600        MOVE ZEROS                  TO DATE-CONVERSION-PARMS
131700        MOVE P925-OFFD-DATE         TO PARM-PRI-DATE-GREG
131800        MOVE P925-OFFD-TIME         TO PARM-PRI-HRMN
131900        IF WS-UNADJ-OD-CENT-DATE-TIME > SPACES
132000           MOVE WS-UNADJ-OD-DATE    TO PARM-SEC-DATE-GREG
132100           MOVE WS-UNADJ-OD-TIME    TO PARM-SEC-HRMN
132200        ELSE
132300           MOVE P925-OD-DATE        TO PARM-SEC-DATE-GREG
132400           MOVE P925-OD-TIME        TO PARM-SEC-HRMN
132500        END-IF
132600        SET  PARM-DIFF              TO TRUE
132700        EXEC CICS LINK
132800               PROGRAM (P903-PGM)
132900               COMMAREA(DATE-CONVERSION-PARMS)
133000               LENGTH  (P903-LGTH)
133100               RESP    (WS-RESPONSE)
133200        END-EXEC
133300        MOVE WS-RESPONSE            TO FILE-STATUS
133400        IF NOT SUCCESS
133500           MOVE 'P1010-2'           TO ERR-PARAGRAPH
133600           PERFORM P9999-GOT-PROBLEM
133700        END-IF
133800        MOVE ZEROS                  TO WORK-TIME3
133900        IF PARM-RES-TOT-DAYS            > ZERO
134000           MULTIPLY PARM-RES-TOT-DAYS BY 2400
134100              GIVING WORK-TIME3
134200        END-IF
134300        MOVE WORK-TIME3             TO WORK-TIME1
134400        ADD  PARM-RES-HR            TO WORK-TIME1-HR
134500        MOVE PARM-RES-MN            TO WORK-TIME1-MN
134600        IF WORK-TIME1               > 09959
134700           MOVE 09959               TO WORK-TIME1
134800        END-IF
134900        MOVE WORK-TIME1-4           TO P925-US-PREV-TOT-DUTY
135000     ELSE
135100        MOVE P925-ACTUAL-TIME-ON-DUTY
135200                                    TO P925-US-PREV-TOT-DUTY
135300     END-IF.
135400*
135500******************************************************************
135600 P2000-CALCULATE-USPD.
135700******************************************************************
135800*
135900*    TAKE THE EMPLOYEES ACTUAL TIME ON DUTY FOR THIS TRIP, ADD TO
136000*    IT ANY PREVIOUS DUTY THEY MAY HAVE HAD AT CALL TIME.
136100*    THIS WILL GIVE THE "TOTAL TIME ON DUTY" FOR U.S. HOURS
136200*    OF SERVICE LAWS. (NOTE: THEY WOULD ONLY HAVE PREVIOUS DUTY
136300*    IF THEY WERE  N O T  FULLY RESTED WHEN THEY ACCEPTED THIS
136400*    CALL).       -------
136500*
136600*    CNC0113 / US PAYROLL AMENDMENT.  IF RESPITE EXCEEDS 4 HOURS,
136700*    REDUCE HOURS OF SERVICE BY ELAPSED RESPITE TIME.
136800*                                                     CW0297
136900*
137000*-----------------------------------------------------------------
137100     PERFORM P1010-CALCULATE-ACT-PD
137200     IF P925-ADJ-TIE-UP-FUNCTION
137300        MOVE ZEROS                     TO DATE-CONVERSION-PARMS
137400        SET  PARM-DIFF                 TO TRUE
137500        MOVE TUT-DATE                  TO PARM-PRI-DATE-GREG
137600        MOVE TUT-TIME-OF-DAY           TO PARM-PRI-HRMN
137700*BUG C549-S
137800        IF WS-UNADJ-OD-CENT-DATE-TIME > SPACES
137900           MOVE WS-UNADJ-OD-DATE       TO PARM-SEC-DATE-GREG
138000           MOVE WS-UNADJ-OD-TIME       TO PARM-SEC-HRMN
138100        ELSE
138200           MOVE P925-OD-DATE           TO PARM-SEC-DATE-GREG
138300           MOVE P925-OD-TIME           TO PARM-SEC-HRMN
138400        END-IF
138500*BUG C549-E
138600        EXEC CICS LINK
138700                  PROGRAM (P903-PGM)
138800                  COMMAREA(DATE-CONVERSION-PARMS)
138900                  LENGTH  (P903-LGTH)
139000                  RESP    (WS-RESPONSE)
139100        END-EXEC
139200        MOVE WS-RESPONSE               TO FILE-STATUS
139300        IF NOT SUCCESS
139400           MOVE 'P2000-1'              TO ERR-PARAGRAPH
139500           PERFORM P9999-GOT-PROBLEM
139600        END-IF
139700        MOVE ZEROS                     TO WORK-TIME3
139800        IF PARM-RES-TOT-DAYS            > ZERO
139900           MULTIPLY PARM-RES-TOT-DAYS  BY 2400
140000              GIVING WORK-TIME3
140100        END-IF
140200        MOVE WORK-TIME3                TO WORK-TIME1
140300        ADD  PARM-RES-HR               TO WORK-TIME1-HR
140400        MOVE PARM-RES-MN               TO WORK-TIME1-MN
140500        IF WORK-TIME1                   > 09959
140600           MOVE 09959                  TO WORK-TIME1
140700        END-IF
140800
140900        IF EMP-PREV-DUTY                > WORK-TIME1-4
141000           SUBTRACT WORK-TIME1-4     FROM EMP-PREV-DUTY-NUM
141100        ELSE
141200           MOVE ZEROS                  TO EMP-PREV-DUTY-NUM
141300        END-IF
141400     END-IF
141500     IF EMP-PREV-DUTY                   > ZERO
141600        MOVE ZEROS                     TO WORK-TIME1
141700                                          WORK-TIME2
141800        MOVE P925-ACTUAL-TIME-ON-DUTY  TO WORK-TIME1-4
141900        MOVE EMP-PREV-DUTY             TO WORK-TIME2-4
142000        ADD  WORK-TIME2-HR             TO WORK-TIME1-HR
142100        MOVE WORK-TIME1-MN             TO WORK-TIME3
142200        ADD  WORK-TIME2-MN             TO WORK-TIME3
142300        PERFORM UNTIL WORK-TIME3        < 00060
142400           ADD  1                      TO WORK-TIME1-HR
142500           SUBTRACT 00060            FROM WORK-TIME3
142600        END-PERFORM
142700        MOVE WORK-TIME3                TO WORK-TIME1-MN
142800        MOVE WORK-TIME1-4              TO P925-US-PREV-DUTY
142900*CNC0484
143000        IF P925-WORK-END-DATE-TIME      > SPACES  AND
143100           WS-APPLY-LIMBO-NO
143200           MOVE ZEROS                  TO WORK-TIME1
143300                                          WORK-TIME2
143400           MOVE P925-US-PREV-TOT-DUTY  TO WORK-TIME1-4
143500           MOVE EMP-PREV-DUTY          TO WORK-TIME2-4
143600           ADD  WORK-TIME2-HR          TO WORK-TIME1-HR
143700           MOVE WORK-TIME1-MN          TO WORK-TIME3
143800           ADD  WORK-TIME2-MN          TO WORK-TIME3
143900           PERFORM UNTIL WORK-TIME3     < 00060
144000              ADD  1                   TO WORK-TIME1-HR
144100              SUBTRACT 00060           FROM WORK-TIME3
144200           END-PERFORM
144300           MOVE WORK-TIME3             TO WORK-TIME1-MN
144400           MOVE WORK-TIME1-4           TO P925-US-PREV-TOT-DUTY
144500        ELSE
144600           MOVE P925-US-PREV-DUTY      TO P925-US-PREV-TOT-DUTY
144700        END-IF
144800     ELSE
144900        MOVE P925-ACTUAL-TIME-ON-DUTY  TO P925-US-PREV-DUTY
145000     END-IF
145100     IF  P925-RESPITE-FROM-TIME        NUMERIC
145200     AND P925-RESPITE-FROM-TIME         > ZERO
145300     AND P925-RESPITE-TO-TIME          NUMERIC
145400     AND P925-RESPITE-TO-TIME           > ZERO
145500        IF P925-RESPITE-TO-TIME         < P925-RESPITE-FROM-TIME
145600           COMPUTE WORK-TOTAL-RESPITE = 24 * 60
145700              - P925-RESPITE-FROM-HOURS * 60
145800              - P925-RESPITE-FROM-MINUTES
145900              + P925-RESPITE-TO-HOURS * 60
146000              + P925-RESPITE-TO-MINUTES
146100        ELSE
146200           COMPUTE WORK-TOTAL-RESPITE =
146300                P925-RESPITE-TO-HOURS * 60
146400              + P925-RESPITE-TO-MINUTES
146500              - P925-RESPITE-FROM-HOURS * 60
146600              - P925-RESPITE-FROM-MINUTES
146700        END-IF
146800        IF WORK-TOTAL-RESPITE >= (4 * 60)
146900           COMPUTE WORK-PREV-DUTY-MINUTES =
147000                P925-US-PREV-DUTY-HOURS * 60
147100              + P925-US-PREV-DUTY-MINUTES
147200           IF WORK-TOTAL-RESPITE > WORK-PREV-DUTY-MINUTES
147300              MOVE SPACES TO P925-US-PREV-DUTY
147400           ELSE
147500              SUBTRACT WORK-TOTAL-RESPITE FROM
147600                   WORK-PREV-DUTY-MINUTES
147700              COMPUTE P925-US-PREV-DUTY-HOURS =
147800                   WORK-PREV-DUTY-MINUTES / 60
147900              COMPUTE WORK-PREV-DUTY-MINUTES =
148000                   WORK-PREV-DUTY-MINUTES
148100                 - P925-US-PREV-DUTY-HOURS * 60
148200              MOVE WORK-PREV-DUTY-MINUTES TO
148300                   P925-US-PREV-DUTY-MINUTES
148400           END-IF
148500*CNC0484
148600           IF P925-WORK-END-DATE-TIME      > SPACES  AND
148700              WS-APPLY-LIMBO-NO
148800              MOVE ZEROES    TO WORK-PREV-DUTY-MINUTES
148900              COMPUTE WORK-PREV-DUTY-MINUTES =
149000                      P925-US-PREV-TOT-DUTY-HR * 60
149100                    + P925-US-PREV-TOT-DUTY-MN
149200              IF WORK-TOTAL-RESPITE > WORK-PREV-DUTY-MINUTES
149300                 MOVE SPACES TO P925-US-PREV-TOT-DUTY
149400              ELSE
149500                 SUBTRACT WORK-TOTAL-RESPITE FROM
149600                      WORK-PREV-DUTY-MINUTES
149700                 COMPUTE P925-US-PREV-TOT-DUTY-HR =
149800                      WORK-PREV-DUTY-MINUTES / 60
149900                 COMPUTE WORK-PREV-DUTY-MINUTES   =
150000                      WORK-PREV-DUTY-MINUTES
150100                    - P925-US-PREV-TOT-DUTY-HR * 60
150200                 MOVE WORK-PREV-DUTY-MINUTES TO
150300                      P925-US-PREV-TOT-DUTY-MN
150400              END-IF
150500           ELSE
150600              MOVE P925-US-PREV-DUTY  TO P925-US-PREV-TOT-DUTY
150700           END-IF
150800        END-IF
150900     END-IF
151000     .
151100*
151200******************************************************************
151300 P2010-CALCULATE-US-REST.
151400******************************************************************
151500*
151600*    SEE IF EMPLOYEE HAD A 4 HOUR BREAK WHEN CALLED FOR THIS
151700*    TOUR OF DUTY
151800*
151900*-----------------------------------------------------------------
152000     MOVE ZEROS                     TO DATE-CONVERSION-PARMS
152100     SET  PARM-DIFF                 TO TRUE
152200*BUG C549-S
152300     IF WS-UNADJ-OD-CENT-DATE-TIME > SPACES
152400*       09/02/03   TJR
152500        MOVE WS-UNADJ-OD-DATE          TO PARM-PRI-DATE-GREG
152600        MOVE WS-UNADJ-OD-TIME          TO PARM-PRI-HRMN
152700     ELSE
152800*       09/02/03   TJR
152900        MOVE P925-OD-DATE              TO PARM-PRI-DATE-GREG
153000        MOVE P925-OD-TIME              TO PARM-PRI-HRMN
153100     END-IF
153200*BUG C549-E
153300     PERFORM P7000-CONVERT-MASTER-DATES
153400     PERFORM P7100-CONVERT-P925-DATES
153500*BUG C549-S
153600     IF WS-UNADJ-OD-CENT-DATE-TIME > SPACES
153700        MOVE WS-UNADJ-OD-CENT-DATE-TIME
153800          TO WS-HOLD-P925-OD-DT-TM-CE
153900     END-IF
154000*BUG C549-E
154100     IF P925-ADJ-TIE-UP-FUNCTION
154200        IF SAVE-PREV-TU-TIME        NUMERIC
154300           MOVE SAVE-PREV-TU-DATE   TO PARM-SEC-DATE-GREG
154400           MOVE SAVE-PREV-TU-HRMN   TO PARM-SEC-HRMN
154500        END-IF
154600     ELSE
154700        IF  LAST-ARRIVAL-TIME       NUMERIC
154800        AND WS-LAST-ARRT-CENT        > LAST-TIE-UP-TIME
154900        AND WS-LAST-ARRT-CENT    NOT > WS-HOLD-P925-OD-DT-TM-CE
155000           MOVE AT-DATE             TO PARM-SEC-DATE-GREG
155100           MOVE AT-TIME-OF-DAY      TO PARM-SEC-HRMN
155200        ELSE
155300           IF  LAST-TIE-UP-TIME     NUMERIC
155400           AND WS-LAST-TUT-CENT  NOT > WS-HOLD-P925-OD-DT-TM-CE
155500              MOVE TUT-DATE         TO PARM-SEC-DATE-GREG
155600              MOVE TUT-TIME-OF-DAY  TO PARM-SEC-HRMN
155700           END-IF
155800        END-IF
155900     END-IF
156000     IF PARM-SEC-DATE-GREG           > ZERO
156100        EXEC CICS LINK
156200                  PROGRAM (P903-PGM)
156300                  COMMAREA(DATE-CONVERSION-PARMS)
156400                  LENGTH  (P903-LGTH)
156500                  RESP    (WS-RESPONSE)
156600        END-EXEC
156700        MOVE WS-RESPONSE            TO FILE-STATUS
156800        IF NOT SUCCESS
156900           MOVE 'P2010-1'           TO ERR-PARAGRAPH
157000           PERFORM P9999-GOT-PROBLEM
157100        END-IF
157200        IF PARM-RES-HRMN             > 0359
157300        OR PARM-RES-TOT-DAYS         > ZERO
157400           SET  EMP-HAD-4HR-BREAK   TO TRUE
157500        END-IF
157600     ELSE
157700        SET  EMP-HAD-4HR-BREAK      TO TRUE
157800     END-IF
157900*-----------------------------------------------------------------
158000*    COMPUTE DATE/TIME EMPLOYEE WILL BE RESTED IN THE U.S.
158100*-----------------------------------------------------------------
158200     MOVE SPACES                   TO CNTLKEY-AREA
158300     SET HOS-THRESHOLD-REC         TO TRUE
158400     MOVE CNTLKEY-AREA             TO CNTLKEY
158500     EXEC CICS READ
158600               DATASET(CNTL-FILE-VIA-CNTLKEY)
158700               INTO(WS-CNTL-FILE)
158800               LENGTH(CNTLFILE-RLGTH)
158900               RIDFLD(CNTLKEY)
159000               KEYLENGTH(CNTLFILE-KLGTH)
159100               RESP(WS-RESPONSE)
159200     END-EXEC
159300     MOVE WS-RESPONSE              TO FILE-STATUS
159400     IF NOT SUCCESS
159500        MOVE 'P2010-3'             TO ERR-PARAGRAPH
159600        MOVE CNTLKEY               TO ERR-KEY
159700        PERFORM P9999-GOT-PROBLEM
159800     END-IF
159900     MOVE CNTL-HS-US-ACTIVATE-FL   TO WS-HS-US-ACTIVATE-FL
160000*CNC0484
160100     IF WS-HS-US-ACTIVATE
160200        MOVE ZEROS                TO WS-RSA-TIME-HRMN
160300        MOVE ZEROS                TO DATE-CONVERSION-PARMS
160400        SET PARM-DIFF             TO TRUE
160500        MOVE P925-OD-DATE         TO PARM-PRI-DATE-GREG
160600        MOVE P925-OD-TIME         TO PARM-PRI-HRMN
160700        MOVE P925-OFFD-DATE       TO PARM-SEC-DATE-GREG
160800        MOVE P925-OFFD-TIME       TO PARM-SEC-HRMN
160900        PERFORM P9100-LINK-TO-P903
161000        MOVE PARM-RES-HRMN        TO WS-RSA-TIME-HRMN
161100*C1117-BEG
161200        IF  P925-RESPITE-FROM-TIME  NUMERIC
161300        AND P925-RESPITE-FROM-TIME  >  ZERO
161400        AND P925-RESPITE-TO-TIME    NUMERIC
161500        AND P925-RESPITE-TO-TIME    >  ZERO
161600*
161700         PERFORM P7150-CALC-RESPITE-DURATION
161800*
161900         COMPUTE WS-RESP-TEMP = WS-RESPITE-HR * 60 + WS-RESPITE-MN
162000         COMPUTE WS-RESP-TEMP1 = WS-RSA-HR * 60 + WS-RSA-MN
162100         SUBTRACT WS-RESP-TEMP FROM WS-RESP-TEMP1
162200         DIVIDE WS-RESP-TEMP1 BY 60
162300         GIVING WS-RSA-HR, REMAINDER WS-RSA-MN
162400        END-IF
162500*C1117-END
162600        COMPUTE WS-RSA-HR = WS-RSA-HR + (PARM-RES-TOT-DAYS * 24)
162700        IF WS-RSA-HR >= 12
162800           SUBTRACT 12 FROM  WS-RSA-HR
162900           ADD 10                 TO WS-RSA-HR
163000           MOVE ZEROS             TO DATE-CONVERSION-PARMS
163100           SET PARM-ADD           TO TRUE
163200           MOVE P925-OFFD-DATE    TO PARM-PRI-DATE-GREG
163300           MOVE P925-OFFD-TIME    TO PARM-PRI-HRMN
163400           MOVE WS-RSA-HR         TO PARM-SEC-HR
163500           MOVE WS-RSA-MN         TO PARM-SEC-MN
163600        ELSE
163700           MOVE ZEROS             TO DATE-CONVERSION-PARMS
163800           SET PARM-ADD           TO TRUE
163900           MOVE P925-OFFD-DATE    TO PARM-PRI-DATE-GREG
164000           MOVE P925-OFFD-TIME    TO PARM-PRI-HRMN
164100           MOVE 1000              TO PARM-SEC-HRMN
164200        END-IF
164300     ELSE
164400        MOVE ZEROS                TO DATE-CONVERSION-PARMS
164500        SET PARM-ADD              TO TRUE
164600        MOVE P925-OFFD-DATE       TO PARM-PRI-DATE-GREG
164700        MOVE P925-OFFD-TIME       TO PARM-PRI-HRMN
164800        IF P925-US-PREV-DUTY       > 1159
164900           IF  EMP-HAD-4HR-BREAK
165000           AND EMP-PREV-DUTY       > '0000'
165100              MOVE 0800           TO PARM-SEC-HRMN
165200           ELSE
165300              MOVE 1000           TO PARM-SEC-HRMN
165400           END-IF
165500        ELSE
165600           MOVE 0800              TO PARM-SEC-HRMN
165700        END-IF
165800     END-IF
165900     EXEC CICS LINK
166000               PROGRAM(P903-PGM)
166100               COMMAREA(DATE-CONVERSION-PARMS)
166200               LENGTH(P903-LGTH)
166300               RESP(WS-RESPONSE)
166400     END-EXEC
166500     MOVE WS-RESPONSE             TO FILE-STATUS
166600     IF NOT SUCCESS
166700        MOVE 'P2010-2'            TO ERR-PARAGRAPH
166800        PERFORM P9999-GOT-PROBLEM
166900     END-IF
167000     MOVE PARM-RES-DATE-GREG      TO P925-US-REST-DATE
167100     MOVE PARM-RES-HRMN           TO P925-US-REST-TIME
167200     .
167300*
167400******************************************************************
167500 P3000-CALCULATE-MTOD.
167600******************************************************************
167700*
167800*    "MTOD" HOURS OF SERVICE ARE ALWAYS FROM ORDER TIME
167900*    TO OFF DUTY TIME
168000*
168100*-----------------------------------------------------------------
168200     MOVE ZEROS                    TO DATE-CONVERSION-PARMS
168300     SET PARM-DIFF                 TO TRUE
168400     MOVE P925-OFFD-DATE           TO PARM-PRI-DATE-GREG
168500     MOVE P925-OFFD-TIME           TO PARM-PRI-HRMN
168600     MOVE P925-OD-DATE             TO PARM-SEC-DATE-GREG
168700     MOVE P925-OD-TIME             TO PARM-SEC-HRMN
168800     EXEC CICS LINK
168900               PROGRAM(P903-PGM)
169000               COMMAREA(DATE-CONVERSION-PARMS)
169100               LENGTH(P903-LGTH)
169200               RESP(WS-RESPONSE)
169300     END-EXEC
169400     MOVE WS-RESPONSE        TO FILE-STATUS
169500     IF NOT SUCCESS
169600        MOVE 'P3000-1'       TO ERR-PARAGRAPH
169700        PERFORM P9999-GOT-PROBLEM
169800     END-IF
169900     MOVE ZEROS              TO WORK-TIME3
170000     IF PARM-RES-TOT-DAYS > ZERO
170100        MULTIPLY PARM-RES-TOT-DAYS BY 2400
170200        GIVING WORK-TIME3
170300     END-IF
170400     MOVE WORK-TIME3         TO WORK-TIME1
170500     ADD PARM-RES-HR         TO WORK-TIME1-HR
170600     MOVE PARM-RES-MN        TO WORK-TIME1-MN
170700     IF WORK-TIME1            > 09959
170800        MOVE 09959           TO WORK-TIME1
170900     END-IF
171000     MOVE WORK-TIME1-4       TO P925-MTOD
171100     PERFORM P3200-CHECK-SCHED
171200     .
171300*
171400******************************************************************
171500 P3010-CALCULATE-MTOD-REST.
171600******************************************************************
171700*
171800     MOVE SPACES                   TO WORK-EMP-3HR-BREAK-FLAG
171900     PERFORM P7000-CONVERT-MASTER-DATES
172000     PERFORM P7100-CONVERT-P925-DATES
172100     MOVE ZEROS                    TO P925-MTOD-AMT
172200     IF  P925-DEADHEAD
172300     AND P925-TIE-UP-HOME
172400     AND (WS-HOLD-P925-OD-DT-TM-CE  < WS-EMP-MTOD-CENT
172500     OR  EMP-MTOD               NOT > '0000000000')
172600     AND EMP-LAST-MTOD-AMT NUMERIC
172700     AND EMP-LAST-MTOD-AMT > ZEROES
172800        IF EMP-LAST-MTOD-AMT       NUMERIC
172900           MOVE EMP-LAST-MTOD-AMT  TO P925-MTOD-AMT
173000        END-IF
173100     ELSE
173200*-----------------------------------------------------------------
173300*       CALCULATE THE EMPLOYEE'S CONTINUOUS DUTY (ALL RECENT TOURS
173400*       WITH BREAKS OF FEWER THAN THREE HOURS)
173500*-----------------------------------------------------------------
173600        PERFORM P3015-CHECK-EMPTOD-LOG
173700*-----------------------------------------------------------------
173800*       DETERMINE HOW MUCH MANDATORY TIME OFF DUTY THE EMPLOYEE
173900*       IS REQUIRED TO TAKE. (NONE IS POSSIBLE)
174000*-----------------------------------------------------------------
174100*CNC0600B
174200        MOVE ZERO TO WS-MTOD-1
174300*CNC0600E
396200
396200*CNLD-287-B COMMENTING
396200
174400*        IF WORK-EMP-MTOD > 1000
174500**CNC0598-B
174600*           AND NOT WS-CAN-WRR-NEW
174700**CNC0598-E
174800*           PERFORM P3030-GET-HSVC-CNTL-REC
174900*           SET ENTRY-NOT-FOUND      TO TRUE
175000*           PERFORM VARYING SUB1 FROM 1 BY 1
175100*              UNTIL SUB1 > 10 OR ENTRY-FOUND
175200*              IF CNTL-A1-SERVICE(SUB1) = P925-JOB-TYPE
175300*                 AND CNTL-A1-TERM(SUB1) = P925-TERM
175400*                 AND ((CNTL-A1-RD-YD(SUB1) = 'Y'
175500*                     AND P925-TIE-UP-YARD)
175600*                     OR
175700*                     (CNTL-A1-RD-YD(SUB1) = 'R'
175800*                     AND P925-TIE-UP-ROAD))
175900*                 SET ENTRY-FOUND    TO TRUE
176000*              END-IF
176100*           END-PERFORM
176200*           IF NOT ENTRY-FOUND
176300*              PERFORM VARYING SUB1 FROM 1 BY 1
176400*                 UNTIL SUB1 > 10 OR ENTRY-FOUND
176500*                 IF ((CNTL-A1-SERVICE(SUB1) = 'YD'
176600*                    AND P925-TIE-UP-YARD)
176700*                    OR
176800*                    (CNTL-A1-SERVICE(SUB1) = 'RD'
176900*                    AND P925-TIE-UP-ROAD)
177000*                    AND CNTL-A1-TERM(SUB1) = P925-TERM)
177100*                    SET ENTRY-FOUND TO TRUE
177200*                 END-IF
177300*              END-PERFORM
177400*           END-IF
177500*           SUBTRACT 1 FROM SUB1
177600*           IF ENTRY-FOUND
177700*              PERFORM P3040-GET-HSVC-CNTL2-REC
177800*              IF SUCCESS
177900*                 AND CNTL-A2-REQ-MTOD(SUB1) > SPACES
178000*                 MOVE CNTL-A2-REQ-MTOD-NUM(SUB1)
178100*                                    TO P925-MTOD-AMT
178200*              ELSE
178300*                 MOVE 0600          TO P925-MTOD-AMT
178400*              END-IF
178500*           ELSE
178600*              MOVE 0600             TO P925-MTOD-AMT
178700*           END-IF
178800**CNC0598-B
178900*        ELSE
179000*           IF WS-CAN-WRR-NEW
396200
396200*CNLD-287-E
396200
396200*CNLD-310-B
396200              IF EIBTRNID = P31B-TRAN
396200                 IF P925-TERM = 'O'
396200*                   OUTPOST
179800                    MOVE '0800'     TO P925-MTOD-AMT
396200                 ELSE
396200                    IF P925-TERM = 'A'
396200*                      AWAY
179800                       MOVE '0800'  TO P925-MTOD-AMT
396200                    ELSE
396200*                      HOME(H)/XB(H)/UNASSIGNED(U)/DATA-UNCLEAR(N)
179800                       MOVE '1000'  TO P925-MTOD-AMT
396200                    END-IF
396200                 END-IF
396200*CNLD-334-B
396200                 MOVE WORK-EMP-MTOD-1 TO P925-MTOD
396200*CNLD-334-E
396200              ELSE
396200*CNLD-310-E
179100                 IF P925-TERM = 'H'
179200                    MOVE '1000'        TO P925-MTOD-AMT
179300                    PERFORM P6550-IS-HOME-AN-OUTPOST
179400                    IF WS-HOME-IS-AN-OUTPOST
179500                       MOVE '0800'     TO P925-MTOD-AMT
179600                    END-IF
179700                 ELSE
179800                    MOVE '0800'        TO P925-MTOD-AMT
179900                 END-IF
396200*CNLD-310-B
179900              END-IF
396200*CNLD-310-E
180000*CNC0600-B
180100*IF EMPLOYEE WORKED FOR MORE THAN 16 HOURS, ADD THE TIME WORKED
180200*AFTER 12HOURS TO MTOD
180300              IF WORK-EMP-MTOD-1 > 1600
180400                 MOVE P925-MTOD-AMT TO WS-MTOD-TEMP
180500                 COMPUTE WS-MTOD-1 = WORK-EMP-MTOD-1 - 1200
180600                 ADD WS-MTOD-1      TO WS-MTOD-TEMP
180700                 MOVE WS-MTOD-TEMP  TO P925-MTOD-AMT
396200*CNLD-334-B
396200                 SET P925-REST-EXTENDED-FULL TO TRUE
396200*CNLD-334-E
180800              END-IF
180900*CNC0600-E
396200
396200*CNLD-287-B COMMENTING
396200
181000*           END-IF
181100**CNC0598-E
181200*        END-IF
396200
396200*CNLD-287-E
396200
181300     END-IF
181400*-----------------------------------------------------------------
181500*    CALCULATE THE MTOD RESTED DATE/TIME
181600*-----------------------------------------------------------------
181700     IF P925-MTOD-AMT > ZERO
181800        MOVE ZEROS                  TO DATE-CONVERSION-PARMS
181900        SET PARM-ADD                TO TRUE
182000        MOVE P925-OFFD-DATE         TO PARM-PRI-DATE-GREG
182100        MOVE P925-OFFD-TIME         TO PARM-PRI-HRMN
182200        MOVE P925-MTOD-AMT          TO PARM-SEC-HRMN
182300        EXEC CICS LINK
182400                  PROGRAM(P903-PGM)
182500                  COMMAREA(DATE-CONVERSION-PARMS)
182600                  LENGTH(P903-LGTH)
182700                  RESP(WS-RESPONSE)
182800        END-EXEC
182900        MOVE WS-RESPONSE            TO FILE-STATUS
183000        IF NOT SUCCESS
183100           MOVE 'P3010-3'           TO ERR-PARAGRAPH
183200           PERFORM P9999-GOT-PROBLEM
183300        END-IF
183400        MOVE PARM-RES-DATE-GREG     TO P925-MTOD-DATE
183500        MOVE PARM-RES-HRMN          TO P925-MTOD-TIME
183600     ELSE
183700        MOVE ZEROS                  TO P925-MTOD-DATE-TIME
183800     END-IF
183900*CNC0600-B
184000*   CHECK HERE TO DETERMINE IF EXTENDING THE REST FOR A
184100*   ON-DUTY TIME OVER 16 HOURS IS GREATER THAN 8:00AM.
184200
184300*   FIRST CHECK IF THE ORIGINAL MTOD IS GREATER THAN 8:00
184400*   THIS FIELD WILL NOT CONTAIN A VALUE UNLESS WWR IS TURNED ON
184500*   AND WORK TIME IS GREATER THAN 16 HOURS.
184600     IF WS-MTOD-1 > ZERO
184700        MOVE PARM-RES-DATE-GREG     TO WS-MTOD-W-EXTENDED-DT
184800        MOVE PARM-RES-HRMN          TO WS-MTOD-W-EXTENDED-TM
184900        MOVE ZEROS                  TO DATE-CONVERSION-PARMS
185000        SET PARM-SUBTRACT           TO TRUE
185100        MOVE WS-MTOD-W-EXTENDED-DT  TO PARM-PRI-DATE-GREG
185200        MOVE WS-MTOD-W-EXTENDED-TM  TO PARM-PRI-HRMN
185300        MOVE WS-MTOD-1              TO PARM-SEC-HRMN
185400        EXEC CICS LINK
185500                  PROGRAM(P903-PGM)
185600                  COMMAREA(DATE-CONVERSION-PARMS)
185700                  LENGTH(P903-LGTH)
185800                  RESP(WS-RESPONSE)
185900        END-EXEC
186000        MOVE WS-RESPONSE            TO FILE-STATUS
186100        IF NOT SUCCESS
186200           MOVE 'P3010-4'           TO ERR-PARAGRAPH
186300           PERFORM P9999-GOT-PROBLEM
186400        END-IF
186500        MOVE PARM-RES-DATE-GREG     TO WS-ORIG-MTOD-DATE
186600        MOVE PARM-RES-HRMN          TO WS-ORIG-MTOD-TIME
186700*      IF NON-EXTENDED REST WAS PAST 8:00 JUST LET IT RUN
186800        IF WS-ORIG-MTOD-DATE = P925-MTOD-DATE
186900           IF WS-ORIG-MTOD-TIME < '0800'
187000*      DETERMINE WHICH IS LESS THE 0800 OR EXTENDED REST.
187100              IF P925-MTOD-TIME > '0800'
187200                 MOVE '0800'           TO P925-MTOD-TIME
396200*CNLD-334-B
396200                 SET P925-REST-EXTENDED-08AM TO TRUE
396200*CNLD-334-E
187300*             ELSE
187400*                LEAVE IT HOW IT IS.
187500              END-IF
187600*          ELSE
187700*             LEAVE IT HOW IT IS.
187800           END-IF
187900        ELSE
188000           IF WS-ORIG-MTOD-DATE < P925-MTOD-DATE
188100              IF P925-MTOD-TIME > '0800'
188200                 MOVE '0800'           TO P925-MTOD-TIME
396200*CNLD-334-B
396200                 SET P925-REST-EXTENDED-08AM TO TRUE
396200*CNLD-334-E
188300*             ELSE
188400*                LEAVE IT HOW IT IS.
188500              END-IF
188600*          ELSE
188700*             LEAVE IT HOW IT IS.
188800           END-IF
188900        END-IF
189000     END-IF
189100*CNC0600-E
189200
189200*CNLD-309 B  COMMENTING
189200*    IF P925-CALC-CAN-HRS-SVC
189200*CNLD-309 E
189500
396200*CNLD-287-B
189500
189300**CNC0598-B
189400*        IF WS-CAN-WRR-NEW
189500*           MOVE SPACES              TO P925-MTOR-DATE-TIME
189600*                                       P925-MTOY-DATE-TIME
189700*        ELSE
189800**CNC0598-E
189900*           PERFORM P3025-CALC-MTOY-MTOR-TIMES
190000**CNC0598-B
190100*        END-IF
190200**CNC0598-E
189500
189200*CNLD-309 B  COMMENTING
189500*         MOVE SPACES              TO P925-MTOR-DATE-TIME
189600*                                     P925-MTOY-DATE-TIME
189200*CNLD-309 E
189500
396200*CNLD-287-E
189500
189200*CNLD-309 B  COMMENTING
190300*    END-IF
189200*CNLD-309 E
190400     .
190500*================================================================*
190600 P3015-CHECK-EMPTOD-LOG.
190700*================================================================*
190800     MOVE ZEROES                        TO WORK-EMP-MTOD
190900                                           I
191000     MOVE SPACES                        TO WS-EMP-TOD
191100                                           WS-LAST-OD-DATE-TIME
191200                                           WS-LAST-OD-TZ
191300                                           WS-TOUR-ARRAY
191400                                           WS-PROCESS-DATE
191500                                           WS-RESPITE-2-DTTM
191600     MOVE P925-EMP-NO                   TO EMPTOD-EMP-NBR
191700     IF P925-RESPITE-FROM-TIME > SPACES
191800*
191900*       USE THE START OF THE SECOND WORK PERIOD TO BEGIN
192000*       BROWSING THROUGH THE TOD LOG IF RESPITE WAS CLAIMED.
192100*
192200        PERFORM P7105-RESPITE-CALCS
192300        MOVE WS-RESPITE-OD-DT-TM-CE     TO EMPTOD-OD-DATE-TIME
192400     ELSE
192500        MOVE WS-HOLD-P925-OD-DT-TM-CE   TO EMPTOD-OD-DATE-TIME
192600     END-IF
192700     MOVE EMPTOD-KEY-AREA               TO EMPTOD-EMPKEY
192800
192900     PERFORM P8060-EMPTOD-STARTBR
193000     PERFORM P8070-EMPTOD-READNEXT
193100     IF NOT SUCCESS
193200*
193300*       THIS IS IN CASE WE GET AN END-OF-FILE RESPONSE.  BY DOING
193400*       A START BROWSE, AND THEN A READPREV, WE SHOULD GET THE
193500*       EMPLOYEE'S LAST RECORD
193600*
193700        PERFORM P8060-EMPTOD-STARTBR
193800     END-IF
193900
194000     SET TOD-NOT-DONE                   TO TRUE
194100     PERFORM UNTIL TOD-DONE
194200        MOVE ZEROS                      TO WORK-TIME1
194300        PERFORM P8080-EMPTOD-READPREV
194400        IF SUCCESS
194500           IF EMPTOD-EMP-NBR = P925-EMP-NO
194600              IF (EMPTOD-VIRTUAL-ENTRY
194700              AND P925-INCLUDE-VIRTUALS)
194800                 OR NOT EMPTOD-VIRTUAL-ENTRY
194900                 IF EMPTOD-TIME-ZONE <= SPACES
195000                    PERFORM P3021-GET-DEFAULT-TZ
195100                 END-IF
195200                 PERFORM P3016-LOAD-ARRAY
195300                 IF WS-LAST-OD-DATE-TIME > SPACES
195400                 AND NOT EMP-HAD-3HR-BREAK
195500                    PERFORM P3019-DETERMINE-GAP
195600                    IF PARM-RES-HRMN < 0300
195700                    AND PARM-RES-TOT-DAYS NOT > ZERO
195800                       PERFORM P3017-ADD-TO-MTOD-TOTAL
195900                    ELSE
196000                       SET EMP-HAD-3HR-BREAK  TO TRUE
196100                       IF EMPTOD-OD-DATE = WS-PROCESS-DATE
196200                          PERFORM P3018-SEE-IF-SPLIT-SHIFT
196300                          IF SPLIT-SHIFT
196400                             PERFORM P3017-ADD-TO-MTOD-TOTAL
196500                             SET TOD-DONE  TO TRUE
196600                          END-IF
196700                       ELSE
196800                          SET TOD-DONE     TO TRUE
196900                       END-IF
197000                    END-IF
197100                 ELSE
197200                    IF EMP-HAD-3HR-BREAK
197300                       IF EMPTOD-OD-DATE = WS-PROCESS-DATE
197400                          PERFORM P3018-SEE-IF-SPLIT-SHIFT
197500                          IF SPLIT-SHIFT
197600                             PERFORM P3017-ADD-TO-MTOD-TOTAL
197700                             SET TOD-DONE  TO TRUE
197800                          END-IF
197900                       ELSE
198000                          SET TOD-DONE     TO TRUE
198100                       END-IF
198200                    ELSE
198300*
198400*                   THIS IS THE FIRST LOG RECORD WE'RE PROCESSING
198500*                   (THE TOUR TYING UP OR BEING ADJUSTED). GET
198600*                   THE TOUR'S DURATION AND MOVE IT TO THE MTOD
198700*                   RUNNING TOTAL.
198800*
198900*CNC0600-B SETTING FLAG TO CAPTURE CURRENT TOUR'S DURATION
199000                       SET WS-CURRENT-TOUR TO TRUE
199100*CNC0600-E
199200                       PERFORM P3017-ADD-TO-MTOD-TOTAL
199300                       IF EMPTOD-RESPITE-2
199400                          MOVE EMPTOD-OD-DATE-TIME
199500                                           TO WS-RESPITE-2-DTTM
199600                       END-IF
199700                    END-IF
199800                 END-IF
199900                 IF NOT TOD-DONE
200000                    MOVE EMPTOD-OD-DATE-TIME
200100                                           TO WS-LAST-OD-DATE-TIME
200200                    MOVE EMPTOD-TIME-ZONE  TO WS-LAST-OD-TZ
200300                    MOVE EMPTOD-OD-DATE    TO WS-PROCESS-DATE
200400                 END-IF
200500              END-IF
200600           ELSE
200700              IF EMPTOD-EMP-NBR < P925-EMP-NO
200800                 SET TOD-DONE           TO TRUE
200900              END-IF
201000           END-IF
201100        ELSE
201200           SET TOD-DONE                 TO TRUE
201300           IF NOT (NO-RECORD-FND OR END-OF-FILE)
201400              MOVE 'P3015-3'            TO ERR-PARAGRAPH
201500              MOVE EMPTOD-EMPKEY        TO ERR-KEY
201600              PERFORM P9999-GOT-PROBLEM
201700           END-IF
201800        END-IF
201900     END-PERFORM
202000
202100     PERFORM P8090-EMPTOD-ENDBR
202200     .
202300*================================================================*
202400 P3016-LOAD-ARRAY.
202500*================================================================*
202600     IF WS-PROCESS-DATE > SPACES
202700        AND EMPTOD-OD-DATE NOT = WS-PROCESS-DATE
202800        MOVE SPACES                     TO WS-TOUR-ARRAY
202900        MOVE ZERO                       TO I
203000     END-IF
203100     ADD 1                              TO I
203200     MOVE EMPTOD-DIST                   TO WS-TOUR-DIST(I)
203300     MOVE EMPTOD-SDIST                  TO WS-TOUR-SUB-DIST(I)
203400     MOVE EMPTOD-TRAIN-ASGN             TO WS-TOUR-TRAIN-ASGN(I)
203500     MOVE EMPTOD-CRAFT                  TO WS-TOUR-CRAFT(I)
203600     IF EMPTOD-RESPITE-1
203700        SET WS-TOUR-RESPITE-1(I)        TO TRUE
203800        IF WS-RESPITE-2-DTTM > SPACES
203900           PERFORM P3020-RECALC-P925-MTOD
204000           MOVE SPACES                  TO WS-RESPITE-2-DTTM
204100        END-IF
204200     END-IF
204300     IF EMPTOD-RESPITE-2
204400        SET WS-TOUR-RESPITE-2(I)        TO TRUE
204500     END-IF
204600     .
204700*================================================================*
204800 P3017-ADD-TO-MTOD-TOTAL.
204900*================================================================*
205000     INITIALIZE DATE-CONVERSION-PARMS
205100     SET PARM-DIFF                      TO TRUE
205200     MOVE EMPTOD-OD-DATE                TO PARM-PRI-DATE-GREG
205300     MOVE EMPTOD-OD-TIME                TO PARM-PRI-HRMN
205400     MOVE EMPTOD-OFFD-DATE              TO PARM-SEC-DATE-GREG
205500     MOVE EMPTOD-OFFD-TIME              TO PARM-SEC-HRMN
205600
205700     EXEC CICS LINK
205800               PROGRAM(P903-PGM)
205900               COMMAREA(DATE-CONVERSION-PARMS)
206000               LENGTH(P903-LGTH)
206100               RESP(WS-RESPONSE)
206200     END-EXEC
206300
206400     MOVE WS-RESPONSE                   TO FILE-STATUS
206500     IF NOT SUCCESS
206600        MOVE 'P3017-1'                  TO ERR-PARAGRAPH
206700        PERFORM P9999-GOT-PROBLEM
206800     END-IF
206900*CNLD-253-DXC-B
207000     IF PARM-RES-TOT-DAYS > 0
207100         COMPUTE PARM-RES-HR =
207200           PARM-RES-HR + (PARM-RES-TOT-DAYS * 24)
207300     END-IF
207400*CNLD-253-DXC-E
207500     MOVE ZEROES                        TO CALC-MNS
207600     MOVE WORK-EMP-MTOD                 TO WORK-TIME1-4
207700     MOVE WORK-TIME1-MN                 TO CALC-MNS
207800     ADD PARM-RES-HR                    TO WORK-TIME1-HR
207900     ADD PARM-RES-MN                    TO CALC-MNS
208000*CNC0600-B
208100     IF WS-CURRENT-TOUR
208200         MOVE PARM-RES-HRMN             TO WORK-EMP-MTOD-1
208300         MOVE SPACES                    TO WS-CURRENT-TOUR-FLAG
208400     END-IF
208500*CNC0600-E
208600     IF CALC-MNS                         > 59
208700        ADD 1                           TO WORK-TIME1-HR
208800        SUBTRACT 60                   FROM CALC-MNS
208900     END-IF
209000     MOVE CALC-MNS(2:2)                 TO WORK-TIME1-MN
209100
209200*\/* - BEGIN - @CNC0396 - IF PARM-RES-TOT-DAYS IS > ZERO, WE
209300*                       - MUST ADD 24 HOURS FOR EACH "DAY"
209400*                       - IN THE PARM-RES-TOT-DAYS FIELD. THEN
209500*                       - ADD IN HOURS CALCULATED ABOVE TO GIVE
209600*                       - US A TRUE WORK-EMP-MTOD CALCULATION.
209700     IF ( PARM-RES-TOT-DAYS > ZERO )
209800        MOVE ZERO                TO WS-TOT-DAYS
209900        MOVE ZERO                TO WS-TOT-HOURS
210000        MOVE ZERO                TO WS-REMAINDER-HOURS
210100        MOVE PARM-RES-TOT-DAYS   TO WS-TOT-DAYS
210200        MOVE WORK-TIME1-4        TO WS-REMAINDER-HOURS
210300        MULTIPLY WS-TOT-DAYS     BY 2400
210400           GIVING WS-TOT-HOURS
210500        ADD  WS-REMAINDER-HOURS  TO WS-TOT-HOURS
210600        MOVE WS-TOT-HOURS        TO WORK-TIME1-4
210700     END-IF
210800*/\* - END   - @CNC0396
210900
211000     MOVE WORK-TIME1-4                  TO WORK-EMP-MTOD
211100     .
211200*================================================================*
211300 P3018-SEE-IF-SPLIT-SHIFT.
211400*================================================================*
211500*
211600*    IF THIS TOUR IS OUT OF A DD/SD WHERE SPLIT SHIFT ASSIGNMENTS
211700*    ARE TO BE TREATED AS ONE UNIT, SEE IF IT IS THE FIRST SPLIT
211800*    OF THE DAY.  IF SO, ADD ITS DURATION TO THE MTOD RUNNING
211900*    TOTAL.
212000*
212100     SET NOT-SPLIT-SHIFT                TO TRUE
212200*
212300*    DEADHEAD 'HOME' RECORDS DO NOT CONTAIN THE EMPLOYEE'S
212400*    DIST/SUB-DIST AND WILL NEVER BE PART OF A SPLIT SHIFT, SO
212500*    IGNORE THEM.
212600*
212700     IF EMPTOD-DIST      > SPACES
212800        AND EMPTOD-SDIST > SPACES
212900        MOVE SPACES                     TO WS-CNTL-FILE
213000        SET SUB-DIST-TYPE-2A-REC        TO TRUE
213100        MOVE EMPTOD-DIST                TO CNTL-DIST
213200        MOVE EMPTOD-SDIST               TO CNTL-SUB-DIST
213300        PERFORM P8030-READ-CNTL-FILE
213400        IF SUCCESS
213500           IF NOT CNTL-SPLIT-SHIFT-HOS
213600              PERFORM VARYING J FROM 1 BY 1
213700                 UNTIL J > ARRAY-MAX
213800                 IF WS-TOUR-DIST(J) > SPACES
213900                    IF EMPTOD-DIST       = WS-TOUR-DIST(J)
214000                    AND EMPTOD-SDIST     = WS-TOUR-SUB-DIST(J)
214100                    AND EMPTOD-TRAIN-ASGN = WS-TOUR-TRAIN-ASGN(J)
214200                    AND EMPTOD-CRAFT     = WS-TOUR-CRAFT(J)
214300                    AND J            NOT = I
214400                       IF NOT (EMPTOD-RESPITE-1
214500                          AND WS-TOUR-RESPITE-2(J))
214600                          SET SPLIT-SHIFT TO TRUE
214700                          MOVE ARRAY-MAX   TO J
214800                       END-IF
214900                    END-IF
215000                 ELSE
215100                    MOVE ARRAY-MAX      TO J
215200                 END-IF
215300              END-PERFORM
215400           END-IF
215500        ELSE
215600           MOVE 'P3018-1'               TO ERR-PARAGRAPH
215700           MOVE CNTLKEY                 TO ERR-KEY
215800           PERFORM P9999-GOT-PROBLEM
215900        END-IF
216000     END-IF
216100     .
216200*================================================================*
216300 P3019-DETERMINE-GAP.
216400*================================================================*
216500     INITIALIZE DATE-CONVERSION-PARMS
216600     SET PARM-DIFF                      TO TRUE
216700     MOVE EMPTOD-OFFD-DATE              TO PARM-PRI-DATE-GREG
216800     MOVE EMPTOD-OFFD-TIME              TO PARM-PRI-HRMN
216900     IF EMPTOD-TIME-ZONE = WS-LAST-OD-TZ
217000        MOVE WS-LAST-OD-DATE            TO PARM-SEC-DATE-GREG
217100        MOVE WS-LAST-OD-TIME            TO PARM-SEC-HRMN
217200     ELSE
217300        MOVE SPACES                     TO TZ-PARAMETERS
217400        MOVE WS-LAST-OD-TZ              TO TZ-IN-ZONE
217500        MOVE WS-LAST-OD-DATE            TO TZ-IN-DATE
217600        MOVE WS-LAST-OD-TIME            TO TZ-IN-TIME
217700        MOVE EMPTOD-TIME-ZONE           TO TZ-OUT-ZONE
217800        PERFORM P8996-TIMEZONE
217900        IF TZ-INVALID-PARAMETERS
218000           MOVE 'P3019TZ1'              TO ERR-PARAGRAPH
218100           PERFORM P8996-TZERROR
218200        END-IF
218300        MOVE TZ-OUT-DATE                TO PARM-SEC-DATE-GREG
218400        MOVE TZ-OUT-TIME                TO PARM-SEC-HRMN
218500     END-IF
218600
218700     EXEC CICS LINK
218800               PROGRAM(P903-PGM)
218900               COMMAREA(DATE-CONVERSION-PARMS)
219000               LENGTH(P903-LGTH)
219100               RESP(WS-RESPONSE)
219200     END-EXEC
219300
219400     MOVE WS-RESPONSE                   TO FILE-STATUS
219500     IF NOT SUCCESS
219600        MOVE 'P3019-1'                  TO ERR-PARAGRAPH
219700        PERFORM P9999-GOT-PROBLEM
219800     END-IF
219900     .
220000*================================================================*
220100 P3020-RECALC-P925-MTOD.
220200*================================================================*
220300*
220400*    IF THERE WAS A THREE HOUR OR GREATER RESPITE BREAK, SUBTRACT
220500*    THE FIRST LEG OF THE TRIP'S DURATION, AS WELL AS THE RESPITE
220600*    DURATION, FROM P925-MTOD.
220700*
220800     MOVE ZEROS                         TO DATE-CONVERSION-PARMS
220900     SET PARM-DIFF                      TO TRUE
221000     MOVE WS-RESPITE-2-DATE             TO PARM-PRI-DATE-GREG
221100     MOVE WS-RESPITE-2-TIME             TO PARM-PRI-HRMN
221200     MOVE EMPTOD-OFFD-DATE              TO PARM-SEC-DATE-GREG
221300     MOVE EMPTOD-OFFD-TIME              TO PARM-SEC-HRMN
221400     EXEC CICS LINK
221500               PROGRAM(P903-PGM)
221600               COMMAREA(DATE-CONVERSION-PARMS)
221700               LENGTH(P903-LGTH)
221800               RESP(WS-RESPONSE)
221900     END-EXEC
222000     MOVE WS-RESPONSE                   TO FILE-STATUS
222100     IF NOT SUCCESS
222200        MOVE 'P3020-1'                  TO ERR-PARAGRAPH
222300        PERFORM P9999-GOT-PROBLEM
222400     END-IF
222500     IF PARM-RES-HRMN > 0259
222600        OR PARM-RES-TOT-DAYS > ZERO
222700        MOVE ZEROS                      TO DATE-CONVERSION-PARMS
222800        SET PARM-DIFF                   TO TRUE
222900        MOVE EMPTOD-OD-DATE             TO PARM-PRI-DATE-GREG
223000        MOVE EMPTOD-OD-TIME             TO PARM-PRI-HRMN
223100        MOVE WS-RESPITE-2-DATE          TO PARM-SEC-DATE-GREG
223200        MOVE WS-RESPITE-2-TIME          TO PARM-SEC-HRMN
223300        EXEC CICS LINK
223400                  PROGRAM(P903-PGM)
223500                  COMMAREA(DATE-CONVERSION-PARMS)
223600                  LENGTH(P903-LGTH)
223700                  RESP(WS-RESPONSE)
223800        END-EXEC
223900        MOVE WS-RESPONSE                TO FILE-STATUS
224000        IF NOT SUCCESS
224100           MOVE 'P3020-2'               TO ERR-PARAGRAPH
224200           PERFORM P9999-GOT-PROBLEM
224300        END-IF
224400        MOVE ZEROES                     TO CALC-MNS
224500        MOVE P925-MTOD(1:2)             TO CALC-HRS
224600        MOVE P925-MTOD(3:2)             TO CALC-MNS
224700        IF PARM-RES-MN                   > CALC-MNS
224800           SUBTRACT 1                 FROM CALC-HRS
224900           ADD 60                       TO CALC-MNS
225000        END-IF
225100        SUBTRACT PARM-RES-HR          FROM CALC-HRS
225200        SUBTRACT PARM-RES-MN          FROM CALC-MNS
225300        MOVE CALC-HRS                   TO WORK-TIME1-HR
225400        MOVE CALC-MNS(2:2)              TO WORK-TIME1-MN
225500        MOVE WORK-TIME1-4               TO WORK-EMP-MTOD
225600                                           P925-MTOD
225700     END-IF
225800     .
225900*================================================================*
226000 P3021-GET-DEFAULT-TZ.
226100*================================================================*
226200     IF EMPTOD-DIST > SPACES
226300        AND EMPTOD-SDIST > SPACES
226400        MOVE SPACES                     TO WS-CNTL-FILE
226500        SET SUB-DIST-TYPE-REC           TO TRUE
226600        MOVE EMPTOD-DIST                TO CNTL-DIST
226700        MOVE EMPTOD-SDIST               TO CNTL-SUB-DIST
226800        PERFORM P8030-READ-CNTL-FILE
226900        IF SUCCESS
227000           MOVE CNTL-TIME-ZONE          TO EMPTOD-TIME-ZONE
227100        ELSE
227200           MOVE 'P3021-1'               TO ERR-PARAGRAPH
227300           MOVE CNTLKEY                 TO ERR-KEY
227400           PERFORM P9999-GOT-PROBLEM
227500        END-IF
227600     ELSE
227700        MOVE WS-EMP-TIME-ZONE           TO EMPTOD-TIME-ZONE
227800     END-IF
227900     .
396200
396200*CNLD-287-B
396200
228000**===============================================================*
228100* P3025-CALC-MTOY-MTOR-TIMES.
228200**===============================================================*
228300*     MOVE SPACES                    TO WS-SCHED-OFFD-DATE-TIME
228400*     PERFORM P3030-GET-HSVC-CNTL-REC
228500*     SET ENTRY-NOT-FOUND            TO TRUE
228600**
228700**    CALCULATE THE MTOY TIME
228800**
228900*     PERFORM VARYING SUB1 FROM 1 BY 1
229000*        UNTIL SUB1 > 10 OR ENTRY-FOUND
229100*        IF CNTL-A1-SERVICE(SUB1) = P925-JOB-TYPE
229200*           AND CNTL-A1-TERM(SUB1) = P925-TERM
229300*           AND CNTL-A1-RD-YD(SUB1) = 'Y'
229400*           SET ENTRY-FOUND          TO TRUE
229500*        END-IF
229600*     END-PERFORM
229700*     IF NOT ENTRY-FOUND
229800*        PERFORM VARYING SUB1 FROM 1 BY 1
229900*           UNTIL SUB1 > 10 OR ENTRY-FOUND
230000*           IF CNTL-A1-SERVICE(SUB1) = 'YD'
230100*              AND CNTL-A1-TERM(SUB1) = P925-TERM
230200*              SET ENTRY-FOUND       TO TRUE
230300*           END-IF
230400*        END-PERFORM
230500*     END-IF
230600*     MOVE ZEROS                     TO DATE-CONVERSION-PARMS
230700*     SET PARM-ADD                   TO TRUE
230800*     MOVE P925-OFFD-DATE            TO PARM-PRI-DATE-GREG
230900*     MOVE P925-OFFD-TIME            TO PARM-PRI-HRMN
231000*     IF ENTRY-FOUND
231100*        SUBTRACT 1                FROM SUB1
231200*     ELSE
231300*        MOVE 1                      TO SUB1
231400*        MOVE '0800'                 TO CNTL-A1-REQ-REST(SUB1)
231500*     END-IF
231600*     IF CNTL-A1-REQ-REST(SUB1) > '0000'
231700*        MOVE CNTL-A1-REQ-REST(SUB1) TO PARM-SEC-HRMN
231800*        EXEC CICS LINK
231900*                  PROGRAM(P903-PGM)
232000*                  COMMAREA(DATE-CONVERSION-PARMS)
232100*                  LENGTH(P903-LGTH)
232200*                  RESP(WS-RESPONSE)
232300*        END-EXEC
232400*        MOVE WS-RESPONSE            TO FILE-STATUS
232500*        IF NOT SUCCESS
232600*           MOVE 'P3025-2'           TO ERR-PARAGRAPH
232700*           PERFORM P9999-GOT-PROBLEM
232800*        END-IF
232900*        MOVE PARM-RES-DATE-GREG     TO P925-MTOY-DATE
233000*        MOVE PARM-RES-HRMN          TO P925-MTOY-TIME
233100*     ELSE
233200*        MOVE P925-OFFD-DATE-TIME    TO P925-MTOY-DATE-TIME
233300*     END-IF
233400**
233500**    CALCULATE THE MTOR TIME
233600**
233700*     SET ENTRY-NOT-FOUND            TO TRUE
233800*     PERFORM VARYING SUB1 FROM 1 BY 1
233900*        UNTIL SUB1 > 10 OR ENTRY-FOUND
234000*        IF CNTL-A1-SERVICE(SUB1) = P925-JOB-TYPE
234100*           AND CNTL-A1-TERM(SUB1) = P925-TERM
234200*           AND CNTL-A1-RD-YD(SUB1) = 'R'
234300*           SET ENTRY-FOUND          TO TRUE
234400*        END-IF
234500*     END-PERFORM
234600*     IF NOT ENTRY-FOUND
234700*        PERFORM VARYING SUB1 FROM 1 BY 1
234800*           UNTIL SUB1 > 10 OR ENTRY-FOUND
234900*           IF CNTL-A1-SERVICE(SUB1) = 'RD'
235000*              AND CNTL-A1-TERM(SUB1) = P925-TERM
235100*              SET ENTRY-FOUND       TO TRUE
235200*           END-IF
235300*        END-PERFORM
235400*     END-IF
235500*     MOVE ZEROS                     TO DATE-CONVERSION-PARMS
235600*     SET PARM-ADD                   TO TRUE
235700*     MOVE P925-OFFD-DATE            TO PARM-PRI-DATE-GREG
235800*     MOVE P925-OFFD-TIME            TO PARM-PRI-HRMN
235900*     IF ENTRY-FOUND
236000*        SUBTRACT 1                FROM SUB1
236100*     ELSE
236200*        MOVE 1                      TO SUB1
236300*        MOVE '0600'                 TO CNTL-A1-REQ-REST(SUB1)
236400*     END-IF
236500*     IF CNTL-A1-REQ-REST(SUB1) > '0000'
236600*        MOVE CNTL-A1-REQ-REST(SUB1) TO PARM-SEC-HRMN
236700*        EXEC CICS LINK
236800*                  PROGRAM(P903-PGM)
236900*                  COMMAREA(DATE-CONVERSION-PARMS)
237000*                  LENGTH(P903-LGTH)
237100*                  RESP(WS-RESPONSE)
237200*        END-EXEC
237300*        MOVE WS-RESPONSE            TO FILE-STATUS
237400*        IF NOT SUCCESS
237500*           MOVE 'P3025-3'           TO ERR-PARAGRAPH
237600*           PERFORM P9999-GOT-PROBLEM
237700*        END-IF
237800*        MOVE PARM-RES-DATE-GREG     TO P925-MTOR-DATE
237900*        MOVE PARM-RES-HRMN          TO P925-MTOR-TIME
238000*     ELSE
238100*        MOVE P925-OFFD-DATE-TIME    TO P925-MTOR-DATE-TIME
238200*     END-IF.
238300**===============================================================*
238400* P3030-GET-HSVC-CNTL-REC.
238500**===============================================================*
238600*     MOVE SPACES                    TO CNTLKEY-AREA
238700*     SET HOURS-OF-SVC-REC           TO TRUE
238800*     MOVE DIST IN WS-MSTR           TO CNTL-A1-DIST
238900*     MOVE SUB-DIST IN WS-MSTR       TO CNTL-A1-SUB-DIST
239000*     PERFORM P8030-READ-CNTL-FILE
239100*     IF NOT SUCCESS
239200*        MOVE '**'                   TO CNTL-A1-SUB-DIST
239300*        PERFORM P8030-READ-CNTL-FILE
239400*        IF NOT SUCCESS
239500*           MOVE '**'                TO CNTL-A1-DIST
239600*           PERFORM P8030-READ-CNTL-FILE
239700*        END-IF
239800*     END-IF
239900*     IF NOT SUCCESS
240000*        IF NO-RECORD-FND
240100**
240200**          IF WE DON'T FIND AN ENTRY SET THE DEFAULTS AS FOLLOW
240300**
240400*           SET SUCCESS              TO TRUE
240500*           MOVE SPACES              TO WS-CNTL-FILE
240600*           MOVE 'YD'                TO CNTL-A1-SERVICE(1)
240700*           MOVE 'RD'                TO CNTL-A1-SERVICE(2)
240800*           MOVE 'RD'                TO CNTL-A1-SERVICE(3)
240900*           MOVE 'H'                 TO CNTL-A1-TERM(1)
241000*           MOVE 'A'                 TO CNTL-A1-TERM(2)
241100*           MOVE 'H'                 TO CNTL-A1-TERM(3)
241200*           MOVE '1800'              TO CNTL-A1-MAX-24(1)
241300*                                       CNTL-A1-MAX-24(2)
241400*                                       CNTL-A1-MAX-24(3)
241500*           MOVE '0800'              TO CNTL-A1-REQ-REST(1)
241600*           MOVE '0600'              TO CNTL-A1-REQ-REST(2)
241700*           MOVE '0800'              TO CNTL-A1-REQ-REST(3)
241800*           MOVE 'Y'                 TO CNTL-A1-RR-CONS(1)
241900*                                       CNTL-A1-RR-CONS(2)
242000*                                       CNTL-A1-RR-CONS(3)
242100*           MOVE '1200'              TO CNTL-A1-MAX-TOUR(1)
242200*                                       CNTL-A1-MAX-TOUR(2)
242300*                                       CNTL-A1-MAX-TOUR(3)
242400*           MOVE 'Y'                 TO CNTL-A1-RD-YD(1)
242500*           MOVE 'R'                 TO CNTL-A1-RD-YD(2)
242600*           MOVE 'R'                 TO CNTL-A1-RD-YD(3)
242700**
242800*        ELSE
242900*           MOVE 'P3030-1'           TO ERR-PARAGRAPH
243000*           MOVE CNTLKEY             TO ERR-KEY
243100*           PERFORM P9999-GOT-PROBLEM
243200*        END-IF
243300*     END-IF.
243400**
243500**===============================================================*
243600* P3040-GET-HSVC-CNTL2-REC.
243700**===============================================================*
243800*     SET HOURS-OF-SVC2-REC          TO TRUE
243900*     PERFORM P8030-READ-CNTL-FILE
244000*     IF NOT SUCCESS
244100*        IF NOT NO-RECORD-FND
244200*           MOVE 'P3040-1'           TO ERR-PARAGRAPH
244300*           MOVE CNTLKEY             TO ERR-KEY
244400*           PERFORM P9999-GOT-PROBLEM
244500*        END-IF
244600*     END-IF.
396200
396200*CNLD-287-E
396200
244700******************************************************************
244800 P3200-CHECK-SCHED.
244900******************************************************************
245000     PERFORM P7100-CONVERT-P925-DATES
245100
245200     MOVE P925-EMP-NO                   TO EMPTOD-EMP-NBR
245300     MOVE WS-HOLD-P925-OD-DT-TM-CE      TO EMPTOD-OD-DATE-TIME
245400     MOVE EMPTOD-KEY-AREA               TO EMPTOD-EMPKEY
245500     EXEC CICS READ
245600               DATASET(EMPTOD-VIA-EMP)
245700               INTO(WS-EMP-TOD)
245800               LENGTH(EMPTOD-EMP-RLGTH)
245900               RIDFLD(EMPTOD-EMPKEY)
246000               KEYLENGTH(EMPTOD-EMP-KLGTH)
246100               RESP(WS-RESPONSE)
246200     END-EXEC
246300     MOVE WS-RESPONSE                   TO FILE-STATUS
246400     IF SUCCESS
246500        IF EMPTOD-DIST      > SPACES
246600           AND EMPTOD-SDIST > SPACES
246700           MOVE EMPTOD-DIST             TO WS-TOD-DIST
246800           MOVE EMPTOD-SDIST            TO WS-TOD-SDIST
246900        ELSE
247000*
247100*          DEADHEAD 'HOME' RECORDS DO NOT CONTAIN THE EMPLOYEE'S
247200*          DIST/SUB-DIST - DEFAULT TO HIS MASTER DD/SD.
247300*
247400* WHY ARE WE RE-READING EMPLOYEE MASTER HERE.  IT WAS READ
247500* THE VERY FIRST THING WHEN WE STARTED PROCESSING
247600* I THINK THIS IS A TOTAL WASTE.
247700           MOVE P925-EMP-NO             TO MSTRNBRK
247800           EXEC CICS READ
247900                     DATASET(MSTR-VIA-EMP-NBR)
248000                     INTO(WS-MSTR)
248100                     LENGTH(MSTRENBR-RLGTH)
248200                     RIDFLD(MSTRNBRK)
248300                     KEYLENGTH(MSTRENBR-KLGTH)
248400                     RESP(WS-RESPONSE)
248500           END-EXEC
248600           MOVE WS-RESPONSE             TO FILE-STATUS
248700           IF NOT SUCCESS
248800              MOVE 'P3200-1'            TO ERR-PARAGRAPH
248900              MOVE MSTRNBRK             TO ERR-KEY
249000              PERFORM P9999-GOT-PROBLEM
249100           END-IF
249200           MOVE DIST     OF WS-MSTR     TO WS-TOD-DIST
249300           MOVE SUB-DIST OF WS-MSTR     TO WS-TOD-SDIST
249400        END-IF
249500        MOVE EMPTOD-TRAIN-ASGN          TO WS-TOD-TRAIN-ASGN
249600        MOVE EMPTOD-CRAFT               TO WS-TOD-CRAFT
249700        SET TOD-NOT-DONE                TO TRUE
249800        MOVE '0000'                     TO EMPTOD-OD-TIME
249900*
250000*  NEED TO CHECK DIST/SUB-DIST HERE BECAUSE DIST/SDIST NEEDS TO
250100*  BE BASED ON ASSIGNMENT NOT EMPLOYEE TO BE CONSISTENT WITH ALL
250200*  OTHER CHANGES FOR CNC0387
250300
250400        MOVE SPACES                   TO CNTLKEY-AREA
250500        MOVE '2A'                     TO CNTL-REC-TYPE
250600        MOVE WS-TOD-DIST              TO CNTL-DIST
250700        MOVE WS-TOD-SDIST             TO CNTL-SUB-DIST
250800        MOVE CNTLKEY-AREA             TO CNTLKEY
250900        EXEC CICS READ
251000                  DATASET(CNTL-FILE-VIA-CNTLKEY)
251100                  INTO(WS-CNTL-FILE)
251200                  LENGTH(CNTLFILE-RLGTH)
251300                  RIDFLD(CNTLKEY)
251400                  KEYLENGTH(CNTLFILE-KLGTH)
251500                  RESP(WS-RESPONSE)
251600        END-EXEC
251700        MOVE WS-RESPONSE              TO FILE-STATUS
251800        IF NOT SUCCESS
251900           MOVE 'P3200-2'             TO ERR-PARAGRAPH
252000           MOVE CNTLKEY               TO ERR-KEY
252100           PERFORM P9999-GOT-PROBLEM
252200        END-IF
252300        IF CNTL-SPLIT-SHIFT-HOS
252400           SET TOD-DONE TO TRUE
252500        END-IF
252600
252700        PERFORM UNTIL TOD-DONE
252800           MOVE EMPTOD-KEY-AREA         TO EMPTOD-EMPKEY
252900           EXEC CICS READ
253000                     DATASET(EMPTOD-VIA-EMP)
253100                     INTO(WS-EMP-TOD)
253200                     LENGTH(EMPTOD-EMP-RLGTH)
253300                     RIDFLD(EMPTOD-EMPKEY)
253400                     KEYLENGTH(EMPTOD-EMP-KLGTH)
253500                     GTEQ
253600                     RESP(WS-RESPONSE)
253700           END-EXEC
253800           MOVE WS-RESPONSE             TO FILE-STATUS
253900           IF  SUCCESS
254000           AND EMPTOD-EMP-NBR            = P925-EMP-NO
254100           AND EMPTOD-OD-DATE-CENT       = WS-HOLD-P925-OD-DATE
254200           AND EMPTOD-OD-TIME            < WS-HOLD-P925-OD-TIME
254300              IF  EMPTOD-DIST            = WS-TOD-DIST
254400              AND EMPTOD-SDIST           = WS-TOD-SDIST
254500              AND EMPTOD-TRAIN-ASGN      = WS-TOD-TRAIN-ASGN
254600              AND EMPTOD-CRAFT           = WS-TOD-CRAFT
254700              AND NOT EMPTOD-REST-RESPITE
254800              AND NOT EMPTOD-HOS-CLAIM
254900                 IF (EMPTOD-VIRTUAL-ENTRY
255000                 AND P925-INCLUDE-VIRTUALS)
255100                    OR NOT EMPTOD-VIRTUAL-ENTRY
255200                    SET P925-SCHED-2ND     TO TRUE
255300                    INITIALIZE DATE-CONVERSION-PARMS
255400                    SET PARM-DIFF          TO TRUE
255500                    MOVE EMPTOD-OFFD-DATE  TO PARM-PRI-DATE-GREG
255600                    MOVE EMPTOD-OFFD-TIME  TO PARM-PRI-HRMN
255700                    MOVE EMPTOD-OD-DATE    TO PARM-SEC-DATE-GREG
255800                    MOVE EMPTOD-OD-TIME    TO PARM-SEC-HRMN
255900                    EXEC CICS LINK
256000                              PROGRAM(P903-PGM)
256100                              COMMAREA(DATE-CONVERSION-PARMS)
256200                              LENGTH(P903-LGTH)
256300                              RESP(WS-RESPONSE)
256400                    END-EXEC
256500                    MOVE WS-RESPONSE       TO FILE-STATUS
256600                    IF NOT SUCCESS
256700                       MOVE 'P3200-3'      TO ERR-PARAGRAPH
256800                       PERFORM P9999-GOT-PROBLEM
256900                    END-IF
257000                    MOVE ZEROES            TO CALC-MNS
257100                    MOVE P925-MTOD         TO WORK-TIME1-4
257200                    ADD PARM-RES-HR        TO WORK-TIME1-HR
257300                    MOVE WORK-TIME1-MN     TO CALC-MNS
257400                    ADD PARM-RES-MN        TO CALC-MNS
257500                    IF CALC-MNS             > 59
257600                       ADD 1               TO WORK-TIME1-HR
257700                       SUBTRACT 60       FROM CALC-MNS
257800                    END-IF
257900                    MOVE CALC-MNS(2:2)     TO WORK-TIME1-MN
258000                    MOVE WORK-TIME1-4      TO P925-MTOD
258100                    SET TOD-DONE           TO TRUE
258200                    PERFORM P7200-CONVERT-2ND-DATES
258300                 END-IF
258400              END-IF
258500              ADD 1                     TO EMPTOD-OD-DATE-TIME-NUM
258600           ELSE
258700              SET TOD-DONE              TO TRUE
258800           END-IF
258900        END-PERFORM
259000     END-IF
259100     .
259200******************************************************************
259300 P4000-CALCULATE-PERS-REST.
259400******************************************************************
259500*
259600*    SCHED-END-DATE-TIME IS ONLY SET IF WE ARE TYING UP A PERSON
259700*    IN A SUB-DIST THAT USES ALT REST AND THE PERSON WORKED A YARD
259800*    JOB OR A COMMUTER.  IF THE SCHEDULED END IS GREATER THAN THE
259900*    OFF DUTY TIME, ADD THE REST TO THE SCHEDULED END TIME (UNLESS
260000*    THIS IS A U.S. EMPLOYEE WORKING THE SECOND OF 2 CONSECUTIVE
260100*    SHIFTS).
260200*
260300     MOVE ZEROS              TO DATE-CONVERSION-PARMS
260400     SET PARM-ADD            TO TRUE
260500     MOVE P925-OFFD-DATE     TO PARM-PRI-DATE-GREG
260600     MOVE P925-OFFD-TIME     TO PARM-PRI-HRMN
260700
260800     SET DE-YYMMDD-FORMAT               TO TRUE
260900     MOVE P925-SCHED-END-DATE           TO DE-YYMMDD
261000     PERFORM P8998-DATEEDIT
261100     MOVE DE-CCYYMMDD                   TO DE-COMPARE1-DATE
261200     MOVE P925-SCHED-END-TIME           TO DE-COMPARE1-TIME
261300
261400     SET DE-YYMMDD-FORMAT               TO TRUE
261500     MOVE P925-OFFD-DATE                TO DE-YYMMDD
261600     PERFORM P8998-DATEEDIT
261700     MOVE DE-CCYYMMDD                   TO DE-COMPARE2-DATE
261800     MOVE P925-OFFD-TIME                TO DE-COMPARE2-TIME
261900
262000     IF P925-SCHED-END-DATE-TIME > '0000000000'
262100        AND DE-COMPARE1-DATE-TIME > DE-COMPARE2-DATE-TIME
262200        IF EMP-PREV-DUTY-NUM NUMERIC AND
262300           EMP-PREV-DUTY-NUM > ZEROES
262400           IF PAY-AS-CAN
262500              MOVE P925-SCHED-END-DATE  TO PARM-PRI-DATE-GREG
262600              MOVE P925-SCHED-END-TIME  TO PARM-PRI-HRMN
262700           END-IF
262800        ELSE
262900           MOVE P925-SCHED-END-DATE     TO PARM-PRI-DATE-GREG
263000           MOVE P925-SCHED-END-TIME     TO PARM-PRI-HRMN
263100        END-IF
263200     END-IF
263300     MOVE P925-PERS-REST-CLMD TO PARM-SEC-HRMN
263400     EXEC CICS LINK
263500               PROGRAM(P903-PGM)
263600               COMMAREA(DATE-CONVERSION-PARMS)
263700               LENGTH(P903-LGTH)
263800               RESP(WS-RESPONSE)
263900     END-EXEC
264000     MOVE WS-RESPONSE        TO FILE-STATUS
264100     IF NOT SUCCESS
264200        MOVE 'P4000-2'       TO ERR-PARAGRAPH
264300        PERFORM P9999-GOT-PROBLEM
264400     END-IF
264500     MOVE PARM-RES-DATE-GREG TO P925-PERS-REST-DATE
264600     MOVE PARM-RES-HRMN      TO P925-PERS-REST-TIME.
264700*
264800******************************************************************
264900 P5000-CALCULATE-PENALTY.
265000*   THIS PARAGRAPH DETERMINES HELDAWAY PARAMETERS, INCLUDING
265100*   TIME HELDAWAY AND THE METHOD P970 WILL USE TO CALCULATE
265200*   THE AMOUNT DUE.
265300******************************************************************
265400*
265500     MOVE ZEROS                         TO P925-PENALTY
265600                                           DATE-CONVERSION-PARMS
265700                                           P925-HELDAWAY-CALC
265800                                           P925-HELDAWAY-HOURS
265900                                           P925-HELDAWAY-EXTRN-HRS
266000                                           WORK-TIME1
266100     MOVE SPACES                        TO P925-HELDAWAY-MISC-CODE
266200     PERFORM P5100-CALC-HELD-AWAY-ELAPSED
266300     INITIALIZE WORK-HELDAWAY-GROUP
266400     PERFORM P5500-FIND-HELD-AWAY-LIMIT
266500     MOVE WORK-TIME1-4                  TO P925-PENALTY
266600     MOVE WORK-HELDAWAY-CLAIM-CODE      TO P925-HELDAWAY-MISC-CODE
266700     MOVE WORK-HELDAWAY-CALC            TO P925-HELDAWAY-CALC
266800     MOVE WORK-HELD-AWAY-LIMIT-HR       TO P925-HELDAWAY-HOURS
266900     IF WORK-HELD-AWAY-ELAPSED           > 9959
267000        MOVE 9959                       TO WORK-HELD-AWAY-ELAPSED
267100     END-IF
267200     MOVE WORK-HELD-AWAY-ELAPSED-X      TO P925-HAHT-ELAPSED-TIME
267300
267400     IF WORK-USE-EXTENDED-RUN-CALC
267500        MOVE WORK-HELD-AWAY-EXTRN-HR    TO P925-HELDAWAY-EXTRN-HRS
267600     END-IF
267700     .
267800*
267900******************************************************************
268000 P5100-CALC-HELD-AWAY-ELAPSED.
268100*    HELD AWAY ELAPSED IS CALCULATED REGARDLESS OF HELD AWAY
268200*    PENALTY.  IS IS USED TO DETERMINE MEAL ALLOWANCE.
268300******************************************************************
268400     INITIALIZE WORK-HELD-AWAY-ELAPSED
268500     SET  PARM-DIFF                 TO TRUE
268600     MOVE P925-OD-DATE              TO PARM-PRI-DATE-GREG
268700     MOVE P925-OD-TIME              TO PARM-PRI-HRMN
268800     PERFORM P7000-CONVERT-MASTER-DATES
268900     PERFORM P7100-CONVERT-P925-DATES
269000     IF  LAST-ARRIVAL-TIME          NUMERIC
269100     AND WS-LAST-ARRT-CENT           > WS-LAST-TUT-CENT
269200     AND WS-LAST-ARRT-CENT          <= WS-HOLD-P925-OD-DT-TM-CE
269300        MOVE AT-DATE                TO PARM-SEC-DATE-GREG
269400        MOVE AT-TIME-OF-DAY         TO PARM-SEC-HRMN
269500     ELSE
269600        IF  LAST-TIE-UP-TIME        NUMERIC
269700        AND WS-LAST-TUT-CENT        <= WS-HOLD-P925-OD-DT-TM-CE
269800           MOVE TUT-DATE            TO PARM-SEC-DATE-GREG
269900           MOVE TUT-TIME-OF-DAY     TO PARM-SEC-HRMN
270000        END-IF
270100     END-IF
270200     IF PARM-SEC-DATE-GREG           > ZEROS
270300        EXEC CICS LINK
270400                  PROGRAM(P903-PGM)
270500                  COMMAREA(DATE-CONVERSION-PARMS)
270600                  LENGTH(P903-LGTH)
270700                  RESP(WS-RESPONSE)
270800        END-EXEC
270900        MOVE WS-RESPONSE            TO FILE-STATUS
271000        IF NOT SUCCESS
271100           MOVE 'P5100-1'           TO ERR-PARAGRAPH
271200           PERFORM P9999-GOT-PROBLEM
271300        END-IF
271400        COMPUTE WORK-HELD-AWAY-ELAPSED-HR = PARM-RES-TOT-DAYS
271500                * 24 + PARM-RES-HR
271600        MOVE PARM-RES-MN            TO WORK-HELD-AWAY-ELAPSED-MN
271700     END-IF
271800     .
271900*
272000******************************************************************
272100 P5500-FIND-HELD-AWAY-LIMIT.
272200******************************************************************
272300*-----------------------------------------------------------------
272400*    READ THE ASGN ON-DUTY RECORD FOR THE INITIAL JOB TYPE
272500*    IF THE ON-DUTY RECORD ISN'T FOUND, PENALTY IS NOT ASSESSED.
272600*-----------------------------------------------------------------
272700     MOVE P925-EMP-NO               TO ASGN-EMP-NO
272800     SET  ASGN-EMP-ON-DUTY-REC      TO TRUE
272900     MOVE ZEROES                    TO ASGN-EMP-DATE-TIME
273000     MOVE ASGNKEY2                  TO ASGNEMP
273100     EXEC CICS READ
273200               DATASET(ASGN-VIA-ASGNEMP)
273300               INTO(ASGN-AREA)
273400               LENGTH(ASGNEMP-RLGTH)
273500               RIDFLD(ASGNEMP)
273600               KEYLENGTH(ASGNEMP-KLGTH)
273700               RESP(WS-RESPONSE)
273800     END-EXEC
273900     MOVE WS-RESPONSE               TO FILE-STATUS
274000     IF SUCCESS
274100        PERFORM P5505-GET-CLAIM-CODE
274200        PERFORM P5510-KEEP-LOOKING
274300        IF MISC-CLM-FOUND
274400           CONTINUE
274500        ELSE
274600           IF WORK-HELDAWAY-CLAIM-CODE NOT = '11'
274700              MOVE '11'             TO WORK-HELDAWAY-CLAIM-CODE
274800              PERFORM P5510-KEEP-LOOKING
274900           END-IF
275000        END-IF
275100        IF MISC-CLM-FOUND
275200           PERFORM P5550-CALCULATE-HELDAWAY
275300        ELSE
275400           INITIALIZE WORK-HELDAWAY-GROUP
275500        END-IF
275600     ELSE
275700        IF NOT NO-RECORD-FND
275800           MOVE 'P5500-1'           TO ERR-PARAGRAPH
275900           MOVE ASGNEMP             TO ERR-KEY
276000           PERFORM P9999-GOT-PROBLEM
276100        END-IF
276200     END-IF.
276300*
276400******************************************************************
276500 P5505-GET-CLAIM-CODE.
276600******************************************************************
276700*
276800*    THE CLAIM CODE DEFAULTS TO '11' FOR HELD AWAY CLAIMS.
276900*    CHECK THE STATION RECORD TO SEE IF AN OVERRIDE CLAIMS CODE
277000*    HAS BEEN ENTERED.
277100*--------------------------------------------------------------PLS
277200     MOVE '11'                      TO WORK-HELDAWAY-CLAIM-CODE
277300*CNC0575 - BEG
277400*    MOVE SPACES                    TO TKCR-AREA
277500*    SET  STATION-REC               TO TRUE
277600*    MOVE P925-STATION              TO TKCR-STA-NO
277700*    MOVE P925-OD-DATE              TO TKCR-EXP-DATE
277800*    IF TKCR-EXP-DATE(1:2)           > 60
277900*       MOVE '19'                   TO TKCR-EXP-CE
278000*    ELSE
278100*       MOVE '20'                   TO TKCR-EXP-CE
278200*    END-IF
278300*    MOVE TKCRKEY-AREA              TO TKCRKEY
278400*    PERFORM P8020-READ-TKCR
278500*    IF SUCCESS
278600*       IF  STATION-REC
278700*       AND P925-STATION             = TKCR-STA-NO
278800*       AND TKCR-STA-HELDAWAY        > SPACES
278900*          MOVE TKCR-STA-HELDAWAY   TO WORK-HELDAWAY-CLAIM-CODE
279000*       END-IF
279100*    END-IF.
279200     MOVE SPACES                    TO P983-COMMAREA-PARMS
279300                                       WS-TKCR-FILE
279400     SET P983-GET-STATION-REC       TO TRUE
279500     SET P983-STA-NO-RETURN-REC     TO TRUE
279600     MOVE P925-OD-DATE              TO P983-DATE
279700     IF P983-YR                      > 60
279800        MOVE '19'                   TO P983-CE
279900     ELSE
280000        MOVE '20'                   TO P983-CE
280100     END-IF
280200     MOVE P925-STATION              TO P983-STATION-NO
280300     EXEC CICS LINK
280400               PROGRAM(P983-PGM)
280500               COMMAREA(P983-COMMAREA-PARMS)
280600               LENGTH(P983-LGTH)
280700               RESP(WS-RESPONSE)
280800     END-EXEC
280900     MOVE WS-RESPONSE               TO FILE-STATUS
281000     IF SUCCESS
281100        IF P983-STATION-RECORD          > SPACES
281200           MOVE P983-STATION-RECORD TO WS-TKCR-FILE
281300           IF P925-STATION           = TKCR-STA-NO
281400              IF TKCR-STA-HELDAWAY      > SPACES
281500                 MOVE TKCR-STA-HELDAWAY
281600                                    TO WORK-HELDAWAY-CLAIM-CODE
281700              END-IF
281800              IF ASGN-UFP-JOB
281900                 PERFORM VARYING SUB3 FROM 1 BY 1
282000                           UNTIL SUB3 > SUB3-MAX
282100                    IF TKCR-ALT-HA-CODE(SUB3) > SPACES
282200                       PERFORM VARYING SUB4 FROM 1 BY 1
282300                                 UNTIL SUB4 > SUB4-MAX
282400                          IF  TKCR-ALT-HA-DD(SUB3, SUB4) =
282500                              ASGN-DIST
282600                          AND TKCR-ALT-HA-SD(SUB3, SUB4) =
282700                              ASGN-SUB-DIST
282800                          AND TKCR-ALT-HA-PL(SUB3, SUB4) =
282900                              ASGN-UFP-POOL
283000                              MOVE TKCR-ALT-HA-CODE(SUB3)
283100                                       TO WORK-HELDAWAY-CLAIM-CODE
283200                          END-IF
283300                       END-PERFORM
283400                    END-IF
283500                 END-PERFORM
283600              END-IF
283700           END-IF
283800        END-IF
283900     ELSE
284000        MOVE 'P5505-1'              TO ERR-PARAGRAPH
284100        MOVE 'P983LINK'             TO ERR-KEY
284200        PERFORM P9999-GOT-PROBLEM
284300     END-IF
284400     .
284500*CNC0575 - END
284600*
284700******************************************************************
284800 P5510-KEEP-LOOKING.
284900******************************************************************
285000*
285100*    LOOK FOR A VALUE IN THE TKCR MISC CLAIM RECORD THAT COULD
285200*    OVERRIDE THE DEFAULT
285300*-----------------------------------------------------------------
285400*
285500     SET  MISC-CLM-NOT-FOUND        TO TRUE
285600     MOVE SPACES                    TO P983-COMMAREA-PARMS
285700     SET  P983-GET-MISC-CONTROL     TO TRUE
285800     MOVE P925-OD-DATE              TO P983-DATE
285900     IF P983-YR                      > 60
286000        MOVE '19'                   TO P983-CE
286100     ELSE
286200        MOVE '20'                   TO P983-CE
286300     END-IF
286400     MOVE P925-EMP-NO               TO P983-MISCC-EMP-NO
286500     MOVE WORK-HELDAWAY-CLAIM-CODE  TO P983-MISCC-CLAIM-CODE
286600     MOVE ASGN-DIST                 TO P983-MISCC-DIST
286700     MOVE ASGN-SUB-DIST             TO P983-MISCC-SDIST
286800     MOVE ASGN-UFP-CC               TO P983-MISCC-CRAFT
286900     IF P983-MISCC-CRAFT             = 'B1' OR 'B2'
287000        MOVE 'BK'                   TO P983-MISCC-CRAFT
287100     END-IF
287200     MOVE ASGN-ON-DUTY-JOB-TYPE     TO P983-MISCC-JOB-TYPE
287300     SET  P983-MISCC-RETURN-REC     TO TRUE
287400     EXEC CICS LINK
287500               PROGRAM(P983-PGM)
287600               COMMAREA(P983-COMMAREA-PARMS)
287700               LENGTH(P983-LGTH)
287800               RESP(WS-RESPONSE)
287900     END-EXEC
288000     MOVE WS-RESPONSE               TO FILE-STATUS
288100*
288200     IF SUCCESS
288300        IF P983-MISCC-FOUND
288400           SET  MISC-CLM-FOUND      TO TRUE
288500           MOVE P983-MISCC-RECORD   TO WS-TKCR-FILE
288600           MOVE TKCR-MISC-HELDAWAY-CALC
288700                                    TO WORK-HELDAWAY-CALC
288800           MOVE '1100'              TO WORK-HELD-AWAY-LIMIT
288900           IF TKCR-MISC-HELD-AWAY-HR > SPACES
289000              IF TKCR-MISC-HELDAWAY-CALC = 'X'
289100                 MOVE TKCR-MISC-HELD-AWAY-HR
289200                                    TO WORK-HELD-AWAY-EXTRN-HR
289300              ELSE
289400                 MOVE TKCR-MISC-HELD-AWAY-HR
289500                                    TO WORK-HELD-AWAY-LIMIT-HR
289600              END-IF
289700           END-IF
289800        END-IF
289900     ELSE
290000        MOVE 'P5510-1'              TO ERR-PARAGRAPH
290100        MOVE 'LINK983'              TO ERR-KEY
290200        PERFORM P9999-GOT-PROBLEM
290300     END-IF.
290400*
290500******************************************************************
290600 P5550-CALCULATE-HELDAWAY.
290700******************************************************************
290800*-----------------------------------------------------------------
290900*     ONE FINAL CHECK MUST BE DONE TO SET THE CORRECT LIMIT, IN
291000*     THE CASE OF CLAIMS WHERE A "SPECIAL HELDAWAY CALCULATION"
291100*     IS TO BE USED.
291200*--------------------------------------------------------------PLS
291300     IF WORK-HELD-AWAY-ELAPSED       > ZERO
291400        IF WORK-USE-SPEC-HELDAWAY-CALC
291500        OR WORK-USE-EXTENDED-RUN-CALC
291600           EVALUATE TRUE
291700              WHEN WORK-HELD-AWAY-ELAPSED > 1300
291800                 MOVE 800           TO WORK-HELD-AWAY-LIMIT
291900              WHEN WORK-HELD-AWAY-ELAPSED > 1200
292000                 MOVE 900           TO WORK-HELD-AWAY-LIMIT
292100              WHEN WORK-HELD-AWAY-ELAPSED > 1000
292200                 MOVE 1000          TO WORK-HELD-AWAY-LIMIT
292300           END-EVALUATE
292400        END-IF
292500        IF WORK-USE-HELDAWAY-9-11
292600        OR WORK-USE-HELDAWAY-9-14
292700           IF  SUCCESS
292800           AND ASGN-HA-PRIOR-AHMKEY       > SPACES
292900              IF WORK-USE-HELDAWAY-9-11
293000                 PERFORM P8040-FIND-REST-HA-9-11
293100              END-IF
293200              IF WORK-USE-HELDAWAY-9-14
293300                 PERFORM P8050-FIND-REST-HA-9-14
293400              END-IF
293500              IF WORK-REST-CLAIMED   > 0300
293600                 MOVE '11'          TO WORK-HELDAWAY-CLAIM-CODE
293700                 PERFORM P5510-KEEP-LOOKING
293800              ELSE
293900                 IF WORK-REST-CLAIMED       < 0300
294000                    ADD  WORK-REST-CLAIMED TO WORK-HELD-AWAY-LIMIT
294100                 ELSE
294200                    ADD  0200              TO WORK-HELD-AWAY-LIMIT
294300                 END-IF
294400              END-IF
294500           END-IF
294600        END-IF
294700        IF WORK-HELD-AWAY-ELAPSED    > WORK-HELD-AWAY-LIMIT
294800        OR WORK-HELD-AWAY-ELAPSED    > 2359
294900****       SUBTRACTION OK BECAUSE NO MINUTES
295000           COMPUTE WORK-TIME1 =
295100              WORK-HELD-AWAY-ELAPSED - WORK-HELD-AWAY-LIMIT
295200        END-IF
295300        IF WORK-TIME1                > 9959
295400           MOVE 9959                TO WORK-TIME1
295500        END-IF
295600     END-IF
295700     .
295800******************************************************************
295900 P5900-CALCULATE-US-CONT-DUTY.
296000******************************************************************
296100*
296200     PERFORM P7000-CONVERT-MASTER-DATES
296300     PERFORM P7100-CONVERT-P925-DATES
296400
296500*BUG C549-S
296600     IF WS-UNADJ-OD-CENT-DATE-TIME > SPACES
296700        MOVE WS-UNADJ-OD-CENT-DATE-TIME
296800          TO WS-HOLD-P925-OD-DT-TM-CE
296900     END-IF
297000*BUG C549-E
297100
297200     IF WS-HOLD-P925-OD-DT-TM-CE NOT < WS-EMP-US-RSTD-CENT
297300        MOVE ZEROS                 TO P925-US-CONT-DUTY
297400     ELSE
297500        MOVE ZEROS                 TO DATE-CONVERSION-PARMS
297600        SET PARM-DIFF              TO TRUE
297700*BUG C549-S
297800        IF WS-UNADJ-OD-CENT-DATE-TIME > SPACES
297900           MOVE WS-UNADJ-OD-DATE   TO PARM-PRI-DATE-GREG
298000           MOVE WS-UNADJ-OD-TIME   TO PARM-PRI-HRMN
298100        ELSE
298200           MOVE P925-OD-DATE       TO PARM-PRI-DATE-GREG
298300           MOVE P925-OD-TIME       TO PARM-PRI-HRMN
298400        END-IF
298500*BUG C549-S
298600        IF LAST-ARRIVAL-TIME NUMERIC
298700           AND WS-LAST-ARRT-CENT > WS-LAST-TUT-CENT
298800           AND WS-LAST-ARRT-CENT NOT > WS-HOLD-P925-OD-DT-TM-CE
298900           MOVE AT-DATE            TO PARM-SEC-DATE-GREG
299000           MOVE AT-TIME-OF-DAY     TO PARM-SEC-HRMN
299100        ELSE
299200           IF LAST-TIE-UP-TIME NUMERIC
299300              AND WS-LAST-TUT-CENT NOT > WS-HOLD-P925-OD-DT-TM-CE
299400              MOVE TUT-DATE        TO PARM-SEC-DATE-GREG
299500              MOVE TUT-TIME-OF-DAY TO PARM-SEC-HRMN
299600           END-IF
299700        END-IF
299800        IF PARM-SEC-DATE-GREG > ZERO
299900           EXEC CICS LINK
300000                     PROGRAM(P903-PGM)
300100                     COMMAREA(DATE-CONVERSION-PARMS)
300200                     LENGTH(P903-LGTH)
300300                     RESP(WS-RESPONSE)
300400           END-EXEC
300500           MOVE WS-RESPONSE TO FILE-STATUS
300600           IF NOT SUCCESS
300700              MOVE 'P5900-1' TO ERR-PARAGRAPH
300800              PERFORM P9999-GOT-PROBLEM
300900           END-IF
301000*-----------------------------------------------------------------
301100*          THE EMPLOYEE DID NOT HAVE A 4 HOUR BREAK, THEREFORE
301200*          THIS IS CONSIDERED CONTINUOUS DUTY.
301300*-----------------------------------------------------------------
301400           IF PARM-RES-HRMN < 0400
301500              AND PARM-RES-TOT-DAYS = ZERO
301600*-----------------------------------------------------------------
301700*             ADD THE AMOUNT OF TIME FROM THE EMPLOYEE LAST TIE UP
301800*             TO THE TIME HE IS BEING CALLED NOW, TO THEIR
301900*             PREVIOUS DUTY
302000*-----------------------------------------------------------------
302100              MOVE ZEROS          TO WORK-TIME1
302200                                     WORK-TIME3
302300              MOVE EMP-PREV-DUTY  TO WORK-TIME1-4
302400              MOVE WORK-TIME1-MN  TO WORK-TIME3
302500              ADD PARM-RES-HR     TO WORK-TIME1-HR
302600              ADD PARM-RES-MN     TO WORK-TIME3
302700              PERFORM UNTIL WORK-TIME3 < 00060
302800                 ADD 1 TO WORK-TIME1-HR
302900                 SUBTRACT 00060 FROM WORK-TIME3
303000              END-PERFORM
303100              MOVE WORK-TIME3     TO WORK-TIME1-MN
303200              IF WORK-TIME1        > 09959
303300                 MOVE 09959       TO WORK-TIME1
303400              END-IF
303500              MOVE WORK-TIME1-4   TO P925-US-CONT-DUTY
303600           ELSE
303700              MOVE EMP-PREV-DUTY  TO P925-US-CONT-DUTY
303800           END-IF
303900        ELSE
304000           MOVE ZEROS             TO P925-US-CONT-DUTY
304100        END-IF
304200     END-IF.
304300*================================================================*
304400 P6000-PERSONAL-REST-EDITS.
304500*================================================================*
304600     SET P925-PERS-REST-OK            TO TRUE
304700     MOVE SPACES                      TO WS-ASSIGN-COMMAREA
304800                                         WS-ASGN-FILE
304900*CNC0533-BEG
305000*    MOVE P925-ODA-DIST               TO ASGN-DIST
305100*    MOVE P925-ODA-SUB-DIST           TO ASGN-SUB-DIST
305200*    MOVE P925-ODA-ASGN               TO ASGN-AJ-JOB-NO
305300*    MOVE P925-ODA-CC                 TO ASGN-AJ-JOB-CC
305400*
305500*    MOVE ASGN-XB-CC                  TO WS-HOLD-ON-DUTY-CC
305600*                                        WS-CRAFT-CODE-CHECK
305700*    IF NOT VALID-CRAFT
305800*       PERFORM P6050-REDUCE-TO-MSTR-CC
305900*       MOVE WS-HOLD-MSTR-CC          TO WS-HOLD-ON-DUTY-CC
306000*    END-IF
306100*
306200*    GET THE EMPLOYEE'S CURRENT ASSIGNMENT
306300*
306400*    PERFORM P8200-GET-LATEST-TEMP-JOB
306500*    IF ASGN-ASSIGNMENT NOT > SPACES
306600*       PERFORM P8210-GET-OWNED-JOB
306700*    END-IF
306800*
306900**   GET THE EMPLOYEE'S ASSIGNMENT ON THE AAL
307000     IF P925-AHM-KEY > SPACES
307100        INITIALIZE WS-AAL-STORAGE
307200        MOVE P925-EMP-NO              TO AAL-EMP-NBR
307300        PERFORM PSQL-AALSEL02
307400        IF AAL-ASSIGNMENT > SPACES
307500           MOVE AAL-ASGN-TYP-CD       TO ASGN-JOB-TYPE
307600           MOVE AAL-DIST              TO ASGN-DIST
307700           MOVE AAL-SUB-DIST          TO ASGN-SUB-DIST
307800           MOVE AAL-ASGN-ID           TO ASGN-AJ-JOB-NO
307900           MOVE AAL-ASGN-CRFT-CD      TO ASGN-AJ-JOB-CC
308000*7/20/16 - BEG
308100***        MOVE ASGN-XB-CC            TO WS-HOLD-ON-DUTY-CC
308200***                                      WS-CRAFT-CODE-CHECK
308300           MOVE P925-ODA-CC           TO WS-HOLD-ON-DUTY-CC
308400                                         WS-CRAFT-CODE-CHECK
308500           IF NOT VALID-CRAFT
308600              PERFORM P6050-REDUCE-TO-MSTR-CC
308700              MOVE WS-HOLD-MSTR-CC          TO WS-HOLD-ON-DUTY-CC
308800           END-IF
308900*7/20/16 - END
309000        ELSE
309100*
309200*       IF NOT FOUND, WILDCARD SEARCH
309300*
309400           MOVE P925-AHM-KEY(1:2)     TO ASGN-DIST
309500           MOVE P925-AHM-KEY(3:2)     TO ASGN-SUB-DIST
309600           MOVE '******'              TO ASGN-AJ-JOB-NO
309700           MOVE '**'                  TO ASGN-AJ-JOB-CC
309800           MOVE '*'                   TO ASGN-JOB-TYPE
309900           MOVE ASGN-XB-CC            TO WS-HOLD-ON-DUTY-CC
310000                                         WS-CRAFT-CODE-CHECK
310100        END-IF
310200     ELSE
310300        MOVE 'P6000'                  TO ERR-PARAGRAPH
310400        MOVE  P925-AHM-KEY            TO ERR-KEY
310500        PERFORM P9999-GOT-PROBLEM
310600     END-IF
310700*
310800*    READ AHM-PAY-RECORD TO GET THE AHM-EXTENDED-RUN-FLAG
310900*
311000     SET  AHM-PAY-RECORD              TO TRUE
311100     MOVE 01                          TO AHM-PAYROLL-KEY-SEQUENCE
311200     MOVE P925-AHM-AHIST-KEY          TO AHMKEY
311300     MOVE AHM-FILE                    TO AHM-DATASET
311400     PERFORM P6021-READ-AH-MISC
311500     MOVE AHM-ASSIGNMENT              TO WS-ASSIGNMENT
311600     PERFORM P6022-CHECK-EXTENDED-RUN-JOB
311700     IF SUCCESS
311800       AND AHM-EXTENDED-RUN-FLAG > SPACES
311900         SET PERSONAL-REST-EDIT-REC   TO TRUE
312000     END-IF
312100*CNC0533-END
312200*
312300*    FIRST TIME LOOK FOR TKCR-A2 WITH ACTUAL CRAFT CODE. IF NOT
312400*    FOUND, SECOND TIME LOOK WITH REDUCED MASTER CRAFT CODE.
312500*
312600     SET FIRST-TIME-YES       TO TRUE
312700     SET CRAFT-NOT-DONE       TO TRUE
312800     SET CNTL-REC-NOT-FOUND   TO TRUE
312900     IF ASGN-ASSIGNMENT > SPACES
313000        PERFORM UNTIL CRAFT-DONE
313100           MOVE SPACES                TO TKCRKEY-AREA
313200           SET PERSONAL-REST-EDIT-REC TO TRUE
313300           MOVE TKCRKEY-AREA          TO WORK-TKCRKEY-A2
313400
313500           MOVE 1                     TO WK-TKCR-A2-SEQ-NUM
313600           MOVE ASGN-DIST             TO WK-TKCR-A2-DIST
313700           MOVE ASGN-SUB-DIST         TO WK-TKCR-A2-SUB-DIST
313800           MOVE ASGN-XB-CC            TO WK-TKCR-A2-CRAFT-SB
313900                                         WS-CRAFT-CODE-CHECK
314000           IF FIRST-TIME-NO
314100              SET CRAFT-DONE          TO TRUE
314200              IF NOT VALID-CRAFT
314300                 PERFORM P6050-REDUCE-TO-MSTR-CC
314400                 MOVE WS-HOLD-MSTR-CC TO WK-TKCR-A2-CRAFT-SB
314500              END-IF
314600           END-IF
314700
314800           MOVE ASGN-JOB-TYPE         TO WK-TKCR-A2-ASGN-TYPE
314900           MOVE ASGN-AJ-JOB-NO        TO WK-TKCR-A2-ASGN
315000           PERFORM P6020-READ-TKCR-A2
315100           IF SUCCESS
315200              PERFORM P6001-SEARCH-TERMINALS
315300           END-IF
315400           IF CNTL-REC-NOT-FOUND
315500              IF ASGN-UFP-JOB
315600                 OR ASGN-XB-JOB OF ASGN-JOB-TYPE
315700                 MOVE '**'            TO WK-TKCR-A2-ASGN(5:2)
315800                 PERFORM P6020-READ-TKCR-A2
315900                 IF SUCCESS
316000                    PERFORM P6001-SEARCH-TERMINALS
316100                 END-IF
316200                 IF CNTL-REC-NOT-FOUND
316300                    MOVE '**'         TO WK-TKCR-A2-ASGN(3:2)
316400                    PERFORM P6020-READ-TKCR-A2
316500                    IF SUCCESS
316600                       PERFORM P6001-SEARCH-TERMINALS
316700                    END-IF
316800                    IF CNTL-REC-NOT-FOUND
316900                       MOVE '**'      TO WK-TKCR-A2-ASGN(1:2)
317000                       PERFORM P6020-READ-TKCR-A2
317100                       IF SUCCESS
317200                          PERFORM P6001-SEARCH-TERMINALS
317300                       END-IF
317400                       IF CNTL-REC-NOT-FOUND
317500                          MOVE '*'    TO WK-TKCR-A2-ASGN-TYPE
317600                          PERFORM P6020-READ-TKCR-A2
317700                          IF SUCCESS
317800                             PERFORM P6001-SEARCH-TERMINALS
317900                          END-IF
318000                       END-IF
318100                    END-IF
318200                 END-IF
318300              ELSE
318400                 MOVE '**'            TO WK-TKCR-A2-ASGN(5:2)
318500                 PERFORM P6020-READ-TKCR-A2
318600                 IF SUCCESS
318700                    PERFORM P6001-SEARCH-TERMINALS
318800                 END-IF
318900                 IF CNTL-REC-NOT-FOUND
319000                    MOVE '**'         TO WK-TKCR-A2-ASGN(2:2)
319100                    PERFORM P6020-READ-TKCR-A2
319200                    IF SUCCESS
319300                       PERFORM P6001-SEARCH-TERMINALS
319400                    END-IF
319500                    IF CNTL-REC-NOT-FOUND
319600                       MOVE '****'    TO WK-TKCR-A2-ASGN(1:4)
319700                       PERFORM P6020-READ-TKCR-A2
319800                       IF SUCCESS
319900                          PERFORM P6001-SEARCH-TERMINALS
320000                       END-IF
320100                       IF CNTL-REC-NOT-FOUND
320200                          MOVE '*'    TO WK-TKCR-A2-ASGN-TYPE
320300                          PERFORM P6020-READ-TKCR-A2
320400                          IF SUCCESS
320500                             PERFORM P6001-SEARCH-TERMINALS
320600                          END-IF
320700                       END-IF
320800                    END-IF
320900                 END-IF
321000              END-IF
321100           END-IF
321200           IF FIRST-TIME-YES
321300              SET FIRST-TIME-NO TO TRUE
321400           END-IF
321500           IF CNTL-REC-FOUND
321600              SET CRAFT-DONE TO TRUE
321700           END-IF
321800        END-PERFORM
321900*
322000*       IF NOT FOUND, WILDCARD CRAFT CODE
322100*
322200        IF CNTL-REC-NOT-FOUND
322300           MOVE '**'                  TO WK-TKCR-A2-CRAFT-SB
322400           PERFORM P6020-READ-TKCR-A2
322500           IF SUCCESS
322600              PERFORM P6001-SEARCH-TERMINALS
322700           END-IF
322800        END-IF
322900*
323000*       IF NOT FOUND, WILDCARD SUB DISTRICT
323100*
323200        IF CNTL-REC-NOT-FOUND
323300           MOVE '**'                  TO WK-TKCR-A2-SUB-DIST
323400           PERFORM P6020-READ-TKCR-A2
323500           IF SUCCESS
323600              PERFORM P6001-SEARCH-TERMINALS
323700           END-IF
323800        END-IF
323900*
324000*       IF FOUND, LOAD TKCR DETAIL OF TWO SEQ'S TO WORKING STORAGE
324100*
324200        IF CNTL-REC-FOUND
324300           MOVE 1                     TO SUB2
324400           PERFORM P6030-LOAD-TKCR
324500           IF TKCR-A2-SERVICE(18) > SPACES
324600              PERFORM P6040-READ-TKCR-SEC-SEQ
324700              IF SUCCESS
324800                 MOVE 19              TO SUB2
324900                 PERFORM P6030-LOAD-TKCR
325000              END-IF
325100           END-IF
325200*
325300*          CHECK ROAD SWITCHER JOB TYPE
325400*
325500           MOVE SPACES                   TO CNTLKEY-AREA
325600           SET JOB-TYPE-CNTL-REC         TO TRUE
325700           MOVE 'RS'                     TO CNTL-JT-SERVICE-WORKED
325800           MOVE CNTLKEY-AREA             TO CNTLKEY
325900           EXEC CICS READ
326000                     DATASET(CNTL-FILE-VIA-CNTLKEY)
326100                     INTO(WS-CNTL-FILE)
326200                     LENGTH(CNTLFILE-RLGTH)
326300                     RIDFLD(CNTLKEY)
326400                     KEYLENGTH(CNTLFILE-KLGTH)
326500                     RESP(WS-RESPONSE)
326600           END-EXEC
326700           MOVE WS-RESPONSE              TO FILE-STATUS
326800           IF NOT SUCCESS
326900              IF NOT (NO-RECORD-FND OR END-OF-FILE)
327000                 MOVE 'P6000-3'          TO ERR-PARAGRAPH
327100                 MOVE CNTLKEY            TO ERR-KEY
327200                 PERFORM P9999-GOT-PROBLEM
327300              END-IF
327400           END-IF
327500
327600           SET JOB-TYPE-NOT-FOUND        TO TRUE
327700           IF SUCCESS
327800              PERFORM VARYING SUB1 FROM 1 BY 1
327900                 UNTIL SUB1 > 50 OR JOB-TYPE-FOUND
328000                 IF P925-JOB-TYPE = CNTL-JT-JOB-TYPE(SUB1)
328100                    SET JOB-TYPE-FOUND      TO TRUE
328200                 END-IF
328300                 IF CNTL-JT-JOB-TYPE(SUB1) <= SPACES
328400                    MOVE 50                TO SUB1
328500                 END-IF
328600              END-PERFORM
328700           END-IF
328800*
328900*          STORE TCKR-A2 DETAIL MATCHING SERVICE AND CRAFT IN WS.
329000*          SEARCH CRITERIA ORDER IS:
329100*          1) EXACT MATCH OF ROAD SWITCHER JOB TYPE, SERVICE RS
329200*             AND CRAFT
329300*          2) EXACT MATCH OF ROAD SWITCHER JOB TYPE, SERVICE RS
329400*             AND WILD CARD CRAFT
329500*          3) EXACT MATCH OF SERVICE AND CRAFT
329600*          4) EXACT MATCH OF SERVICE AND WILD CARD CRAFT
329700*          5) WILD CARD SERVICE AND EXACT MATCH OF CRAFT
329800*          6) BOTH SERVICE AND CRAFT WILD CARD
329900*
330000           SET CC-WORKED-NOT-FOUND TO TRUE
330100           PERFORM VARYING SUB1 FROM 1 BY 1
330200              UNTIL SUB1 > 36
330300*CNC0533-BEG
330400            IF AHM-EXTENDED-RUN-FLAG = 'Y'
330500*CNC0533-END
330600              IF JOB-TYPE-FOUND                    AND
330700                 WK-TKCR-A2-SERVICE(SUB1)   = 'RS' AND
330800                 WK-TKCR-A2-CC-WORKED(SUB1) = WS-HOLD-ON-DUTY-CC
330900*7/20/16 - BEG
331000              AND WK-TKCR-A2-EXT-RUN(SUB1) = 'Y'
331100*7/20/16 - END
331200                 MOVE WK-TKCR-A2-MIN-REST(SUB1) TO WK-MIN-REST1
331300                 MOVE WK-TKCR-A2-MAX-REST(SUB1) TO WK-MAX-REST1
331400                 MOVE 36                        TO SUB1
331500                 SET CC-WORKED-FOUND            TO TRUE
331600              END-IF
331700              IF JOB-TYPE-FOUND                    AND
331800                 WK-TKCR-A2-SERVICE(SUB1)   = 'RS' AND
331900                 WK-TKCR-A2-CC-WORKED(SUB1) = '**'
332000*7/20/16 - BEG
332100              AND WK-TKCR-A2-EXT-RUN(SUB1) = 'Y'
332200*7/20/16 - END
332300                 MOVE WK-TKCR-A2-MIN-REST(SUB1) TO WK-MIN-REST2
332400                 MOVE WK-TKCR-A2-MAX-REST(SUB1) TO WK-MAX-REST2
332500                 SET CC-WORKED-FOUND            TO TRUE
332600              END-IF
332700              IF WK-TKCR-A2-SERVICE(SUB1) = P925-TIE-UP-SERVICE
332800                 AND WK-TKCR-A2-CC-WORKED(SUB1)
332900                                          = WS-HOLD-ON-DUTY-CC
333000*7/20/16 - BEG
333100              AND WK-TKCR-A2-EXT-RUN(SUB1) = 'Y'
333200*7/20/16 - END
333300                 MOVE WK-TKCR-A2-MIN-REST(SUB1) TO WK-MIN-REST3
333400                 MOVE WK-TKCR-A2-MAX-REST(SUB1) TO WK-MAX-REST3
333500                 SET CC-WORKED-FOUND            TO TRUE
333600              END-IF
333700              IF WK-TKCR-A2-SERVICE(SUB1) = P925-TIE-UP-SERVICE
333800                 AND WK-TKCR-A2-CC-WORKED(SUB1) = '**'
333900*7/20/16 - BEG
334000              AND WK-TKCR-A2-EXT-RUN(SUB1) = 'Y'
334100*7/20/16 - END
334200                 MOVE WK-TKCR-A2-MIN-REST(SUB1) TO WK-MIN-REST4
334300                 MOVE WK-TKCR-A2-MAX-REST(SUB1) TO WK-MAX-REST4
334400                 SET CC-WORKED-FOUND            TO TRUE
334500              END-IF
334600              IF WK-TKCR-A2-SERVICE(SUB1) = '**'
334700                 AND WK-TKCR-A2-CC-WORKED(SUB1)
334800                                          = WS-HOLD-ON-DUTY-CC
334900*7/20/16 - BEG
335000              AND WK-TKCR-A2-EXT-RUN(SUB1) = 'Y'
335100*7/20/16 - END
335200                 MOVE WK-TKCR-A2-MIN-REST(SUB1) TO WK-MIN-REST5
335300                 MOVE WK-TKCR-A2-MAX-REST(SUB1) TO WK-MAX-REST5
335400                 SET CC-WORKED-FOUND            TO TRUE
335500              END-IF
335600              IF WK-TKCR-A2-SERVICE(SUB1) = '**'
335700                 AND WK-TKCR-A2-CC-WORKED(SUB1) = '**'
335800*7/20/16 - BEG
335900              AND WK-TKCR-A2-EXT-RUN(SUB1) = 'Y'
336000*7/20/16 - END
336100                 MOVE WK-TKCR-A2-MIN-REST(SUB1) TO WK-MIN-REST6
336200                 MOVE WK-TKCR-A2-MAX-REST(SUB1) TO WK-MAX-REST6
336300                 SET CC-WORKED-FOUND            TO TRUE
336400              END-IF
336500              IF WK-TKCR-A2-SERVICE(SUB1)       <= SPACES
336600                 MOVE 36                        TO SUB1
336700              END-IF
336800*CNC0533-BEG
336900            ELSE
337000              IF JOB-TYPE-FOUND                    AND
337100                 WK-TKCR-A2-SERVICE(SUB1)   = 'RS' AND
337200                 WK-TKCR-A2-CC-WORKED(SUB1) = WS-HOLD-ON-DUTY-CC
337300*7/20/16 - BEG
337400              AND WK-TKCR-A2-EXT-RUN(SUB1) NOT = 'Y'
337500*7/20/16 - END
337600                 MOVE WK-TKCR-A2-MIN-REST(SUB1) TO WK-MIN-REST1
337700                 MOVE WK-TKCR-A2-MAX-REST(SUB1) TO WK-MAX-REST1
337800                 MOVE 36                        TO SUB1
337900                 SET CC-WORKED-FOUND            TO TRUE
338000              END-IF
338100              IF JOB-TYPE-FOUND                    AND
338200                 WK-TKCR-A2-SERVICE(SUB1)   = 'RS' AND
338300                 WK-TKCR-A2-CC-WORKED(SUB1) = '**'
338400*7/20/16 - BEG
338500              AND WK-TKCR-A2-EXT-RUN(SUB1) NOT = 'Y'
338600*7/20/16 - END
338700                 MOVE WK-TKCR-A2-MIN-REST(SUB1) TO WK-MIN-REST2
338800                 MOVE WK-TKCR-A2-MAX-REST(SUB1) TO WK-MAX-REST2
338900                 SET CC-WORKED-FOUND            TO TRUE
339000              END-IF
339100              IF WK-TKCR-A2-SERVICE(SUB1) = P925-TIE-UP-SERVICE
339200                 AND WK-TKCR-A2-CC-WORKED(SUB1)
339300                                          = WS-HOLD-ON-DUTY-CC
339400*7/20/16 - BEG
339500              AND WK-TKCR-A2-EXT-RUN(SUB1) NOT = 'Y'
339600*7/20/16 - END
339700                 MOVE WK-TKCR-A2-MIN-REST(SUB1) TO WK-MIN-REST3
339800                 MOVE WK-TKCR-A2-MAX-REST(SUB1) TO WK-MAX-REST3
339900                 SET CC-WORKED-FOUND            TO TRUE
340000              END-IF
340100              IF WK-TKCR-A2-SERVICE(SUB1) = P925-TIE-UP-SERVICE
340200                 AND WK-TKCR-A2-CC-WORKED(SUB1) = '**'
340300*7/20/16 - BEG
340400              AND WK-TKCR-A2-EXT-RUN(SUB1) NOT = 'Y'
340500*7/20/16 - END
340600                 MOVE WK-TKCR-A2-MIN-REST(SUB1) TO WK-MIN-REST4
340700                 MOVE WK-TKCR-A2-MAX-REST(SUB1) TO WK-MAX-REST4
340800                 SET CC-WORKED-FOUND            TO TRUE
340900              END-IF
341000              IF WK-TKCR-A2-SERVICE(SUB1) = '**'
341100                 AND WK-TKCR-A2-CC-WORKED(SUB1)
341200                                          = WS-HOLD-ON-DUTY-CC
341300*7/20/16 - BEG
341400              AND WK-TKCR-A2-EXT-RUN(SUB1) NOT = 'Y'
341500*7/20/16 - END
341600                 MOVE WK-TKCR-A2-MIN-REST(SUB1) TO WK-MIN-REST5
341700                 MOVE WK-TKCR-A2-MAX-REST(SUB1) TO WK-MAX-REST5
341800                 SET CC-WORKED-FOUND            TO TRUE
341900              END-IF
342000              IF WK-TKCR-A2-SERVICE(SUB1) = '**'
342100                 AND WK-TKCR-A2-CC-WORKED(SUB1) = '**'
342200*7/20/16 - BEG
342300              AND WK-TKCR-A2-EXT-RUN(SUB1) NOT = 'Y'
342400*7/20/16 - END
342500                 MOVE WK-TKCR-A2-MIN-REST(SUB1) TO WK-MIN-REST6
342600                 MOVE WK-TKCR-A2-MAX-REST(SUB1) TO WK-MAX-REST6
342700                 SET CC-WORKED-FOUND            TO TRUE
342800              END-IF
342900              IF WK-TKCR-A2-SERVICE(SUB1)       <= SPACES
343000                 MOVE 36                        TO SUB1
343100              END-IF
343200*7/20/16 - BEG
343300***           IF CC-WORKED-FOUND
343400***              MOVE 36                        TO SUB1
343500***           END-IF
343600*7/20/16 - END
343700            END-IF
343800*CNC0533-END
343900           END-PERFORM
344000*7/20/16 - BEG
344100           IF  AHM-EXTENDED-RUN-FLAG = 'Y'
344200           AND CC-WORKED-NOT-FOUND
344300              PERFORM P6060-REREAD-EXTND-RUN-NO
344400           END-IF
344500*7/20/16 - END
344600*
344700*          MOVE HIGHEST SEARCH CRITERIA VALUE TO HOLD WS.
344800*          IF MATCHING TKCR-A2 DETAIL FOUND, COMPARE TKCR-A2 REST
344900*          HOURS WITH TIEUP REST HOURS
345000*
345100           IF CC-WORKED-FOUND
345200              IF WK-MIN-REST1 > SPACES
345300                 MOVE WK-MIN-REST1       TO HOLD-TKCR-A2-MIN-REST
345400                 MOVE WK-MAX-REST1       TO HOLD-TKCR-A2-MAX-REST
345500              ELSE
345600                 IF WK-MIN-REST2 > SPACES
345700                    MOVE WK-MIN-REST2    TO HOLD-TKCR-A2-MIN-REST
345800                    MOVE WK-MAX-REST2    TO HOLD-TKCR-A2-MAX-REST
345900                 ELSE
346000                    IF WK-MIN-REST3 > SPACES
346100                       MOVE WK-MIN-REST3 TO HOLD-TKCR-A2-MIN-REST
346200                       MOVE WK-MAX-REST3 TO HOLD-TKCR-A2-MAX-REST
346300                    ELSE
346400                       IF WK-MIN-REST4 > SPACES
346500                          MOVE WK-MIN-REST4 TO
346600                                            HOLD-TKCR-A2-MIN-REST
346700                          MOVE WK-MAX-REST4 TO
346800                                            HOLD-TKCR-A2-MAX-REST
346900                       ELSE
347000                          IF WK-MIN-REST5 > SPACES
347100                             MOVE WK-MIN-REST5 TO
347200                                            HOLD-TKCR-A2-MIN-REST
347300                             MOVE WK-MAX-REST5 TO
347400                                            HOLD-TKCR-A2-MAX-REST
347500                          ELSE
347600                             MOVE WK-MIN-REST6 TO
347700                                            HOLD-TKCR-A2-MIN-REST
347800                             MOVE WK-MAX-REST6 TO
347900                                            HOLD-TKCR-A2-MAX-REST
348000                          END-IF
348100                       END-IF
348200                    END-IF
348300                 END-IF
348400              END-IF
348500              IF P925-PERS-REST-HOURS < HOLD-TKCR-A2-MIN-REST OR
348600                 P925-PERS-REST-HOURS > HOLD-TKCR-A2-MAX-REST
348700                 MOVE 'N'          TO P925-PERS-REST-FLAG
348800              END-IF
348900           ELSE
349000              IF P925-PERS-REST-HOURS > 24
349100                 MOVE 'N'       TO P925-PERS-REST-FLAG
349200              END-IF
349300           END-IF
349400        ELSE
349500           IF P925-PERS-REST-HOURS > 24
349600              MOVE 'N'                TO P925-PERS-REST-FLAG
349700           END-IF
349800        END-IF
349900     ELSE
350000        IF P925-PERS-REST-HOURS > 24
350100           MOVE 'N'                   TO P925-PERS-REST-FLAG
350200        END-IF
350300     END-IF
350400
350500     IF CC-WORKED-FOUND
350600        MOVE HOLD-TKCR-A2-MIN-REST TO P925-PERS-REST-MIN-HRS
350700        MOVE HOLD-TKCR-A2-MAX-REST TO P925-PERS-REST-MAX-HRS
350800     ELSE
350900        MOVE '00'                  TO P925-PERS-REST-MIN-HRS
351000        MOVE '24'                  TO P925-PERS-REST-MAX-HRS
351100     END-IF
351200     .
351300*
351400 P6001-SEARCH-TERMINALS.
351500*
351600*    WE'VE FOUND A MATCHING ASSIGNMENT COMBINATION, NOW USE
351700*    THAT COMBINATION AND CHECK FOR THE ARR/HOME STATIONS
351800*
351900     MOVE WORK-TKCRKEY-A2             TO TKCRKEY-AREA
352000     MOVE P925-STATION                TO TKCR-A2-ARR-STATION
352100     MOVE EMP-HOME-TERM-CODE          TO TKCR-A2-HOME-STATION
352200     MOVE TKCRKEY-AREA                TO TKCRKEY
352300     PERFORM P6010-READ-TKCR
352400     IF SUCCESS
352500        SET CNTL-REC-FOUND            TO TRUE
352600     ELSE
352700*
352800*       IF FULLY QUALIFIED NOT FOUND, LOOK FOR QUALIFIED
352900*       HOME STATION WITH WILDCARDED ARR STATION
353000*
353100        MOVE '*****'                  TO TKCR-A2-ARR-STATION
353200        PERFORM P6010-READ-TKCR
353300        IF SUCCESS
353400           SET CNTL-REC-FOUND         TO TRUE
353500        ELSE
353600*
353700*          IF NOT FOUND, LOOK FOR QUALIFIED ARRIVAL STATION
353800*          WITH HOME STATION WILDCARDED
353900*
354000           MOVE P925-STATION          TO TKCR-A2-ARR-STATION
354100           MOVE '*****'               TO TKCR-A2-HOME-STATION
354200           PERFORM P6010-READ-TKCR
354300           IF SUCCESS
354400              SET CNTL-REC-FOUND      TO TRUE
354500           ELSE
354600*
354700*             IF NOT FOUND, WILDCARD BOTH ARR/HOME STATIONS
354800*
354900              MOVE '*****'            TO TKCR-A2-ARR-STATION
355000              PERFORM P6010-READ-TKCR
355100              IF SUCCESS
355200                 SET CNTL-REC-FOUND   TO TRUE
355300              END-IF
355400           END-IF
355500        END-IF
355600     END-IF
355700     .
355800*================================================================*
355900 P6010-READ-TKCR.
356000*================================================================*
356100     MOVE TKCRKEY-AREA                TO TKCRKEY
356200     EXEC CICS READ
356300               DATASET(TKCR-FILE-VIA-TKCRKEY)
356400               INTO(WS-TKCR-FILE)
356500               LENGTH(TKCRFILE-RLGTH)
356600               RIDFLD(TKCRKEY)
356700               KEYLENGTH(TKCRFILE-KLGTH)
356800               RESP(WS-RESPONSE)
356900     END-EXEC
357000     MOVE WS-RESPONSE                 TO FILE-STATUS
357100     IF NOT SUCCESS
357200        IF NOT (NO-RECORD-FND OR END-OF-FILE)
357300           MOVE 'P6010-1'             TO ERR-PARAGRAPH
357400           MOVE TKCRKEY               TO ERR-KEY
357500           PERFORM P9999-GOT-PROBLEM
357600        END-IF
357700     END-IF.
357800*================================================================*
357900 P6020-READ-TKCR-A2.
358000*================================================================*
358100     MOVE WORK-TKCRKEY-A2             TO TKCRKEY
358200     EXEC CICS READ
358300               GTEQ
358400               DATASET(TKCR-FILE-VIA-TKCRKEY)
358500               INTO(WS-TKCR-FILE)
358600               LENGTH(TKCRFILE-RLGTH)
358700               RIDFLD(TKCRKEY)
358800               KEYLENGTH(TKCRFILE-KLGTH)
358900               RESP(WS-RESPONSE)
359000     END-EXEC
359100     MOVE WS-RESPONSE                 TO FILE-STATUS
359200     IF SUCCESS
359300        IF PERSONAL-REST-EDIT-REC
359400           AND TKCR-A2-DIST = WK-TKCR-A2-DIST
359500           AND TKCR-A2-SUB-DIST = WK-TKCR-A2-SUB-DIST
359600           AND TKCR-A2-CRAFT-SB = WK-TKCR-A2-CRAFT-SB
359700           AND TKCR-A2-ASGN-TYPE = WK-TKCR-A2-ASGN-TYPE
359800           AND TKCR-A2-ASGN = WK-TKCR-A2-ASGN
359900           AND TKCR-A2-SEQ-NUM = WK-TKCR-A2-SEQ-NUM
360000           CONTINUE
360100        ELSE
360200           SET NO-RECORD-FND          TO TRUE
360300        END-IF
360400     ELSE
360500        IF NOT (NO-RECORD-FND OR END-OF-FILE)
360600           MOVE 'P6020-1'             TO ERR-PARAGRAPH
360700           MOVE TKCRKEY               TO ERR-KEY
360800           PERFORM P9999-GOT-PROBLEM
360900        END-IF
361000     END-IF.
361100*CNC0533-BEG
361200*================================================================*
361300 P6021-READ-AH-MISC.
361400*================================================================*
361500     EXEC CICS READ
361600               DATASET  (AHM-DATASET)
361700               INTO     (WS-AHIST-MISC)
361800               LENGTH   (AHM-RLGTH)
361900               RIDFLD   (AHMKEY)
362000               KEYLENGTH(AHM-KLGTH)
362100               RESP     (WS-RESPONSE)
362200     END-EXEC
362300     MOVE WS-RESPONSE                 TO FILE-STATUS
362400     IF NOT SUCCESS
362500        MOVE 'P6021'                  TO ERR-PARAGRAPH
362600        MOVE AHMKEY                   TO ERR-KEY
362700        PERFORM P9999-GOT-PROBLEM
362800     END-IF.
362900*================================================================*
363000 P6022-CHECK-EXTENDED-RUN-JOB.
363100*================================================================*
363200     EXEC CICS STARTBR
363300               DATASET  (AHM-DATASET)
363400               RIDFLD   (AHMKEY)
363500               GTEQ
363600               RESP     (WS-RESPONSE)
363700     END-EXEC
363800     MOVE WS-RESPONSE                 TO FILE-STATUS
363900     IF NOT SUCCESS
364000        MOVE 'P6022'                  TO ERR-PARAGRAPH
364100        MOVE AHMKEY                   TO ERR-KEY
364200        PERFORM P9999-GOT-PROBLEM
364300     END-IF
364400*
364500     SET PERSONAL-REST-EDIT-REC       TO TRUE
364600     PERFORM UNTIL DONE
364700     EXEC CICS READNEXT
364800               DATASET(AHM-DATASET)
364900               INTO(WS-AHIST-MISC)
365000               LENGTH(AHM-RLGTH)
365100               RIDFLD(AHMKEY)
365200               KEYLENGTH(AHM-KLGTH)
365300               RESP(WS-RESPONSE)
365400     END-EXEC
365500     IF AHM-ASSIGNMENT = WS-ASSIGNMENT
365600        IF AHM-RECORD-TYPE = 04
365700           IF AHM-EXTENDED-RUN-FLAG = 'Y'
365800              SET DONE                TO TRUE
365900           END-IF
366000        END-IF
366100     ELSE
366200        SET DONE                      TO TRUE
366300     END-IF
366400     END-PERFORM
366500*
366600     MOVE WS-RESPONSE                 TO FILE-STATUS
366700     EXEC CICS ENDBR
366800               DATASET(AHM-DATASET)
366900               RESP(WS-RESPONSE)
367000     END-EXEC.
367100*CNC0533-END
367200*================================================================*
367300 P6030-LOAD-TKCR.
367400*================================================================*
367500     PERFORM VARYING SUB1 FROM 1 BY 1
367600        UNTIL SUB1 > 18
367700        MOVE TKCR-A2-SERVICE(SUB1)   TO WK-TKCR-A2-SERVICE(SUB2)
367800        MOVE TKCR-A2-CC-WORKED(SUB1) TO WK-TKCR-A2-CC-WORKED(SUB2)
367900*CNC0533-BEG
368000        MOVE TKCR-A2-EXT-RUN(SUB1)   TO WK-TKCR-A2-EXT-RUN(SUB2)
368100*CNC0533-END
368200        MOVE TKCR-A2-MIN-REST(SUB1)  TO WK-TKCR-A2-MIN-REST(SUB2)
368300        MOVE TKCR-A2-MAX-REST(SUB1)  TO WK-TKCR-A2-MAX-REST(SUB2)
368400        ADD 1                        TO SUB2
368500     END-PERFORM
368600     .
368700*================================================================*
368800 P6040-READ-TKCR-SEC-SEQ.
368900*================================================================*
369000     MOVE 2                           TO TKCR-A2-SEQ-NUM
369100     MOVE TKCRKEY-AREA                TO TKCRKEY
369200     EXEC CICS READ
369300               DATASET(TKCR-FILE-VIA-TKCRKEY)
369400               INTO(WS-TKCR-FILE)
369500               LENGTH(TKCRFILE-RLGTH)
369600               RIDFLD(TKCRKEY)
369700               KEYLENGTH(TKCRFILE-KLGTH)
369800               RESP(WS-RESPONSE)
369900     END-EXEC
370000     MOVE WS-RESPONSE                 TO FILE-STATUS
370100     IF NOT SUCCESS
370200        IF NOT (NO-RECORD-FND OR END-OF-FILE)
370300           MOVE 'P6040-1'             TO ERR-PARAGRAPH
370400           MOVE TKCRKEY               TO ERR-KEY
370500           PERFORM P9999-GOT-PROBLEM
370600        END-IF
370700     END-IF
370800     .
370900*================================================================*
371000 P6050-REDUCE-TO-MSTR-CC.
371100*================================================================*
371200     IF ENGINEER-CRAFT
371300        MOVE ENGINEER-MSTR-CC   TO WS-HOLD-MSTR-CC
371400     END-IF
371500     IF FIREMAN-CRAFT
371600        MOVE FIREMAN-MSTR-CC    TO WS-HOLD-MSTR-CC
371700     END-IF
371800     IF CONDUCTOR-CRAFT
371900        MOVE CONDUCTOR-MSTR-CC  TO WS-HOLD-MSTR-CC
372000     END-IF
372100     IF BRAKEMAN-CRAFT
372200        MOVE BRAKEMAN-MSTR-CC   TO WS-HOLD-MSTR-CC
372300     END-IF
372400     IF FOREMAN-CRAFT
372500        MOVE FOREMAN-MSTR-CC    TO WS-HOLD-MSTR-CC
372600     END-IF
372700     IF SWITCHMAN-CRAFT
372800        MOVE SWITCHMAN-MSTR-CC  TO WS-HOLD-MSTR-CC
372900     END-IF
373000     IF YARDMASTER-CRAFT
373100        MOVE YARDMASTER-MSTR-CC TO WS-HOLD-MSTR-CC
373200     END-IF
373300     IF HOSTLER-CRAFT
373400        MOVE HOSTLER-MSTR-CC    TO WS-HOLD-MSTR-CC
373500     END-IF
373600     IF CLERICAL-CRAFT
373700        MOVE CLERICAL-MSTR-CC   TO WS-HOLD-MSTR-CC
373800     END-IF
373900     .
374000*7/20/16 - BEG
374100*================================================================*
374200 P6060-REREAD-EXTND-RUN-NO.
374300*================================================================*
374400     PERFORM VARYING SUB1 FROM 1 BY 1
374500        UNTIL SUB1 > 36
374600        IF JOB-TYPE-FOUND                          AND
374700           WK-TKCR-A2-SERVICE(SUB1)         = 'RS' AND
374800           WK-TKCR-A2-CC-WORKED(SUB1) = WS-HOLD-ON-DUTY-CC AND
374900           WK-TKCR-A2-EXT-RUN(SUB1) NOT = 'Y'
375000           MOVE WK-TKCR-A2-MIN-REST(SUB1) TO WK-MIN-REST1
375100           MOVE WK-TKCR-A2-MAX-REST(SUB1) TO WK-MAX-REST1
375200           MOVE 36                              TO SUB1
375300           SET CC-WORKED-FOUND                  TO TRUE
375400        END-IF
375500        IF JOB-TYPE-FOUND                          AND
375600           WK-TKCR-A2-SERVICE(SUB1)         = 'RS' AND
375700           WK-TKCR-A2-CC-WORKED(SUB1) = '**'       AND
375800           WK-TKCR-A2-EXT-RUN(SUB1) NOT = 'Y'
375900           MOVE WK-TKCR-A2-MIN-REST(SUB1) TO WK-MIN-REST2
376000           MOVE WK-TKCR-A2-MAX-REST(SUB1) TO WK-MAX-REST2
376100           SET CC-WORKED-FOUND                  TO TRUE
376200        END-IF
376300        IF WK-TKCR-A2-SERVICE(SUB1) = P925-TIE-UP-SERVICE
376400           AND WK-TKCR-A2-CC-WORKED(SUB1)
376500                                    = WS-HOLD-ON-DUTY-CC
376600           AND WK-TKCR-A2-EXT-RUN(SUB1) NOT = 'Y'
376700           MOVE WK-TKCR-A2-MIN-REST(SUB1) TO WK-MIN-REST3
376800           MOVE WK-TKCR-A2-MAX-REST(SUB1) TO WK-MAX-REST3
376900           SET CC-WORKED-FOUND                  TO TRUE
377000        END-IF
377100        IF WK-TKCR-A2-SERVICE(SUB1) = P925-TIE-UP-SERVICE
377200           AND WK-TKCR-A2-CC-WORKED(SUB1) = '**'
377300           AND WK-TKCR-A2-EXT-RUN(SUB1) NOT = 'Y'
377400           MOVE WK-TKCR-A2-MIN-REST(SUB1) TO WK-MIN-REST4
377500           MOVE WK-TKCR-A2-MAX-REST(SUB1) TO WK-MAX-REST4
377600           SET CC-WORKED-FOUND                  TO TRUE
377700        END-IF
377800        IF WK-TKCR-A2-SERVICE(SUB1) = '**'
377900           AND WK-TKCR-A2-CC-WORKED(SUB1)
378000                                    = WS-HOLD-ON-DUTY-CC
378100           AND WK-TKCR-A2-EXT-RUN(SUB1) NOT = 'Y'
378200           MOVE WK-TKCR-A2-MIN-REST(SUB1) TO WK-MIN-REST5
378300           MOVE WK-TKCR-A2-MAX-REST(SUB1) TO WK-MAX-REST5
378400           SET CC-WORKED-FOUND                  TO TRUE
378500        END-IF
378600        IF WK-TKCR-A2-SERVICE(SUB1) = '**'
378700           AND WK-TKCR-A2-CC-WORKED(SUB1) = '**'
378800           AND WK-TKCR-A2-EXT-RUN(SUB1) NOT = 'Y'
378900           MOVE WK-TKCR-A2-MIN-REST(SUB1) TO WK-MIN-REST6
379000           MOVE WK-TKCR-A2-MAX-REST(SUB1) TO WK-MAX-REST6
379100           SET CC-WORKED-FOUND                  TO TRUE
379200        END-IF
379300        IF WK-TKCR-A2-SERVICE(SUB1)             <= SPACES
379400           MOVE 36                              TO SUB1
379500        END-IF
379600     END-PERFORM
379700     .
379800*7/20/16 - END
379900*================================================================*
380000 P6100-CALC-REST-STATUS.
380100*================================================================*
380200     MOVE SPACES                  TO P925-REST-STATUS-FLAG
380300                                     P925-FROZEN-DATE-TIME
396200*CNLD-287-B COMMENTING
380400*                                    WS-RED-STATUS-FLAG
380500*                                    WS-YELLOW-STATUS-FLAG
380600*                                    WS-GREEN-STATUS-FLAG
396200*CNLD-287-E
380700                                     ASGN-TO-WRKTRN-POOL-FLAG
380800                                     WORK-SAVE-POOL
380900     MOVE ZEROS                   TO P925-REST-STATUS-TTA
381000                                     P925-REST-STATUS-ERT
521100*CNLD-274-B RJA
381000                                     WS-EST-LAYOVER-TIME
521100*CNLD-274-E RJA
381100                                     P925-REST-STATUS-TTW
381200                                     P925-REST-STATUS-TTR
381300                                     P925-REST-STATUS-TWT
381400*
381500*    CALCULATE THE FROZEN START/END TIMES
381600*
381700     MOVE SPACES                  TO WS-FROZEN-AREA
381800     MOVE SPACES                  TO CNTLKEY-AREA
381900     MOVE '01'                    TO CNTL-REC-TYPE
382000     MOVE DIST IN WS-MSTR         TO CNTL-DIST
382100     PERFORM P8030-READ-CNTL-FILE
382200     IF NOT SUCCESS
382300        MOVE 'P6100-1'            TO ERR-PARAGRAPH
382400        MOVE CNTLKEY              TO ERR-KEY
382500        PERFORM P9999-GOT-PROBLEM
382600     END-IF
382700     IF (P925-TIE-UP-YARD
382800        AND RUN-BY-PAY-YD-APPLICABLE)
382900        OR
383000        (P925-TIE-UP-ROAD
383100        AND RUN-BY-PAY-RD-APPLICABLE)
383200        IF LAST-TIE-UP-TIME > '0000000000'
383300           SET DE-YYMMDD-FORMAT      TO TRUE
383400           MOVE TUT-DATE             TO DE-YYMMDD
383500           PERFORM P8998-DATEEDIT
383600           MOVE DE-CCYYMMDD          TO WS-FROZEN-START-DATE
383700           MOVE TUT-TIME-OF-DAY      TO WS-FROZEN-START-TIME
383800           MOVE ZEROS                TO DATE-CONVERSION-PARMS
383900           SET PARM-ADD              TO TRUE
384000           MOVE TUT-DATE             TO PARM-PRI-DATE-GREG
384100           MOVE TUT-TIME-OF-DAY      TO PARM-PRI-HRMN
384200           MOVE '0800'               TO PARM-SEC-HRMN
384300           EXEC CICS LINK
384400                     PROGRAM(P903-PGM)
384500                     COMMAREA(DATE-CONVERSION-PARMS)
384600                     LENGTH(P903-LGTH)
384700                     RESP(WS-RESPONSE)
384800           END-EXEC
384900           MOVE WS-RESPONSE          TO FILE-STATUS
385000           IF NOT SUCCESS
385100              MOVE 'P6100-2'         TO ERR-PARAGRAPH
385200              MOVE 'P903LINK'        TO ERR-KEY
385300              PERFORM P9999-GOT-PROBLEM
385400           END-IF
385500           STRING PARM-RES-GREG-CENT
385600                  PARM-RES-DATE-GREG
385700                  DELIMITED BY SIZE
385800                  INTO WS-FROZEN-END-DATE
385900           MOVE PARM-RES-HRMN        TO WS-FROZEN-END-TIME
386000        END-IF
386100     END-IF
386200     MOVE ZERO                       TO HSVC-FOUND-CODE
386300     MOVE SPACE                      TO WS-ADD-ARB
386400     PERFORM P8100-GET-HSVC-CNTL-REC
386500     IF SUCCESS
386600        PERFORM P8120-GET-SERVICE-DATA
386700     END-IF
386800
386900     IF HSVC-FOUND
387000        MOVE SUB1                    TO HSUB
387100     ELSE
387200        MOVE 1                       TO HSUB
387300        SET P925-EMP-STATUS-UNKNOWN  TO TRUE
387400     END-IF
387500     IF P925-AJ-ERT > SPACES
387600        MOVE P925-AJ-ERT             TO P925-REST-STATUS-ERT
387700     ELSE
387800*CNC0544-BEG
387900        IF P925-ALT-CREW-SRC-USED
388000*C1207 - BEG
388100        AND P925-ALT-CREW-EST-RUN-TM > SPACES
388200*C1207 - END
388300           MOVE P925-ALT-CREW-EST-RUN-TM
388400                                     TO P925-REST-STATUS-ERT
388500        ELSE
388600*CNC0544-END
388700           PERFORM P6121-GET-RUN-MILE-CNTL
388800           MOVE TKCR-36-EST-RUN-TIME TO P925-REST-STATUS-ERT
388900        END-IF
389000     END-IF
389100*
389200*    ADJUST THE ERT BY INCLUDING ANY PREP AND FINAL TIME THAT
389300*    COUNTS TOWARDS THE EMPLOYEE'S HOURS OF SERVICE (BASED ON
389400*    THE ADD-ARB FLAG ON THE HOS CONTROL RECORD)
389500*
389600     SET WS-ADJUST-ERT            TO TRUE
389700     PERFORM P6400-CALC-ACTUAL-TIME
389800
389900     MOVE P925-OD-DATE            TO DE-YYMMDD
390000     SET DE-YYMMDD-FORMAT         TO TRUE
390100     SET DE-REFORMAT-ONLY         TO TRUE
390200     MOVE SPACE                   TO DE-STATUS-FLAG
390300     PERFORM P8998-DATEEDIT
390400     MOVE DE-CCYYMMDD             TO WS-OD-CENT-DATE
390500     MOVE P925-OD-TIME            TO WS-OD-TIME
390600     IF WS-OD-CENT-DATE-TIME >= WS-FROZEN-END
390700        MOVE SPACES               TO WS-FROZEN-AREA
390800     END-IF
390900*
391000*    DEFAULT THE EMP TO YELLOW STATUS.  HE WILL BE CHANGED TO
391100*    GREEN IF WE DETERMINE HE IS FULLY RESTED IN P6120.
391200*
396200*CNLD-287-B COMMENTING
391300*    SET WS-YELLOW-STATUS         TO TRUE
396200*CNLD-287-E
391400     MOVE 'N/A'                   TO P925-REST-STATUS-TTW
391500                                     P925-REST-STATUS-TTR
391600     IF P925-EMP-STATUS-UNKNOWN
391700        MOVE '????'               TO P925-REST-STATUS-TTA
391800     ELSE
391900        MOVE CNTL-A1-MAX-TOUR(HSUB)
392000                                  TO P925-REST-STATUS-TTA
392100     END-IF
392200*
392300*    IF FOR SOME REASON THEY HAVE SETUP THE ESTIMATED
392400*    RUN TIME(ERT) TO EXCEED THE MAXIMUM ALLOWED FOR
392500*    ANY GIVEN TOUR EVEN THOUGH THE EMPLOYEE IS FULLY
392600*    RESTED ACCORDING TO TIME, SET THEIR STATUS YELLOW.
392700*    THEORETICALLY THIS SHOULD NOT HAPPEN.
392800*
392900     IF P925-REST-STATUS-ERT > P925-REST-STATUS-TTA
393000*CNC0600-B
393100     AND NOT WS-CAN-WRR-NEW
393200*CNC0600-E
393300        SET P925-EMP-STATUS-YELLOW      TO TRUE
393400     END-IF
393500*CNC0600 RJA B
393600     IF WS-CAN-WRR-NEW
393700              PERFORM P6125-CAN-WRR-REST-CHECK
394000
396200*CNLD-287-B 02/20/2024 COMMENTING THIS 'ELSE' CODE THAT'S NO
396200*           LONGER REQUIRED WITH NEW WRR
393800*    ELSE
393900*CNC0600 RJA E
394000*
394100**   NOW CHECK THE OTHER COMPONENTS OF THE REST CALCULATION.
394200**   COUNT TOTAL TIME WORKING IN THE LAST 24 HOURS(TTW)
394300**   COUNT UNINTERRUPTED REST SINCE LAST OFF DUTY(UIR)
394400**   COMPUTE TOTAL TIME AVAILABLE TO WORK(TTA)
394500**   - P6110 MAY 'VIRTUALLY' SET THE EMPLOYEE TO RED OR YELLOW,
394600**   BASED ON THE EDITS IT DOES.  AT THE END, IT WILL DETERMINE
394700**   IF THE EMPLOYEE IS RESTED, BASED ON THE UNINTERRUPTED REST
394800**   RULES.  IF THE EMPLOYEE IS NOT RESTED, HE WILL BE PUT IN THE
394900**   HIGHEST COLOR (STATUS) HE WAS FLAGGED FOR DURING THE PREVIOUS
395000**   EDITS.  IF HE'S RESTED, HE'S LEFT IN GREEN STATUS.
395100*
395200*       PERFORM P6110-SEARCH-HIST-INFO
395300*       IF P925-EMP-STATUS-YELLOW
395400*          IF WS-FROZEN-ENTRY-FOUND
395500*             MOVE WS-FROZEN-END(3:10)  TO P925-FROZEN-DATE-TIME
395600*          END-IF
395700*       END-IF
394000*
396200*CNLD-287-E
395800*CNC0600 RJA B
395900     END-IF
396000*CNC0600 RJA E
396100
396200*CNLD-287-B COMMENTING
396200**   IF P925-CALC-TTW-ONLY STOP PROCESSING
396300*
396400*    IF P925-CALC-TTW-ONLY
396500*       PERFORM P9000-RETURN
396600*    END-IF
396200*CNLD-287-E
396700
397400     SET NOT-AT-HOME-TERM               TO TRUE
397500     MOVE SPACES                        TO WS-TRCN-FILE
397600     MOVE P925-TRCNKEY1                 TO TRCNKEY1
397700     EXEC CICS READ
397800               DATASET(TRAIN-CN-VIA-TRCNKEY1)
397900               INTO(WS-TRCN-FILE)
398000               LENGTH(TRAINCN-RLGTH)
398100               RIDFLD(TRCNKEY1)
398200               KEYLENGTH(TRAINCN-KLGTH)
398300               RESP(WS-RESPONSE)
398400     END-EXEC
398500     MOVE WS-RESPONSE                   TO FILE-STATUS
398600     IF NOT SUCCESS
398700        MOVE 'P6100-3'                  TO ERR-PARAGRAPH
398800        MOVE TRCNKEY1                   TO ERR-KEY
398900        PERFORM P9999-GOT-PROBLEM
399000     END-IF
399100*CNLD-230-B
399200     MOVE TRCN-ASGN-TYPE                TO WS-TRCN-ASGN-TYPE
399300     MOVE SPACES                        TO WS-OUTPOST-HOME-FL
399400*CNLD-230-E
399500     IF TRCN-ASSIGNED-REC
399600        SET AT-HOME-TERM                TO TRUE
399700     ELSE
399800        IF TRCN-POOL-REC
399900           IF P925-TERM = 'H'
400000*
400100*             THE ASSIGNMENT IS HOME - NOW SEE IF THE EMPLOYEE
400200*             IS ASSIGNED 'FURTHER NOTICE' TO IT.  IF SO, AND
400300*             THEY WERE ASSIGNED THROUGH A DEADHEAD, THEY ARE
400400*             ON AN OUTPOST ASSIGNMENT, AND ARE NOT AT HOME.
400500*
400600*** CNC0331E - READ POOL RECORD TO SEE IF WE HAVE A WORK TRAIN
400700***            IF WORK-TRAIN AND OWNER, SET FLAG
400800              IF WORK-SAVE-POOL         <= SPACE
400900                 PERFORM P6150-GET-POOL-CNTL
401000              ELSE
401100                 MOVE WORK-SAVE-POOL    TO WS-CNTL-FILE
401200              END-IF
401300              PERFORM P8200-GET-LATEST-TEMP-JOB
401400              IF ASGN-ASSIGNMENT > SPACES
401500                 IF ASGN-DH-F-NOTICE
401600                    PERFORM P6500-CHECK-FOR-DEADHEAD
401700                    IF NO-DEADHEAD-FOUND
401800                       SET AT-HOME-TERM TO TRUE
401900*CNLD-230-B
402000                    ELSE
402100                       SET WS-OUTPOST-HOME TO TRUE
402200*CNLD-230-E
402300                    END-IF
402400*CNLD-280-B
402500                 ELSE
402600* 10/2/2023         DECISION FILL PROCESS SHOULD NEVER 'FILL' AN
402700*                   EMP NOT AT-HOME ON AN ASSIGNMENT THAT'S HOME.
402800*                   QUOC AGREES THAT IF A CALLER DOES EVER 'HELP'
402900*                   AN EMP WHO'S NOT AT-HOME, THIS CHANGE WILL
403000*                   STILL CONSIDER THEM AT-HOME.
403100                    SET AT-HOME-TERM TO TRUE
403200*CNLD-280-E
403300                 END-IF
403400                 IF WORK-TRAIN-POOL AND
403500                    ASGN-UFP-JOB AND
403600                    ASGN-DIST       = CNTL-DIST      AND
403700                    ASGN-SUB-DIST   = CNTL-SUB-DIST  AND
403800                    ASGN-UFP-POOL   = CNTL-POOL-CODE AND
403900*** 331E - ADD CHECKS FOR HOS EXEMPT
404000                  ((P925-ASGN       > SPACES         AND
404100                    ASGN-AJ-JOB-NO  = P925-ASGN) OR
404200                    P925-ASGN       = SPACES)
404300                    SET ASGN-TO-WRKTRN-POOL TO TRUE
404400                 END-IF
404500              ELSE
404600                 SET AT-HOME-TERM    TO TRUE
404700                 IF WORK-TRAIN-POOL
404800                    PERFORM P8210-GET-OWNED-JOB
404900                    IF ASGN-UFP-JOB AND
405000                       ASGN-DIST       = CNTL-DIST      AND
405100                       ASGN-SUB-DIST   = CNTL-SUB-DIST  AND
405200                       ASGN-UFP-POOL   = CNTL-POOL-CODE AND
405300*** 331E - ADD CHECKS FOR HOS EXEMPT
405400                     ((P925-ASGN       > SPACES         AND
405500                       ASGN-AJ-JOB-NO  = P925-ASGN) OR
405600                       P925-ASGN       = SPACES)
405700                       SET ASGN-TO-WRKTRN-POOL TO TRUE
405800                    END-IF
405900                 END-IF
406000              END-IF
406100           END-IF
406200        ELSE
406300           IF TRCN-DEP-STN = EMP-HOME-TERM-CODE
406400              SET AT-HOME-TERM          TO TRUE
406500           END-IF
406600        END-IF
406700     END-IF
406800*CNC0600-B
406900     IF WS-CAN-WRR-NEW
407000        AND TRCN-FNL-STN = EMP-HOME-TERM-CODE
407100           SET WS-TIEUP-HOME            TO TRUE
407200     END-IF
407300*CNC0600-E
407400*#C853
407500     SET DONT-CHECK-HOS-RULE            TO TRUE
407600     IF AT-HOME-TERM
407700*CNC0600-B
407800        OR WS-CAN-WRR-NEW
407900*CNC0600-E
408000        MOVE P925-ASGN-CC               TO WS-CRAFT-CODE-CHECK
408100        IF ENGINE-CRAFT
408200           IF WS-US-DOM-YES
408300              IF TRCN-EN-REST-REQ = 'B'
408400                 SET CHECK-HOS-RULE     TO TRUE
408500              END-IF
408600           ELSE
408700              IF TRCN-EN-REST-REQ = 'C' OR 'B'
408800                 SET CHECK-HOS-RULE     TO TRUE
408900              END-IF
409000           END-IF
409100        ELSE
409200           IF WS-US-DOM-YES
409300              IF TRCN-TR-REST-REQ = 'B'
409400                 SET CHECK-HOS-RULE     TO TRUE
409500              END-IF
409600           ELSE
409700              IF TRCN-TR-REST-REQ = 'C' OR 'B'
409800                 SET CHECK-HOS-RULE     TO TRUE
409900              END-IF
410000           END-IF
410100        END-IF
410200     END-IF
410300
410500*CNC0600-B
410600*    IF  AT-HOME-TERM
410700     IF  (AT-HOME-TERM OR WS-CAN-WRR-NEW)
410800*CNC0600-E
410900     AND NOT P925-INCLUDE-VIRTUALS
411000*CNLD-230-B
411100*    AND NOT ASGN-TO-WRKTRN-POOL
411200     AND (((NOT WS-CAN-WRR-NEW) AND (NOT ASGN-TO-WRKTRN-POOL))
411300             OR WS-CAN-WRR-NEW)
411400*CNLD-230-E
411500     AND CHECK-HOS-RULE
411600*CNC0600-B
411700        IF WS-CAN-WRR-NEW
411800           MOVE SPACES                  TO P925-LOCAL-TM-REST-COND
411900           PERFORM P6180-7DAY-RESET-BRK-EDITS
412000        END-IF
412100*CNC0600-E
412200        MOVE ZEROS                      TO DATE-CONVERSION-PARMS
412300        SET PARM-ADD                    TO TRUE
412400        MOVE P925-OD-DATE               TO PARM-PRI-DATE-GREG
412500        MOVE P925-OD-TIME               TO PARM-PRI-HRMN
412600        MOVE P925-REST-STATUS-ERT       TO PARM-SEC-HRMN
412700        EXEC CICS LINK
412800                  PROGRAM(P903-PGM)
412900                  COMMAREA(DATE-CONVERSION-PARMS)
413000                  LENGTH(P903-LGTH)
413100                  RESP(WS-RESPONSE)
413200        END-EXEC
413300        MOVE WS-RESPONSE                TO FILE-STATUS
413400        IF NOT SUCCESS
413500           MOVE 'P6100-6'               TO ERR-PARAGRAPH
413600           MOVE 'P903LINK'              TO ERR-KEY
413700           PERFORM P9999-GOT-PROBLEM
413800        END-IF
413900
414000        INITIALIZE PS08-COMMAREA-PARMS
414100        SET PS08-INQUIRY-FUN            TO TRUE
414200        MOVE P925-EMP-NO                TO PS08-EMP-NBR
414300*CNC0600-B
414400        IF WS-CAN-WRR-NEW
414500           MOVE 07                      TO PS08-CALC-NBR-DAYS
414600           SET DE-YYMMDD-FORMAT         TO TRUE
414700           MOVE P925-OD-DATE            TO DE-YYMMDD
414800           PERFORM P8998-DATEEDIT
414900           MOVE DE-CCYYMMDD             TO PS08-OD-DATE-CENT
415000                                           PS08-CALC-DATE-CENT
415100           MOVE P925-OD-TIME            TO PS08-OD-TIME
415200                                           PS08-CALC-TIME
415300        ELSE
415400*CNC0600-E
415500           MOVE PARM-RES-GREG-CENT      TO PS08-CALC-CE
415600           MOVE PARM-RES-DATE-GREG      TO PS08-CALC-DATE
415700           MOVE PARM-RES-HRMN           TO PS08-CALC-TIME
415800           MOVE 07                      TO PS08-CALC-NBR-DAYS
415900           SET DE-YYMMDD-FORMAT         TO TRUE
416000           MOVE P925-OD-DATE            TO DE-YYMMDD
416100           PERFORM P8998-DATEEDIT
416200           MOVE DE-CCYYMMDD             TO PS08-OD-DATE-CENT
416300           MOVE P925-OD-TIME            TO PS08-OD-TIME
416400*CNC0600-B
416500        END-IF
416600*CNC0600-E
416700
416800        EXEC CICS LINK
416900                  PROGRAM(PS08-PGM)
417000                  COMMAREA(PS08-COMMAREA-PARMS)
417100                  LENGTH(PS08-LGTH)
417200                  RESP(WS-RESPONSE)
417300        END-EXEC
417400        MOVE WS-RESPONSE                TO FILE-STATUS
417500        IF NOT SUCCESS
417600           MOVE 'P6100-7'               TO ERR-PARAGRAPH
417700           MOVE 'PS08LINK'              TO ERR-KEY
417800           PERFORM P9999-GOT-PROBLEM
417900        END-IF
418000        IF NOT PS08-NO-ERRORS
418100           MOVE 'P6100-8'               TO ERR-PARAGRAPH
418200           MOVE PS08-RETURN-ERRORS      TO ERR-KEY
418300           MOVE 'CHECK S08 INPUT PARAMETERS'
418400                                        TO ERR-SENTENCE
418500           PERFORM P9999-GOT-PROBLEM
418600        ELSE
418700           MOVE PS08-TOTAL-TIME-ON-DUTY(4:4)
418800                                        TO P925-REST-STATUS-TWT
396200*CNLD-287-B 02/20/2024 64/7 CHECK IS NO LONGER REQUIRED WITH
396200*          NEW WRR
418900*
418900*** 331E - MTOD STARTS AT 6401, NOT AT 6400
419000*          IF PS08-TOTAL-TIME-ON-DUTY > 6400
419100**CNC0600-B
419200*             AND NOT WS-CAN-WRR-NEW
419300**CNC0600-E
419400*             SET P925-EMP-STATUS-RED   TO TRUE
419500*          END-IF
396200*CNLD-287-E
396200
419600*CNC0600-B
419700*CNLD-230-B CNC0600
419800*          IF WS-CAN-WRR-NEW AND AT-HOME-TERM
419900           IF WS-CAN-WRR-NEW AND (AT-HOME-TERM OR WS-OUTPOST-HOME)
420000
420100*
420200*          WHEN WS-CAN-WRR-NEW IS TRUE:
420300*
420400*      =>  REST STATUSES IN THE ORDER OF MOST-RESTED TO LEAST ARE:
420500*           P925-EMP-STATUS-GREEN                        >
420600*           P925-EMP-STATUS-YELLOW                       >
420700*          (P925-EMP-STATUS-RED AND P925-OVERRIDE-ALLOW) >
420800*          (P925-EMP-STATUS-RED AND P925-OVERRIDE-DENY)
420900*
421000*      =>  WE SWITCH FROM A MORE-RESTED STATUS TO LESS,
421100*          BUT NOT VICE VERSA.
421200*
421300*      =>  WE SAVE THE REASON WHEN P925-EMP-STATUS-RED IS SET FOR
421400*          THE FIRST TIME, AND DO NOT OVERRIDE IT UNLESS WE ARE
421500*          SWITCHING FROM (P925-EMP-STATUS-RED AND P925-OVERRIDE-A
421600*          LLOW) TO (P925-EMP-STATUS-RED AND P925-OVERRIDE-DENY)
421700*
421800*CNLD-230-E
421900
422000*CNLD-230-B CNC0600
422100*             AND NOT P925-EMP-STATUS-RED
422200*CNLD-230-E
422300              IF PS08-TOTAL-TIME-ON-DUTY >= 5400
422400*CNLD-230-B CNC0600
422500              AND NOT (P925-EMP-STATUS-RED AND P925-OVERRIDE-DENY)
422600*CNLD-230-E
422700
422800* 19Q QUOC'S EMAIL 05/14/23; THIS EDIT IS NOT APPLICABLE FOR YARD
422900              AND NOT (EIBTRNID = P08S-TRAN)
423000              AND NOT WS-TRCN-YARD-REC
423100*
423200                 SET P925-EMP-STATUS-RED TO TRUE
423300                 SET P925-OVERRIDE-DENY TO TRUE
423400*CNLD-230-B CNC0600
423500*CNLD-257-DXC-B
423600*                SET P925-RFR-60-192-HRS TO TRUE
423700                 SET P925-RFR-60-HRS     TO TRUE
423800*CNLD-257-DXC-E
423900*CNLD-230-E
424000              END-IF
424100*
424200              MOVE ZEROES               TO TEMP-CALC-MNS
424300                                           TEMP-TIME1
424400              MOVE P925-REST-STATUS-ERT TO TEMP-TIME1-4
424500              MOVE TEMP-TIME1-MN        TO TEMP-CALC-MNS
424600              ADD PS08-TOTAL-HRS-ON-DUTY TO TEMP-TIME1-HR
424700              ADD PS08-TOTAL-MNS-ON-DUTY TO TEMP-CALC-MNS
424800              IF TEMP-CALC-MNS          > 59
424900                 ADD 1                  TO TEMP-TIME1-HR
425000                 SUBTRACT 60            FROM TEMP-CALC-MNS
425100              END-IF
425200              MOVE TEMP-CALC-MNS(2:2)   TO TEMP-TIME1-MN
425300              MOVE TEMP-TIME1           TO WS-TTOD-ERT
425400
425500              IF WS-TTOD-ERT > 6000
425600                 AND NOT P925-EMP-STATUS-RED
425700                 SET P925-EMP-STATUS-YELLOW
425800                                        TO TRUE
425900              END-IF
426000*CNLD-230-B CNC0600
426100              IF NOT  P925-EMP-STATUS-RED
426200                 MOVE ZEROS               TO DATE-CONVERSION-PARMS
426300                 SET PARM-ADD             TO TRUE
426400                 MOVE P925-OD-DATE        TO PARM-PRI-DATE-GREG
426500                 MOVE P925-OD-TIME        TO PARM-PRI-HRMN
426600                 MOVE P925-REST-STATUS-ERT TO PARM-SEC-HRMN
426700                 EXEC CICS LINK
426800                           PROGRAM(P903-PGM)
426900                           COMMAREA(DATE-CONVERSION-PARMS)
427000                           LENGTH(P903-LGTH)
427100                           RESP(WS-RESPONSE)
427200                 END-EXEC
427300                 MOVE WS-RESPONSE         TO FILE-STATUS
427400                 IF NOT SUCCESS
427500                    MOVE 'P6100-10'       TO ERR-PARAGRAPH
427600                    MOVE 'P903LINK'       TO ERR-KEY
427700                    PERFORM P9999-GOT-PROBLEM
427800                 END-IF
427900
428000                 INITIALIZE PS08-COMMAREA-PARMS
428100                 MOVE 7                      TO PS08-CALC-NBR-DAYS
428200                 MOVE PARM-RES-GREG-CENT     TO PS08-CALC-CE
428300                 MOVE PARM-RES-DATE-GREG     TO PS08-CALC-DATE
428400                 MOVE PARM-RES-HRMN          TO PS08-CALC-TIME
428500                 SET DE-YYMMDD-FORMAT        TO TRUE
428600                 MOVE P925-OD-DATE           TO DE-YYMMDD
428700                 PERFORM P8998-DATEEDIT
428800                 MOVE DE-CCYYMMDD            TO PS08-OD-DATE-CENT
428900                 MOVE P925-OD-TIME           TO PS08-OD-TIME
429000                 PERFORM P6170-GET-TTOD
429100
429200                 MOVE ZEROES               TO TEMP-CALC-MNS
429300                                              TEMP-TIME1
429400                 MOVE P925-REST-STATUS-ERT TO TEMP-TIME1-4
429500                 MOVE TEMP-TIME1-MN        TO TEMP-CALC-MNS
429600                 ADD PS08-TOTAL-HRS-ON-DUTY TO TEMP-TIME1-HR
429700                 ADD PS08-TOTAL-MNS-ON-DUTY TO TEMP-CALC-MNS
429800                 IF TEMP-CALC-MNS          > 59
429900                    ADD 1                  TO TEMP-TIME1-HR
430000                    SUBTRACT 60            FROM TEMP-CALC-MNS
430100                 END-IF
430200                 MOVE TEMP-CALC-MNS(2:2)   TO TEMP-TIME1-MN
430300                 MOVE TEMP-TIME1           TO WS-TTOD-ERT
430400
430500                 IF WS-TTOD-ERT > 6000
430600*CNLD-257-DXC-B
430700*                   SET P925-RFR-60-192-ERT
430800                    SET P925-RFR-60-ERT
430900*CNLD-257-DXC-E
431000                                        TO TRUE
431100                    SET P925-OVERRIDE-ALLOW
431200                                        TO TRUE
431300                    SET P925-EMP-STATUS-RED
431400                                        TO TRUE
431500                    MOVE P925-REST-STATUS-ERT
431600                                        TO P925-RFR-MSG
431700                 END-IF
431800              END-IF
431900*CNLD-230-E
432000*
432100*CHECK FOR 28 DAYS TTOD
432200*
432300*CNLD-230-B CNC0600
432400*             IF NOT P925-EMP-STATUS-RED
432500*                PERFORM P6170-GET-28D-TOTAL-OD
432600              IF NOT (P925-EMP-STATUS-RED AND P925-OVERRIDE-DENY)
432700                 INITIALIZE PS08-COMMAREA-PARMS
432800                 MOVE 28                   TO PS08-CALC-NBR-DAYS
432900                 SET DE-YYMMDD-FORMAT      TO TRUE
433000                 MOVE P925-OD-DATE         TO DE-YYMMDD
433100                 PERFORM P8998-DATEEDIT
433200                 MOVE DE-CCYYMMDD          TO PS08-OD-DATE-CENT
433300                                              PS08-CALC-DATE-CENT
433400                 MOVE P925-OD-TIME         TO PS08-OD-TIME
433500                                              PS08-CALC-TIME
433600                 PERFORM P6170-GET-TTOD
433700*CNLD-230-E
433800                 IF PS08-TOTAL-TIME-ON-DUTY >= 18600
433900* 19Q QUOC'S EMAIL 05/14/23; THIS EDIT IS NOT APPLICABLE FOR YARD
434000                 AND NOT (EIBTRNID = P08S-TRAN)
434100                 AND NOT WS-TRCN-YARD-REC
434200*
434300                    SET P925-EMP-STATUS-RED TO TRUE
434400                    SET P925-OVERRIDE-DENY TO TRUE
434500*CNLD-230-B CNC0600
434600*CNLD-257-DXC-B
434700*                   SET P925-RFR-60-192-HRS TO TRUE
434800                    SET P925-RFR-192-HRS    TO TRUE
434900*CNLD-257-DXC-E
435000*CNLD-230-E
435100                 END-IF
435200                 MOVE ZEROES               TO TEMP-CALC-MNS
435300                                              TEMP-TIME1
435400                 MOVE P925-REST-STATUS-ERT TO TEMP-TIME1-4
435500                 MOVE TEMP-TIME1-MN        TO TEMP-CALC-MNS
435600                 ADD PS08-TOTAL-HRS-ON-DUTY TO TEMP-TIME1-HR
435700                 ADD PS08-TOTAL-MNS-ON-DUTY TO TEMP-CALC-MNS
435800                 IF TEMP-CALC-MNS          > 59
435900                    ADD 1                  TO TEMP-TIME1-HR
436000                    SUBTRACT 60            FROM TEMP-CALC-MNS
436100                 END-IF
436200                 MOVE TEMP-CALC-MNS(2:2)   TO TEMP-TIME1-MN
436300                 MOVE TEMP-TIME1           TO WS-TTOD-ERT
436400
436500                 IF WS-TTOD-ERT > 19200
436600                 AND NOT P925-EMP-STATUS-RED
436700                    SET P925-EMP-STATUS-YELLOW
436800                                        TO TRUE
436900                 END-IF
437000              END-IF
437100*CNLD-230-B CNC0600
437200              IF NOT  P925-EMP-STATUS-RED
437300                 MOVE ZEROS               TO DATE-CONVERSION-PARMS
437400                 SET PARM-ADD             TO TRUE
437500                 MOVE P925-OD-DATE        TO PARM-PRI-DATE-GREG
437600                 MOVE P925-OD-TIME        TO PARM-PRI-HRMN
437700                 MOVE P925-REST-STATUS-ERT TO PARM-SEC-HRMN
437800                 EXEC CICS LINK
437900                           PROGRAM(P903-PGM)
438000                           COMMAREA(DATE-CONVERSION-PARMS)
438100                           LENGTH(P903-LGTH)
438200                           RESP(WS-RESPONSE)
438300                 END-EXEC
438400                 MOVE WS-RESPONSE         TO FILE-STATUS
438500                 IF NOT SUCCESS
438600                    MOVE 'P6100-9'        TO ERR-PARAGRAPH
438700                    MOVE 'P903LINK'       TO ERR-KEY
438800                    PERFORM P9999-GOT-PROBLEM
438900                 END-IF
439000
439100                 INITIALIZE PS08-COMMAREA-PARMS
439200                 MOVE 28                     TO PS08-CALC-NBR-DAYS
439300                 MOVE PARM-RES-GREG-CENT     TO PS08-CALC-CE
439400                 MOVE PARM-RES-DATE-GREG     TO PS08-CALC-DATE
439500                 MOVE PARM-RES-HRMN          TO PS08-CALC-TIME
439600                 SET DE-YYMMDD-FORMAT        TO TRUE
439700                 MOVE P925-OD-DATE           TO DE-YYMMDD
439800                 PERFORM P8998-DATEEDIT
439900                 MOVE DE-CCYYMMDD            TO PS08-OD-DATE-CENT
440000                 MOVE P925-OD-TIME           TO PS08-OD-TIME
440100                 PERFORM P6170-GET-TTOD
440200
440300                 MOVE ZEROES               TO TEMP-CALC-MNS
440400                                              TEMP-TIME1
440500                 MOVE P925-REST-STATUS-ERT TO TEMP-TIME1-4
440600                 MOVE TEMP-TIME1-MN        TO TEMP-CALC-MNS
440700                 ADD PS08-TOTAL-HRS-ON-DUTY TO TEMP-TIME1-HR
440800                 ADD PS08-TOTAL-MNS-ON-DUTY TO TEMP-CALC-MNS
440900                 IF TEMP-CALC-MNS          > 59
441000                    ADD 1                  TO TEMP-TIME1-HR
441100                    SUBTRACT 60            FROM TEMP-CALC-MNS
441200                 END-IF
441300                 MOVE TEMP-CALC-MNS(2:2)   TO TEMP-TIME1-MN
441400                 MOVE TEMP-TIME1           TO WS-TTOD-ERT
441500
441600                 IF WS-TTOD-ERT > 19200
441700*CNLD-257-DXC-B
441800*                   SET P925-RFR-60-192-ERT
441900                    SET P925-RFR-192-ERT
442000*CNLD-257-DXC-E
442100                                        TO TRUE
442200                    SET P925-OVERRIDE-ALLOW
442300                                        TO TRUE
442400                    SET P925-EMP-STATUS-RED
442500                                        TO TRUE
442600                    MOVE P925-REST-STATUS-ERT
442700                                        TO P925-RFR-MSG
442800                 END-IF
442900              END-IF
443000*CNLD-230-E
443100           ELSE
443200* 10/2/2023 B
443300*
443400* NOT-AT-HOME-TERM MAY BE TRUE IF AT OUTPOST.
443500* 10/2/2023 MODIFIED NOT-AT-HOME-TERM CONDITION ABOVE
443600* 10/2/2023      TO 'NOT (AT-HOME-TERM OR WS-OUTPOST-HOME)';
443700* 10/2/2023 THIS CHANGE IS JUST FOR READABILITY, DOESN'T CHANGE
443800* 10/2/2023 LOGIC AS THE 'IF' CONDITION OF THIS 'ELSE' IS :
443900* 10/2/2023 IF WS-CAN-WRR-NEW & (AT-HOME-TERM OR WS-OUTPOST-HOME)
444000*
444100*             IF WS-CAN-WRR-NEW AND NOT-AT-HOME-TERM
444200              IF WS-CAN-WRR-NEW
444300              AND NOT (AT-HOME-TERM OR WS-OUTPOST-HOME)
444400* 10/2/2023 E
444500              AND NOT P925-EMP-STATUS-RED
444600                 IF PS08-TOTAL-TIME-ON-DUTY >= 5400
444700*
444800* 19Q QUOC'S EMAIL 05/14/23; THIS EDIT IS NOT APPLICABLE FOR YARD.
444900                 AND NOT (EIBTRNID = P08S-TRAN)
445000                 AND NOT WS-TRCN-YARD-REC
445100*
445200                    SET P925-EMP-STATUS-RED TO TRUE
445300                    SET P925-OVERRIDE-ALLOW TO TRUE
445400*CNLD-230-B CNC0600
445500*CNLD-257-DXC-B
445600*                   SET P925-RFR-60-192-HRS TO TRUE
445700                    SET P925-RFR-60-HRS     TO TRUE
445800*CNLD-257-DXC-E
445900*CNLD-230-E
446000                 END-IF
446100                 IF NOT P925-EMP-STATUS-RED
446200*CNLD-230-B CNC0600
446300*                   PERFORM P6170-GET-28D-TOTAL-OD
446400                    INITIALIZE PS08-COMMAREA-PARMS
446500                    MOVE 28                 TO PS08-CALC-NBR-DAYS
446600                    SET DE-YYMMDD-FORMAT    TO TRUE
446700                    MOVE P925-OD-DATE       TO DE-YYMMDD
446800                    PERFORM P8998-DATEEDIT
446900                    MOVE DE-CCYYMMDD        TO PS08-OD-DATE-CENT
447000                                               PS08-CALC-DATE-CENT
447100                    MOVE P925-OD-TIME       TO PS08-OD-TIME
447200                                               PS08-CALC-TIME
447300                    PERFORM P6170-GET-TTOD
447400*CNLD-230-E
447500                    IF PS08-TOTAL-TIME-ON-DUTY >= 18600
447600*
447700* 19Q QUOC'S EMAIL 05/14/23; THIS EDIT IS NOT APPLICABLE FOR YARD.
447800                    AND NOT (EIBTRNID = P08S-TRAN)
447900                    AND NOT WS-TRCN-YARD-REC
448000*
448100                       SET P925-EMP-STATUS-RED TO TRUE
448200                       SET P925-OVERRIDE-ALLOW TO TRUE
448300*CNLD-230-B CNC0600
448400*CNLD-257-DXC-B
448500*                      SET P925-RFR-60-192-HRS TO TRUE
448600                       SET P925-RFR-192-HRS    TO TRUE
448700*CNLD-257-DXC-E
448800*CNLD-230-E
448900                    END-IF
449000                 END-IF
449100*CNLD-230-B CNC0600
449200                 PERFORM P610A-CHECK-7-28-CLOCK-PROJ-TU
449300*CNLD-230-E
449400              END-IF
449500           END-IF
449600*CHECK IF EMP IS BEING PRESENTED DURING HIS UNDISTURBED PERIODS
449700           IF WS-CAN-WRR-NEW
449800              PERFORM P6185-CHECK-LOCAL-UNDISTURBED
449900           END-IF
450000*CNC0600-E
450100        END-IF
450200     END-IF
450300*CNC0524
450400     PERFORM P6160-CALC-TTA-DATE-TIME
450500     .
450600*
450700*CNLD-230-B CNC0600
450800*================================================================*
450900 P610A-CHECK-7-28-CLOCK-PROJ-TU.
451000*================================================================*
451100     IF NOT  P925-EMP-STATUS-RED
451200        MOVE ZEROS               TO DATE-CONVERSION-PARMS
451300        SET PARM-ADD             TO TRUE
451400        MOVE P925-OD-DATE        TO PARM-PRI-DATE-GREG
451500        MOVE P925-OD-TIME        TO PARM-PRI-HRMN
451600        MOVE P925-REST-STATUS-ERT TO PARM-SEC-HRMN
451700        EXEC CICS LINK
451800                  PROGRAM(P903-PGM)
451900                  COMMAREA(DATE-CONVERSION-PARMS)
452000                  LENGTH(P903-LGTH)
452100                  RESP(WS-RESPONSE)
452200        END-EXEC
452300        MOVE WS-RESPONSE         TO FILE-STATUS
452400        IF NOT SUCCESS
452500           MOVE 'P6100-10'       TO ERR-PARAGRAPH
452600           MOVE 'P903LINK'       TO ERR-KEY
452700           PERFORM P9999-GOT-PROBLEM
452800        END-IF
452900
453000        INITIALIZE PS08-COMMAREA-PARMS
453100        MOVE 7                      TO PS08-CALC-NBR-DAYS
453200        MOVE PARM-RES-GREG-CENT     TO PS08-CALC-CE
453300        MOVE PARM-RES-DATE-GREG     TO PS08-CALC-DATE
453400        MOVE PARM-RES-HRMN          TO PS08-CALC-TIME
453500        SET DE-YYMMDD-FORMAT        TO TRUE
453600        MOVE P925-OD-DATE           TO DE-YYMMDD
453700        PERFORM P8998-DATEEDIT
453800        MOVE DE-CCYYMMDD            TO PS08-OD-DATE-CENT
453900        MOVE P925-OD-TIME           TO PS08-OD-TIME
454000        PERFORM P6170-GET-TTOD
454100
454200        MOVE ZEROES               TO TEMP-CALC-MNS
454300                                     TEMP-TIME1
454400        MOVE P925-REST-STATUS-ERT TO TEMP-TIME1-4
454500        MOVE TEMP-TIME1-MN        TO TEMP-CALC-MNS
454600        ADD PS08-TOTAL-HRS-ON-DUTY TO TEMP-TIME1-HR
454700        ADD PS08-TOTAL-MNS-ON-DUTY TO TEMP-CALC-MNS
454800        IF TEMP-CALC-MNS          > 59
454900           ADD 1                  TO TEMP-TIME1-HR
455000           SUBTRACT 60            FROM TEMP-CALC-MNS
455100        END-IF
455200        MOVE TEMP-CALC-MNS(2:2)   TO TEMP-TIME1-MN
455300        MOVE TEMP-TIME1           TO WS-TTOD-ERT
455400
455500        IF WS-TTOD-ERT > 6000
455600*CNLD-257-DXC-B
455700*          SET P925-RFR-60-192-ERT
455800           SET P925-RFR-60-ERT
455900*CNLD-257-DXC-E
456000                               TO TRUE
456100           SET P925-OVERRIDE-ALLOW
456200                               TO TRUE
456300           SET P925-EMP-STATUS-RED
456400                               TO TRUE
456500           MOVE P925-REST-STATUS-ERT
456600                               TO P925-RFR-MSG
456700        END-IF
456800     END-IF
456900
457000     IF NOT  P925-EMP-STATUS-RED
457100        MOVE ZEROS               TO DATE-CONVERSION-PARMS
457200        SET PARM-ADD             TO TRUE
457300        MOVE P925-OD-DATE        TO PARM-PRI-DATE-GREG
457400        MOVE P925-OD-TIME        TO PARM-PRI-HRMN
457500        MOVE P925-REST-STATUS-ERT TO PARM-SEC-HRMN
457600        EXEC CICS LINK
457700                  PROGRAM(P903-PGM)
457800                  COMMAREA(DATE-CONVERSION-PARMS)
457900                  LENGTH(P903-LGTH)
458000                  RESP(WS-RESPONSE)
458100        END-EXEC
458200        MOVE WS-RESPONSE         TO FILE-STATUS
458300        IF NOT SUCCESS
458400           MOVE 'P610A-2'        TO ERR-PARAGRAPH
458500           MOVE 'P903LINK'       TO ERR-KEY
458600           PERFORM P9999-GOT-PROBLEM
458700        END-IF
458800
458900        INITIALIZE PS08-COMMAREA-PARMS
459000        MOVE 28                     TO PS08-CALC-NBR-DAYS
459100        MOVE PARM-RES-GREG-CENT     TO PS08-CALC-CE
459200        MOVE PARM-RES-DATE-GREG     TO PS08-CALC-DATE
459300        MOVE PARM-RES-HRMN          TO PS08-CALC-TIME
459400        SET DE-YYMMDD-FORMAT        TO TRUE
459500        MOVE P925-OD-DATE           TO DE-YYMMDD
459600        PERFORM P8998-DATEEDIT
459700        MOVE DE-CCYYMMDD            TO PS08-OD-DATE-CENT
459800        MOVE P925-OD-TIME           TO PS08-OD-TIME
459900        PERFORM P6170-GET-TTOD
460000
460100        MOVE ZEROES               TO TEMP-CALC-MNS
460200                                     TEMP-TIME1
460300        MOVE P925-REST-STATUS-ERT TO TEMP-TIME1-4
460400        MOVE TEMP-TIME1-MN        TO TEMP-CALC-MNS
460500        ADD PS08-TOTAL-HRS-ON-DUTY TO TEMP-TIME1-HR
460600        ADD PS08-TOTAL-MNS-ON-DUTY TO TEMP-CALC-MNS
460700        IF TEMP-CALC-MNS          > 59
460800           ADD 1                  TO TEMP-TIME1-HR
460900           SUBTRACT 60            FROM TEMP-CALC-MNS
461000        END-IF
461100        MOVE TEMP-CALC-MNS(2:2)   TO TEMP-TIME1-MN
461200        MOVE TEMP-TIME1           TO WS-TTOD-ERT
461300
461400        IF WS-TTOD-ERT > 19200
461500*CNLD-257-DXC-B
461600*          SET P925-RFR-60-192-ERT
461700           SET P925-RFR-192-ERT
461800*CNLD-257-DXC-E
461900                               TO TRUE
462000           SET P925-OVERRIDE-ALLOW
462100                               TO TRUE
462200           SET P925-EMP-STATUS-RED
462300                               TO TRUE
462400           MOVE P925-REST-STATUS-ERT
462500                               TO P925-RFR-MSG
462600        END-IF
462700     END-IF
462800     .
462900*CNLD-230-E
396200
396200*CNLD-287-B 02/20/2024 COMMENTING P6110 & P6120 WHICH ARE NO
396200*                      LONGER REQUIRED WITH NEW WRR.
463000*================================================================*
463100*P6110-SEARCH-HIST-INFO.
463200*================================================================*
463300**
463400**   CNC0331 - THIS PROCESS HAS NOW CHANGED TO GET THE TOD DATA
463500**             FROM THE EMPTOD FILE.
463600**
463700**   SUBTRACT 80 HOURS FROM THE ON DUTY TIME
463800**
463900*    MOVE ZEROS                   TO DATE-CONVERSION-PARMS
464000*    SET PARM-SUBTRACT            TO TRUE
464100*    MOVE P925-OD-DATE            TO PARM-PRI-DATE-GREG
464200*    MOVE P925-OD-TIME            TO PARM-PRI-HRMN
464300*    MOVE '8000'                  TO PARM-SEC-HRMN
464400*    EXEC CICS LINK
464500*              PROGRAM(P903-PGM)
464600*              COMMAREA(DATE-CONVERSION-PARMS)
464700*              LENGTH(P903-LGTH)
464800*              RESP(WS-RESPONSE)
464900*    END-EXEC
465000*    MOVE WS-RESPONSE             TO FILE-STATUS
465100*    IF NOT SUCCESS
465200*       MOVE 'P6110-1'            TO ERR-PARAGRAPH
465300*       MOVE 'P903LINK'           TO ERR-KEY
465400*       PERFORM P9999-GOT-PROBLEM
465500*    END-IF
465600*    STRING PARM-RES-GREG-CENT
465700*           PARM-RES-DATE-GREG
465800*           DELIMITED BY SIZE
465900*           INTO WS-80HRS-AGO-DATE
466000*    MOVE PARM-RES-HRMN           TO WS-80HRS-AGO-TIME
466100**
466200**   SUBTRACT 24 HOURS FROM THE ON DUTY TIME
466300**
466400*    MOVE ZEROS                   TO DATE-CONVERSION-PARMS
466500*    SET PARM-SUBTRACT            TO TRUE
466600*    MOVE P925-OD-DATE            TO PARM-PRI-DATE-GREG
466700*    MOVE P925-OD-TIME            TO PARM-PRI-HRMN
466800*    MOVE '2400'                  TO PARM-SEC-HRMN
466900*    EXEC CICS LINK
467000*              PROGRAM(P903-PGM)
467100*              COMMAREA(DATE-CONVERSION-PARMS)
467200*              LENGTH(P903-LGTH)
467300*              RESP(WS-RESPONSE)
467400*    END-EXEC
467500*    MOVE WS-RESPONSE             TO FILE-STATUS
467600*    IF NOT SUCCESS
467700*       MOVE 'P6110-2'            TO ERR-PARAGRAPH
467800*       MOVE 'P903LINK'           TO ERR-KEY
467900*       PERFORM P9999-GOT-PROBLEM
468000*    END-IF
468100*    STRING PARM-RES-GREG-CENT
468200*           PARM-RES-DATE-GREG
468300*           DELIMITED BY SIZE
468400*           INTO WS-24HRS-AGO-DATE
468500*    MOVE PARM-RES-HRMN           TO WS-24HRS-AGO-TIME
468600**
468700**   ADD 24 HOURS TO THE ON DUTY TIME
468800**
468900*    MOVE ZEROS                   TO DATE-CONVERSION-PARMS
469000*    SET PARM-ADD                 TO TRUE
469100*    MOVE P925-OD-DATE            TO PARM-PRI-DATE-GREG
469200*    MOVE P925-OD-TIME            TO PARM-PRI-HRMN
469300*    MOVE '2400'                  TO PARM-SEC-HRMN
469400*    EXEC CICS LINK
469500*              PROGRAM(P903-PGM)
469600*              COMMAREA(DATE-CONVERSION-PARMS)
469700*              LENGTH(P903-LGTH)
469800*              RESP(WS-RESPONSE)
469900*    END-EXEC
470000*    MOVE WS-RESPONSE             TO FILE-STATUS
470100*    IF NOT SUCCESS
470200*       MOVE 'P6110-3'            TO ERR-PARAGRAPH
470300*       MOVE 'P903LINK'           TO ERR-KEY
470400*       PERFORM P9999-GOT-PROBLEM
470500*    END-IF
470600*    STRING PARM-RES-GREG-CENT
470700*           PARM-RES-DATE-GREG
470800*           DELIMITED BY SIZE
470900*           INTO WS-24HRS-LATER-DATE
471000*    MOVE PARM-RES-HRMN           TO WS-24HRS-LATER-TIME
471100*
471200*    MOVE SPACES                        TO WS-TTW-AREA
471300*                                          WS-TOD-ADD-TOTAL
471400*                                          WS-TOD-SUB-TOTAL
471500*    MOVE ZEROS                         TO TTW-SUB
471600*                                          WS-TTW
471700*                                          WS-CALC1
471800*                                          WS-CALC2
471900*    MOVE SPACES                        TO WS-EMP-TOD
472000*    MOVE P925-EMP-NO                   TO EMPTOD-EMP-NBR
472100*    MOVE WS-80HRS-AGO                  TO EMPTOD-OD-DATE-TIME
472200*    SET TOD-NOT-DONE                   TO TRUE
472300*    PERFORM UNTIL TOD-DONE
472400*       MOVE EMPTOD-KEY-AREA            TO EMPTOD-EMPKEY
472500*       EXEC CICS READ
472600*                 DATASET(EMPTOD-VIA-EMP)
472700*                 INTO(WS-EMP-TOD)
472800*                 LENGTH(EMPTOD-EMP-RLGTH)
472900*                 RIDFLD(EMPTOD-EMPKEY)
473000*                 KEYLENGTH(EMPTOD-EMP-KLGTH)
473100*                 GTEQ
473200*                 RESP(WS-RESPONSE)
473300*       END-EXEC
473400*       MOVE WS-RESPONSE                TO FILE-STATUS
473500*       IF SUCCESS
473600*          IF  EMPTOD-EMP-NBR            = P925-EMP-NO
473700*          AND EMPTOD-OD-DATE-TIME   NOT > WS-OD-CENT-DATE-TIME
473800***           IF EMPTOD-OFFD-DATE-TIME  >= WS-24HRS-AGO
473900*             IF (EMPTOD-VIRTUAL-ENTRY
474000*             AND P925-INCLUDE-VIRTUALS)
474100*                OR NOT EMPTOD-VIRTUAL-ENTRY
474200*                IF TTW-SUB              > ZEROES
474300*                   MOVE ZEROS          TO DATE-CONVERSION-PARMS
474400*                   SET  PARM-DIFF      TO TRUE
474500*                   MOVE EMPTOD-OD-DATE TO PARM-PRI-DATE-GREG
474600*                   MOVE EMPTOD-OD-TIME TO PARM-PRI-HRMN
474700*                   MOVE WS-TTW-END-DATE(TTW-SUB)
474800*                                       TO PARM-SEC-DATE-GREG
474900*                   MOVE WS-TTW-END-TIME(TTW-SUB)
475000*                                       TO PARM-SEC-HRMN
475100*                   EXEC CICS LINK
475200*                             PROGRAM(P903-PGM)
475300*                             COMMAREA(DATE-CONVERSION-PARMS)
475400*                             LENGTH(P903-LGTH)
475500*                             RESP(WS-RESPONSE)
475600*                   END-EXEC
475700*                   MOVE WS-RESPONSE TO FILE-STATUS
475800*                   IF NOT SUCCESS
475900*                      MOVE 'P6110-4' TO ERR-PARAGRAPH
476000*                      MOVE 'P903LINK' TO ERR-KEY
476100*                      PERFORM P9999-GOT-PROBLEM
476200*                   END-IF
476300*                   IF PARM-RES-HR       >= 10
476400*                   OR PARM-RES-TOT-DAYS >= 1
476500*                   OR EMPTOD-REST-GREEN
476600*                   OR (EMPTOD-REST-RESPITE
476700*                      AND PARM-RES-HRMN
476800*                                     >= CNTL-A1-REQ-REST(HSUB))
476900*                      MOVE ZEROS     TO TTW-SUB
477000*                      MOVE SPACES    TO WS-TTW-AREA
477100*                      MOVE ZEROS     TO WS-TTW
477200*                      IF EMPTOD-OD-DATE-TIME  > WS-24HRS-AGO
477300*                         MOVE EMPTOD-OD-DATE-TIME TO WS-24HRS-AGO
477400*                      END-IF
477500*                   END-IF
477600*                END-IF
477700*                ADD 1                  TO TTW-SUB
477800*                MOVE EMPTOD-OD-DATE-TIME
477900*                                       TO WS-TTW-START(TTW-SUB)
478000*                MOVE EMPTOD-OFFD-DATE-TIME
478100*                                       TO WS-TTW-END(TTW-SUB)
478200*                IF EMPTOD-IMPOSED-REST-REC
478300*                   SET WS-TTW-IMP-REST(TTW-SUB)
478400*                                       TO TRUE
478500*                END-IF
478600*                IF EMPTOD-TIME-ZONE > SPACES
478700*                   MOVE EMPTOD-TIME-ZONE
478800*                                       TO WS-TTW-ZONE(TTW-SUB)
478900*                ELSE
479000*                   IF EMPTOD-DIST > SPACES
479100*                      AND EMPTOD-SDIST > SPACES
479200*                      MOVE WS-CNTL-FILE   TO WORK-SAVE-CNTL
479300*                      MOVE SPACES         TO WS-CNTL-FILE
479400*                      SET SUB-DIST-TYPE-REC
479500*                                          TO TRUE
479600*                      MOVE EMPTOD-DIST    TO CNTL-DIST
479700*                      MOVE EMPTOD-SDIST   TO CNTL-SUB-DIST
479800*                      PERFORM P8030-READ-CNTL-FILE
479900*                      IF SUCCESS
480000*                         MOVE CNTL-TIME-ZONE
480100*                                          TO WS-TTW-ZONE(TTW-SUB)
480200*                      ELSE
480300*                         MOVE 'P6110-5'   TO ERR-PARAGRAPH
480400*                         MOVE CNTLKEY     TO ERR-KEY
480500*                         PERFORM P9999-GOT-PROBLEM
480600*                      END-IF
480700*                      MOVE WORK-SAVE-CNTL TO WS-CNTL-FILE
480800*                   ELSE
480900*                      MOVE WS-EMP-TIME-ZONE
481000*                                          TO WS-TTW-ZONE(TTW-SUB)
481100*                   END-IF
481200*                END-IF
481300*             END-IF
481400***           END-IF
481500*             ADD 1                     TO EMPTOD-OD-DATE-TIME-NUM
481600*          ELSE
481700*             SET TOD-DONE              TO TRUE
481800*          END-IF
481900*       ELSE
482000*          SET TOD-DONE                 TO TRUE
482100*          IF NOT (NO-RECORD-FND OR END-OF-FILE)
482200*             MOVE 'P6110-6'            TO ERR-PARAGRAPH
482300*             MOVE EMPTOD-EMPKEY        TO ERR-KEY
482400*             PERFORM P9999-GOT-PROBLEM
482500*          END-IF
482600*       END-IF
482700*    END-PERFORM
482800**
482900**   THIS ARRAY NOW CONTAINS ALL OF THE TOURS OF DUTY THAT APPLY
483000**   WE HAVE STORED THE START/END TIMES OF EACH TOUR.
483100**
483200*    IF TTW-SUB > ZERO
483300*       PERFORM VARYING TTW-SUB FROM 1 BY 1
483400*          UNTIL TTW-SUB > 10
483500*          IF WS-TTW-START(TTW-SUB) > SPACES
483600*             AND WS-TTW-END(TTW-SUB) > SPACES
483700**
483800**            FOR YARD JOBS ADJUST THE ENDING TIME OF THE TOUR
483900**            TO THE SCHEDULED OFF DUTY TIME IF THAT TIME IS
484000**            GREATER THAN THE ACTUAL OFF DUTY TIME
484100**
484200*             IF WS-TTW-AJ-SCH-DUR(TTW-SUB) > '0000'
484300*                MOVE ZEROS       TO DATE-CONVERSION-PARMS
484400*                SET PARM-ADD     TO TRUE
484500*                MOVE WS-TTW-START-DATE(TTW-SUB)
484600*                                 TO PARM-PRI-DATE-GREG
484700*                MOVE WS-TTW-START-TIME(TTW-SUB)
484800*                                 TO PARM-PRI-HRMN
484900*                MOVE WS-TTW-AJ-SCH-DUR(TTW-SUB)
485000*                                 TO PARM-SEC-HRMN
485100*                EXEC CICS LINK
485200*                          PROGRAM(P903-PGM)
485300*                          COMMAREA(DATE-CONVERSION-PARMS)
485400*                          LENGTH(P903-LGTH)
485500*                          RESP(WS-RESPONSE)
485600*                END-EXEC
485700*                MOVE WS-RESPONSE TO FILE-STATUS
485800*                IF NOT SUCCESS
485900*                   MOVE 'P6110-7' TO ERR-PARAGRAPH
486000*                   MOVE 'P903LINK' TO ERR-KEY
486100*                   PERFORM P9999-GOT-PROBLEM
486200*                END-IF
486300*                STRING PARM-RES-GREG-CENT
486400*                       PARM-RES-DATE-GREG
486500*                       DELIMITED BY SIZE
486600*                       INTO WS-COMPARE-DATE
486700*                MOVE PARM-RES-HRMN   TO WS-COMPARE-TIME
486800*                IF WS-COMPARE > WS-TTW-END(TTW-SUB)
486900*                   MOVE WS-COMPARE   TO WS-TTW-END(TTW-SUB)
487000*                END-IF
487100*             END-IF
487200**
487300**            NOW WE COMPUTE THE ELAPSED TIME OF EACH TOUR
487400**
487500*             MOVE ZEROS          TO DATE-CONVERSION-PARMS
487600*             SET PARM-DIFF       TO TRUE
487700*             MOVE WS-TTW-END-DATE(TTW-SUB)
487800*                                 TO PARM-PRI-DATE-GREG
487900*             MOVE WS-TTW-END-TIME(TTW-SUB)
488000*                                 TO PARM-PRI-HRMN
488100*             MOVE WS-TTW-START-DATE(TTW-SUB)
488200*                                 TO PARM-SEC-DATE-GREG
488300*             MOVE WS-TTW-START-TIME(TTW-SUB)
488400*                                 TO PARM-SEC-HRMN
488500*             EXEC CICS LINK
488600*                       PROGRAM(P903-PGM)
488700*                       COMMAREA(DATE-CONVERSION-PARMS)
488800*                       LENGTH(P903-LGTH)
488900*                       RESP(WS-RESPONSE)
489000*             END-EXEC
489100*             MOVE WS-RESPONSE    TO FILE-STATUS
489200*             IF NOT SUCCESS
489300*                MOVE 'P6110-8'   TO ERR-PARAGRAPH
489400*                MOVE 'P903LINK'  TO ERR-KEY
489500*                PERFORM P9999-GOT-PROBLEM
489600*             END-IF
489700*             MOVE ZEROS          TO WS-TTW-TTOD(TTW-SUB)
489800*             MULTIPLY PARM-RES-TOT-DAYS BY 0024
489900*                 GIVING WS-TTW-TTOD-HR(TTW-SUB)
490000*             ADD PARM-RES-HR     TO WS-TTW-TTOD-HR(TTW-SUB)
490100*             MOVE PARM-RES-MN    TO WS-TTW-TTOD-MN(TTW-SUB)
490200**
490300**            IF ANY SINGLE TOUR OF DUTY EXCEEDED THE MAXIMUM
490400**            ALLOWED PER TOUR, THE EMPLOYEES STATUS IS RED,
490500**            THEY CANNOT BE CALLED AGAIN UNTIL FULLY RESTED.
490600**
490700*             IF WS-TTW-TTOD(TTW-SUB)
490800*                NOT < CNTL-A1-MAX-TOUR(HSUB)
490900*                SET WS-RED-STATUS
491000*                                 TO TRUE
491100*             END-IF
491200*             ADD WS-TTW-TTOD-HR(TTW-SUB)
491300*                                 TO WS-TTW-HR
491400*             ADD WS-TTW-TTOD-MN(TTW-SUB)
491500*                 WS-TTW-MN
491600*                 GIVING WS-CALC1
491700*             IF WS-CALC1 > 0059
491800*                ADD 1            TO WS-TTW-HR
491900*                SUBTRACT 60    FROM WS-CALC1
492000*             END-IF
492100*             MOVE WS-CALC1       TO WS-TTW-MN
492200*          END-IF
492300*       END-PERFORM
492400*    END-IF
492500*
492600*    MOVE WS-TTW                  TO P925-REST-STATUS-TTW
492700*    IF NOT WS-RED-STATUS
492800**
492900**      IF TOTAL ACCUMULATED TIME WORKING (TOTAL OF ALL TOURS)
493000**      EXCEEDS THE MAXIMUM ALLOWED IN ANY 24 HOUR PERIOD, THE
493100**      EMPLOYEES STATUS IS RED, THEY CANNOT BE CALLED AGAIN
493200**      UNTIL THEY ARE FULLY RESTED.
493300**
493400*       IF WS-TTW NOT < CNTL-A1-MAX-24(HSUB)
493500*          SET WS-RED-STATUS     TO TRUE
493600*       END-IF
493700*    END-IF
493800**
493900**   NOW WE NEED TO COMPUTE HOW MUCH REST THEY HAVE HAD TO
494000**   DETERMINE WHETHER THEY HAVE TIME REMAINING OR NOT
494100**
494200*    PERFORM P6120-CALC-UNINTERRUPTED-REST
494300**
494400**   IF THE EMPLOYEE IS NOT FULLY RESTED, TAG HIM WITH THE HIGHEST
494500**   COLOR (RED THEN YELLOW) WE FLAGGED HIM WITH IN THE PREVIOUS
494600**   EDITS.  NOTE - IF THE EMPLOYEE IS FULLY RESTED, BUT FOR SOME
494700**   REASON THE ERT OF THE TRAIN EXCEEDES THE MAX ALLOWED TIME PER
494800**   TRIP, LEAVE THE EMPLOYEE IN YELLOW STATUS.
494900**
495000*    IF WS-GREEN-STATUS
495100*       IF NOT P925-EMP-STATUS-YELLOW
495200*          AND NOT P925-EMP-STATUS-UNKNOWN
495300*          SET P925-EMP-STATUS-GREEN       TO TRUE
495400*       END-IF
495500*    ELSE
495600*       IF WS-RED-STATUS
495700*          SET P925-EMP-STATUS-RED         TO TRUE
495800*       ELSE
495900*          IF WS-YELLOW-STATUS
496000*             SET P925-EMP-STATUS-YELLOW   TO TRUE
496100*          END-IF
496200*       END-IF
496300*    END-IF
496400*    .
496500*================================================================*
496600*P6120-CALC-UNINTERRUPTED-REST.
496700*================================================================*
496800*    MOVE SPACES                        TO LAST-TTW-END
496900*                                          LAST-TTW-TIME-ZONE
497000*    MOVE ZEROS                         TO TTW-SUB
497100*                                          WS-CALC1
497200**
497300**   DETERMINE THE TIME OFF BETWEEN THE EMPLOYEE'S LAST OFF-DUTY
497400**   TIME AND P925-OD-DATE-TIME (THIS HAS BEEN ADJUSTED FOR PREP)
497500**   MINUS THE LEAD TIME.  THE LEAD TIME TO BE USED IS DETERMINED
497600**   BY THE SHORT CALL FLAG ON THE HOS CONTROL TABLE.  IF IT IS
497700**   'Y', THE EMPLOYEE'S REQUESTED LEAD TIME WILL BE USED (TELE).
497800**   IF IT IS NO, OR NO REQUESTED LEAD TIME EXISTS, THE DEFAULT
497900**   LEAD TIME WILL BE USED (POOL/SUB-DISTRICT LEAD TIME PLUS ANY
498000**   ADDITIONAL LEAD TIME DEFINED ON THE CREW PROFILE).
498100**
498200*    PERFORM VARYING TTW-SUB FROM 1 BY 1
498300*       UNTIL TTW-SUB > 10
498400*       IF WS-TTW-START(TTW-SUB)         > SPACES
498500*          IF WS-TTW-END(TTW-SUB)        > SPACES
498600*             AND NOT WS-TTW-IMP-REST(TTW-SUB)
498700*             MOVE WS-TTW-END(TTW-SUB)  TO LAST-TTW-END
498800*             MOVE WS-TTW-ZONE(TTW-SUB) TO LAST-TTW-TIME-ZONE
498900*          END-IF
499000*       ELSE
499100*          MOVE 10                      TO TTW-SUB
499200*       END-IF
499300*    END-PERFORM
499400*** 331E - PERFORM P6130 UNCONDITIONALLY - MOVE IF TO P6513
499500*    IF LAST-TTW-END > SPACES
499600*       PERFORM P6130-DETERMINE-LEAD-TIME
499700**C948 - BEGIN
499800*       IF  P925-TTA-ORDER-DATE-TIME     > ZERO
499900*       AND P925-OD-DATE-TIME            > ZERO
500000*       AND P925-TTA-ORDER-DATE-TIME NOT = P925-OD-DATE-TIME
500100*          MOVE ZEROS                   TO DATE-CONVERSION-PARMS
500200*          SET  PARM-DIFF               TO TRUE
500300*          MOVE P925-TTA-ORDER-DATE     TO PARM-PRI-DATE-GREG
500400*          MOVE P925-TTA-ORDER-TIME     TO PARM-PRI-HRMN
500500*          MOVE P925-OD-DATE            TO PARM-SEC-DATE-GREG
500600*          MOVE P925-OD-TIME            TO PARM-SEC-HRMN
500700*          EXEC CICS LINK
500800*                    PROGRAM (P903-PGM)
500900*                    COMMAREA(DATE-CONVERSION-PARMS)
501000*                    LENGTH  (P903-LGTH)
501100*                    RESP    (WS-RESPONSE)
501200*          END-EXEC
501300*          MOVE WS-RESPONSE             TO FILE-STATUS
501400*          IF NOT SUCCESS
501500*             MOVE 'P6120-4'            TO ERR-PARAGRAPH
501600*             MOVE 'P903'               TO ERR-KEY
501700*             PERFORM P9999-GOT-PROBLEM
501800*          END-IF
501900*          MULTIPLY PARM-RES-TOT-DAYS BY 24 GIVING WORK-HR
502000*          ADD  PARM-RES-HR             TO WORK-HR
502100*          MOVE PARM-RES-MN             TO WORK-MN
502200*          MOVE ZEROS                   TO DATE-CONVERSION-PARMS
502300*          SET  PARM-ADD                TO TRUE
502400*          IF WORK-HR                    > ZERO
502500*          OR WORK-MN                    > 15
502600*             MOVE P925-OD-DATE         TO WS-OD-DATE
502700*             MOVE P925-OD-TIME         TO WS-OD-TIME
502800*          ELSE
502900*             MOVE P925-TTA-ORDER-DATE  TO WS-OD-DATE
503000*             MOVE P925-TTA-ORDER-TIME  TO WS-OD-TIME
503100*          END-IF
503200*       ELSE
503300*          MOVE P925-OD-DATE            TO WS-OD-DATE
503400*          MOVE P925-OD-TIME            TO WS-OD-TIME
503500*       END-IF
503600**C948 - END
503700*       IF WS-LEAD-TIME > SPACES
503800*          MOVE ZEROES                  TO DATE-CONVERSION-PARMS
503900*          SET PARM-SUBTRACT            TO TRUE
504000*          MOVE WS-OD-DATE              TO PARM-PRI-DATE-GREG
504100*          MOVE WS-OD-TIME              TO PARM-PRI-HRMN
504200*          MOVE WS-LEAD-TIME            TO PARM-SEC-HRMN
504300*          EXEC CICS LINK
504400*                    PROGRAM (P903-PGM)
504500*                    COMMAREA(DATE-CONVERSION-PARMS)
504600*                    LENGTH  (P903-LGTH)
504700*                    RESP    (WS-RESPONSE)
504800*          END-EXEC
504900*          MOVE WS-RESPONSE             TO FILE-STATUS
505000*          IF NOT SUCCESS
505100*             MOVE 'P6120-1'            TO ERR-PARAGRAPH
505200*             PERFORM P9999-GOT-PROBLEM
505300*          END-IF
505400*          MOVE PARM-RES-GREG-CENT    TO WS-HOLD-P925-OD-DATE(1:2)
505500*          MOVE PARM-RES-DATE-GREG    TO WS-HOLD-P925-OD-DATE(3:6)
505600*          MOVE PARM-RES-TIME         TO WS-HOLD-P925-OD-TIME
505700*       ELSE
505800*          SET  DE-YYMMDD-FORMAT      TO TRUE
505900*          MOVE WS-OD-DATE            TO DE-YYMMDD
506000*          PERFORM P8998-DATEEDIT
506100*          MOVE DE-CCYYMMDD           TO WS-HOLD-P925-OD-DATE
506200*          MOVE WS-OD-TIME            TO WS-HOLD-P925-OD-TIME
506300*       END-IF
506400*
506500*       MOVE ZEROS                      TO DATE-CONVERSION-PARMS
506600*       SET PARM-DIFF                   TO TRUE
506700*       IF LAST-TTW-TIME-ZONE NOT = WS-EMP-TIME-ZONE
506800*          MOVE SPACES                  TO TZ-PARAMETERS
506900*          MOVE LAST-TTW-TIME-ZONE      TO TZ-IN-ZONE
507000*          MOVE LAST-TTW-DATE-TIME      TO TZ-IN-DATE-TIME
507100*          MOVE WS-EMP-TIME-ZONE        TO TZ-OUT-ZONE
507200*          PERFORM P8996-TIMEZONE
507300*          IF TZ-INVALID-PARAMETERS
507400*             MOVE 'P6120-2'            TO ERR-PARAGRAPH
507500*             PERFORM P8996-TZERROR
507600*          END-IF
507700*          MOVE TZ-OUT-DATE             TO PARM-PRI-DATE-GREG
507800*          MOVE TZ-OUT-TIME             TO PARM-PRI-HRMN
507900*       ELSE
508000*          MOVE LAST-TTW-DATE           TO PARM-PRI-DATE-GREG
508100*          MOVE LAST-TTW-TIME           TO PARM-PRI-HRMN
508200*       END-IF
508300*       MOVE WS-HOLD-P925-OD-DATE(3:6)  TO PARM-SEC-DATE-GREG
508400*       MOVE WS-HOLD-P925-OD-TIME       TO PARM-SEC-HRMN
508500*       EXEC CICS LINK
508600*                 PROGRAM (P903-PGM)
508700*                 COMMAREA(DATE-CONVERSION-PARMS)
508800*                 LENGTH  (P903-LGTH)
508900*                 RESP    (WS-RESPONSE)
509000*       END-EXEC
509100*       MOVE WS-RESPONSE                TO FILE-STATUS
509200*       IF NOT SUCCESS
509300*          MOVE 'P6120-3'               TO ERR-PARAGRAPH
509400*          PERFORM P9999-GOT-PROBLEM
509500*       END-IF
509600**
509700**      IF THE EMPLOYEE'S UNINTERRUPTED REST WAS GREATER THAN
509800**      THE REQUIRED REST, CHANGE HIM TO GREEN STATUS.
509900**
510000*       MULTIPLY PARM-RES-TOT-DAYS BY 24 GIVING WS-CALC1
510100*       ADD PARM-RES-HR                 TO WS-CALC1
510200*       IF WS-CALC1 > 99
510300*          MOVE 99                      TO WS-MIN-HR
510400*       ELSE
510500*          MOVE WS-CALC1                TO WS-MIN-HR
510600*       END-IF
510700*       MOVE PARM-RES-MN                TO WS-MIN-MN
510800*
510900*       IF WS-MINUTES >= CNTL-A1-REQ-REST(HSUB)
511000*          SET WS-GREEN-STATUS          TO TRUE
511100*          MOVE SPACES                  TO WS-YELLOW-STATUS-FLAG
511200*       END-IF
511300*    ELSE
511400*       SET WS-GREEN-STATUS             TO TRUE
511500*       MOVE SPACES                     TO WS-YELLOW-STATUS-FLAG
511600*    END-IF
511700**
511800**   IF THEIR STATUS WASN'T ALREADY CHANGED TO GREEN
511900**   CHECK TO SEE IF THEY HAVE ENOUGH TIME AVAILABLE TO WORK
512000**   THE TRIP THEY ARE BEING REQUESTED TO WORK
512100**
512200*    IF WS-YELLOW-STATUS
512300*       IF CNTL-A1-MAX-24(HSUB) NOT NUMERIC
512400*          MOVE '2400'                  TO CNTL-A1-MAX-24(HSUB)
512500*       END-IF
512600*       MOVE CNTL-A1-MAX-24(HSUB)       TO WS-MINUTES
512700**
512800**      IF THE TOTAL ACCUMULATED TIME WORKING IN THE LAST 24 HOURS
512900**      IS LESS THAN THE MAXIMUM ALLOWED IN ANY 24 HOUR PERIOD
513000**      SEE IF THE BALANCE IS ENOUGH TO WORK THE TRIP
513100**
513200*       IF WS-MINUTES > WS-TTW
513300*          MULTIPLY WS-MIN-HR BY 60 GIVING WS-CALC1
513400*          ADD WS-MIN-MN                TO WS-CALC1
513500*
513600*          MULTIPLY WS-TTW-HR BY 60 GIVING WS-CALC2
513700*          ADD WS-TTW-MN                TO WS-CALC2
513800*
513900*          SUBTRACT WS-CALC2          FROM WS-CALC1
514000*
514100*          IF WS-CALC1 > 0059
514200*             DIVIDE WS-CALC1 BY 0060  GIVING WS-MIN-HR
514300*                                   REMAINDER WS-MIN-MN
514400*          ELSE
514500*             MOVE ZEROS                TO WS-MIN-HR
514600*             MOVE WS-CALC1             TO WS-MIN-MN
514700*          END-IF
514800*
514900*          IF CNTL-A1-MAX-TOUR(HSUB) < WS-MINUTES
515000*             AND CNTL-A1-MAX-TOUR(HSUB) NUMERIC
515100*             MOVE CNTL-A1-MAX-TOUR(HSUB)
515200*                                       TO WS-TTA
515300*          ELSE
515400*             MOVE WS-MINUTES           TO WS-TTA
515500*          END-IF
515600*          MOVE WS-TTA                  TO P925-REST-STATUS-TTA
515700**
515800**         WE NOW KNOW HOW MUCH TIME THE EMPLOYEE HAS LEFT
515900**         TO WORK(WS-TTA) NOW WE CHECK TO SEE IF IT IS ENOUGH
516000**         FOR THEM TO COMPLETE THE TOUR OF DUTY BASED ON THE
516100**         ESTIMATED RUN TIME - IF THEY HAVE ENOUGH TIME THEIR
516200**         STATUS REMAINS YELLOW, IF THEY DO NOT HAVE ENOUGH
516300**         TIME THEIR STATUS IS RED.
516400**
516500*          IF P925-REST-STATUS-TTA < P925-REST-STATUS-ERT
516600*             SET WS-RED-STATUS         TO TRUE
516700*          END-IF
516800*       ELSE
516900**
517000**         THE EMPLOYEE HAS ALREADY WORKED THE MAXIMUM ALLOWED
517100**         IN A 24 HOUR PERIOD AND CANNOT WORK AGAIN UNTIL FULLY
517200**         RESTED. - THEIR STATUS IS RED
517300**
517400*          SET WS-RED-STATUS            TO TRUE
517500*          MOVE ZEROES                  TO P925-REST-STATUS-TTA
517600*       END-IF
517700*    END-IF.
396200*
396200*CNLD-287-E
517800*================================================================*
517900 P6121-GET-RUN-MILE-CNTL.
518000*================================================================*
518100     MOVE SPACES               TO TKCRKEY-AREA
518200     SET  RUN-MILES-REC        TO TRUE
518300     MOVE P925-STATION         TO TKCR-FROM-LOCATION
518400     MOVE P925-FINAL-STATION   TO TKCR-TO-LOCATION
518500     MOVE P925-ROUTE-DESGN     TO TKCR-ROUTE-DESIGNATION
518600     MOVE P925-OD-DATE         TO TKCR-EXP-DATE
518700     IF TKCR-EXP-DATE(1:2)      > 80
518800        MOVE '19'              TO TKCR-EXP-CE
518900     ELSE
519000        MOVE '20'              TO TKCR-EXP-CE
519100     END-IF
519200     MOVE TKCRKEY-AREA         TO TKCRKEY
519300     EXEC CICS READ
519400               GTEQ
519500               DATASET(TKCR-FILE-VIA-TKCRKEY)
519600               INTO(WS-TKCR-FILE)
519700               LENGTH(TKCRFILE-RLGTH)
519800               RIDFLD(TKCRKEY)
519900               KEYLENGTH(TKCRFILE-KLGTH)
520000               RESP(WS-RESPONSE)
520100     END-EXEC
520200     MOVE WS-RESPONSE          TO FILE-STATUS
520300     IF  SUCCESS
520400     AND RUN-MILES-REC
520500     AND P925-STATION           = TKCR-FROM-LOCATION
520600     AND P925-FINAL-STATION     = TKCR-TO-LOCATION
520700     AND P925-ROUTE-DESGN       = TKCR-ROUTE-DESIGNATION
521100*CNLD-274-B RJA
520800*       CONTINUE
601200        IF TKCR-36-EST-LAYOVER-TIME > '0000'
601200           MOVE TKCR-36-EST-LAYOVER-TIME
601300                               TO WS-EST-LAYOVER-TIME
520900        END-IF
521100*CNLD-274-E RJA
520900     ELSE
521000        MOVE ZEROES            TO TKCR-36-EST-RUN-TIME
521400     END-IF.
521500*CNC0600 RJA B
521600*
521700 P6125-CAN-WRR-REST-CHECK.
521800*
521900     PERFORM P6130-DETERMINE-LEAD-TIME
522000*
522100     IF EMP-MTOD-NUM > ZERO AND
522200*CNLD-244-B #3 CNC0600
522300*       P925-ORDER-DATE-TIME > ZERO
522400        P925-OD-DATE-TIME > ZERO
522500*CNLD-244-E
522600        MOVE ZEROS             TO DATE-CONVERSION-PARMS
522700        SET PARM-ADD           TO TRUE
522800        MOVE EMP-MTOD-DATE     TO PARM-PRI-DATE-GREG
522900        MOVE EMP-MTOD-TIME     TO PARM-PRI-HRMN
523000        MOVE WS-LEAD-HR        TO PARM-SEC-HR
523100        MOVE WS-LEAD-MN        TO PARM-SEC-MN
523200        EXEC CICS LINK
523300                  PROGRAM(P903-PGM)
523400                  COMMAREA(DATE-CONVERSION-PARMS)
523500                  LENGTH(P903-LGTH)
523600                  RESP(WS-RESPONSE)
523700        END-EXEC
523800        MOVE WS-RESPONSE             TO FILE-STATUS
523900        IF NOT SUCCESS
524000           MOVE 'P6125-2'            TO ERR-PARAGRAPH
524100           PERFORM P9999-GOT-PROBLEM
524200        END-IF
524300        MOVE PARM-RES-DATE-GREG      TO WS-MTOD-PLUS-LEAD-DT
524400        MOVE PARM-RES-HRMN           TO WS-MTOD-PLUS-LEAD-TM
524500*CNLD-244-B #3 CNC0600
524600*       IF WS-MTOD-PLUS-LEAD-DTTM > P925-ORDER-DATE-TIME
524700        IF WS-MTOD-PLUS-LEAD-DTTM > P925-OD-DATE-TIME
524800*CNLD-244-E
524900*CNLD-230-B CNC0600
525000        AND NOT P925-EMP-STATUS-RED
525100*CNLD-230-E
525200           SET P925-EMP-STATUS-RED TO TRUE
525300           SET P925-OVERRIDE-ALLOW TO TRUE
525400*CNLD-230-B CNC0600
525500           SET P925-RFR-MTOD       TO TRUE
525600*CNLD-230-E
525700        ELSE
525800           IF NOT P925-EMP-STATUS-YELLOW
525900              SET P925-EMP-STATUS-GREEN TO TRUE
526000           END-IF
526100        END-IF
526200     END-IF
526300*CNC0600 RJA E
526400*CNLD-265-B
526500*CHECK PERSONAL REST
526600     IF EMP-PERS-REST-NUM > ZERO AND
526700        P925-ORDER-DATE-TIME > ZERO
526800        AND NOT (P925-EMP-STATUS-RED AND P925-OVERRIDE-DENY)
526900
527000        MOVE ZEROS             TO DATE-CONVERSION-PARMS
527100        SET PARM-ADD           TO TRUE
527200        MOVE EMP-PERS-REST-DATE TO PARM-PRI-DATE-GREG
527300        MOVE EMP-PERS-REST-TIME TO PARM-PRI-HRMN
527400        MOVE P925-CAN-WRR-LEAD-TIME
527500                                TO PARM-SEC-HRMN
527600        EXEC CICS LINK
527700                  PROGRAM(P903-PGM)
527800                  COMMAREA(DATE-CONVERSION-PARMS)
527900                  LENGTH(P903-LGTH)
528000                  RESP(WS-RESPONSE)
528100        END-EXEC
528200        MOVE WS-RESPONSE             TO FILE-STATUS
528300        IF NOT SUCCESS
528400           MOVE 'P6125-2'            TO ERR-PARAGRAPH
528500           PERFORM P9999-GOT-PROBLEM
528600        END-IF
528700        MOVE PARM-RES-DATE-GREG      TO WS-PERS-PLUS-LEAD-DT
528800        MOVE PARM-RES-HRMN           TO WS-PERS-PLUS-LEAD-TM
528900        IF WS-PERS-PLUS-LEAD-DTTM > P925-ORDER-DATE-TIME
529000           SET P925-EMP-STATUS-RED TO TRUE
529100           SET P925-OVERRIDE-DENY  TO TRUE
529200           SET P925-RFR-PERS       TO TRUE
529300        END-IF
529400     END-IF
529500     .
529600*CNLD-265-E
529700*
529800 P6130-DETERMINE-LEAD-TIME.
529900*
530000     MOVE SPACES                        TO WS-LEAD-TIME
530100                                           WS-ADDL-LEAD-TIME
530200                                           IGNORE-LEAD-TIME-FLAG
530300*** 331E - MOVED FROM P6120
530400     IF P925-LEAD-TIME > SPACES
530500        MOVE P925-LEAD-TIME             TO WS-LEAD-TIME
530600     END-IF
530700     IF SHORT-CALL-YES
530800*C1207 - BEG
530900***     AND WS-LEAD-TIME = SPACES
531000        IF WS-LEAD-TIME = SPACES
531100        OR P925-ALT-CREW-SRC-USED
531200*C1207 - END
531300*
531400*       SEE IF THE EMPLOYEE HAS REQUESTED A LEAD TIME
531500*
531600        EXEC CICS ASKTIME
531700                  ABSTIME(WS-ABSTIME)
531800        END-EXEC
531900        ADD WS-ABSTIME-OFFSET  TO WS-ABSTIME
532000        EXEC CICS FORMATTIME
532100                  ABSTIME(WS-ABSTIME)
532200                  YYYYMMDD(WS-SYSTEM-DATE-CENT)
532300                  TIME(WS-SYSTEM-TIME-AREA)
532400        END-EXEC
532500*
532600*       CONVERT SYSTEM DATE/TIME TO LOCAL DATE/TIME
532700*
532800        MOVE ZEROS                      TO TZ-PARAMETERS
532900        MOVE SPACES                     TO TZ-STATUS-FLAG
533000        MOVE TZ-SYSTEM-TIME-ZONE        TO TZ-IN-ZONE
533100        MOVE WS-EMP-TIME-ZONE           TO TZ-OUT-ZONE
533200        MOVE WS-SYSTEM-DATE-TIME        TO TZ-IN-DATE-TIME
533300        PERFORM P8996-TIMEZONE
533400        MOVE TZ-OUT-DATE-TIME-CENT      TO WS-LOCAL-DATE-TIME-CENT
533500*
533600        MOVE SPACES                     TO PS52-COMMAREA-PARMS
533700        MOVE P925-EMP-NO                TO PS52-EMP-NBR
533800        SET PS52-CMA-MODE               TO TRUE
533900        MOVE WS-LOCAL-DATE-TIME         TO PS52-INPUT-DATE-TIME
534000        EXEC CICS LINK
534100                  PROGRAM(PS52-PGM)
534200                  COMMAREA(PS52-COMMAREA-PARMS)
534300                  LENGTH(PS52-LGTH)
534400                  RESP(WS-RESPONSE)
534500        END-EXEC
534600        MOVE WS-RESPONSE                TO FILE-STATUS
534700        IF NOT SUCCESS
534800           MOVE SPACE                   TO PS52-REQ-LEAD-TIME
534900        END-IF
535000        IF PS52-REQ-LEAD-TIME > SPACES
535100           AND PS52-REQ-LEAD-TIME > '0000'
535200           MOVE PS52-REQ-LEAD-TIME      TO WS-LEAD-TIME
535300        END-IF
535400*C1207 - BEG
535500        END-IF
535600*C1207 - END
535700     END-IF
535800*
535900*    IF NO REQUESTED LEAD TIME WAS FOUND, GET THE DEFAULT
536000*    LEAD OFF OF THE POOL SETUP (ROAD JOBS) OR THE SUB-DISTRICT
536100*    CONTROL (ASSIGNED JOBS).
536200*
536300     SET TRCN-NOT-FOUND                 TO TRUE
536400     IF P925-TRCNKEY1 > SPACES
536500        MOVE SPACES                     TO WS-TRCN-FILE
536600        MOVE P925-TRCNKEY1              TO TRCNKEY1
536700        EXEC CICS READ
536800                  DATASET(TRAIN-CN-VIA-TRCNKEY1)
536900                  INTO(WS-TRCN-FILE)
537000                  LENGTH(TRAINCN-RLGTH)
537100                  RIDFLD(TRCNKEY1)
537200                  KEYLENGTH(TRAINCN-KLGTH)
537300                  RESP(WS-RESPONSE)
537400        END-EXEC
537500        MOVE WS-RESPONSE                TO FILE-STATUS
537600        IF SUCCESS
537700           SET TRCN-FOUND               TO TRUE
537800           IF TRCN-SHIFT-CALL-TIE-YES
537900              OR TRCN-SHIFT-CALL-YES
538000              SET SHIFT-CALLED          TO TRUE
538100           END-IF
538200           IF TRCN-IGNORE-LEAD-TIME
538300              SET IGNORE-LEAD-TIME      TO TRUE
538400           END-IF
538500        ELSE
538600           MOVE 'P6130-2'               TO ERR-PARAGRAPH
538700           MOVE TRCNKEY1                TO ERR-KEY
538800           PERFORM P9999-GOT-PROBLEM
538900        END-IF
539000     END-IF
539100
539200     IF WS-LEAD-TIME NOT > SPACES
539300        AND TRCN-FOUND
539400        IF TRCN-ADDL-LEAD-TIME > SPACES
539500           MOVE TRCN-ADDL-LEAD-TIME  TO WS-ADDL-LEAD-TIME
539600        END-IF
539700        MOVE WS-CNTL-FILE               TO WORK-SAVE-CNTL
539800        MOVE SPACES                     TO WS-CNTL-FILE
539900        IF TRCN-POOL-REC
540000           PERFORM P6150-GET-POOL-CNTL
540100           IF BLE-CRAFT
540200              IF TRCN-EN-FROM-TERM = '0'
540300                 MOVE CNTL-POOL-HOME-LEAD-TIME
540400                                     TO WS-LEAD-TIME
540500              ELSE
540600                 IF TRCN-EN-FROM-TERM > '0' AND < '6'
540700                    MOVE TRCN-EN-FROM-TERM
540800                                     TO I
540900                    MOVE CNTL-AWAY-LTIME(I)
541000                                     TO WS-LEAD-TIME
541100                 END-IF
541200              END-IF
541300           ELSE
541400              IF TRCN-TR-FROM-TERM = '0'
541500                 MOVE CNTL-POOL-HOME-LEAD-TIME
541600                                     TO WS-LEAD-TIME
541700              ELSE
541800                 IF TRCN-TR-FROM-TERM > '0' AND < '6'
541900                    MOVE TRCN-TR-FROM-TERM
542000                                     TO I
542100                    MOVE CNTL-AWAY-LTIME(I)
542200                                     TO WS-LEAD-TIME
542300                 END-IF
542400              END-IF
542500           END-IF
542600           PERFORM P6151-GET-POOL-CNTL-3A
542700           IF CNTL-POOL-IGNORE-LEAD-TIME
542800              SET IGNORE-LEAD-TIME      TO TRUE
542900           END-IF
543000        ELSE
543100           SET SUB-DIST-TYPE-REC        TO TRUE
543200           MOVE TRCN-DIST               TO CNTL-DIST
543300           MOVE TRCN-SDIST              TO CNTL-SUB-DIST
543400           PERFORM P8030-READ-CNTL-FILE
543500           IF SUCCESS
543600              MOVE CNTL-LEAD-CALL-TIME  TO WS-LEAD-TIME
543700           ELSE
543800              MOVE 'P6130-4'            TO ERR-PARAGRAPH
543900              MOVE CNTLKEY              TO ERR-KEY
544000              PERFORM P9999-GOT-PROBLEM
544100           END-IF
544200        END-IF
544300        MOVE WORK-SAVE-CNTL             TO WS-CNTL-FILE
544400*
544500*       ADJUST FOR ADDL LEAD TIME, WHEN NECESSARY
544600*
544700        IF WS-ADDL-LEAD-TIME > SPACES
544800           IF WS-LEAD-TIME > SPACES
544900              COMPUTE WS-HR = WS-LEAD-HR +
545000                              WS-ADDL-LEAD-HR
545100              COMPUTE WS-MN = WS-LEAD-MN +
545200                              WS-ADDL-LEAD-MN
545300              IF WS-MN >= 060
545400                 SUBTRACT 60          FROM WS-MN
545500                 ADD 1                  TO WS-HR
545600              END-IF
545700              MOVE WS-HR                TO WS-LEAD-HR
545800              MOVE WS-MN                TO WS-LEAD-MN
545900           ELSE
546000              MOVE WS-ADDL-LEAD-TIME    TO WS-LEAD-TIME
546100           END-IF
546200        END-IF
546300     END-IF
546400
546500*
546600*    ZERO OUT LEAD TIME FOR REGULAR OWNERS OF GO-TRAINS
546700*
546800     MOVE TRCN-ASSIGNMENT               TO JOB-DEF-CHECK
546900     IF JOB-DEF-COMMUTER-ASGN
547000        AND SHIFT-CALLED
547100        IF NOT VACANCY-FILLED
547200*
547300*          WE'VE GOT THE REGULAR OWNER
547400*
547500           MOVE SPACES                  TO WS-LEAD-TIME
547600        ELSE
547700*
547800*          DETERMINE IF THE REGULAR OWNER IS FILLING ONTO HIS
547900*          OWN ASSIGNMENT (EXCLUDING CRAFT - AN AC FILLING ONTO
548000*          THE CO POSITION OF THE SAME ASSIGNMENT IS CONSIDERED
548100*          THE 'REGULAR' OWNER).
548200*
548300           MOVE SPACES                  TO WS-ASSIGN-COMMAREA
548400                                           WS-ASGN-FILE
548500           SET GET-EMPS-LATEST-TEMP-JOB TO TRUE
548600           MOVE P925-EMP-NO             TO ASGN-EMP-NO
548700           MOVE WS-ASGN-FILE            TO WS-ASSIGN-RECORD
548800           EXEC CICS LINK
548900                     PROGRAM(P901-PGM)
549000                     COMMAREA(WS-ASSIGN-COMMAREA)
549100                     LENGTH(P901-LGTH)
549200                     RESP(WS-RESPONSE)
549300           END-EXEC
549400           MOVE WS-RESPONSE             TO FILE-STATUS
549500           IF NOT SUCCESS
549600              MOVE 'P6130-5'            TO ERR-PARAGRAPH
549700              MOVE 'P901LINK'           TO ERR-KEY
549800              PERFORM P9999-GOT-PROBLEM
549900           END-IF
550000           MOVE WS-ASSIGN-RECORD        TO WS-ASGN-FILE
550100           IF ASGN-ASSIGNMENT > SPACES
550200              IF ASGN-DIST               = TRCN-DIST
550300                 AND ASGN-SUB-DIST       = TRCN-SDIST
550400                 AND ASGN-AJ-JOB-NO      = TRCN-ASSIGNMENT
550500* IGNORE CRAFT   AND ASGN-AJ-JOB-CC      = P925-ASGN-CC
550600                 MOVE SPACES            TO WS-LEAD-TIME
550700              END-IF
550800           ELSE
550900              PERFORM P8210-GET-OWNED-JOB
551000              IF ASGN-ASSIGNMENT > SPACES
551100                 IF ASGN-DIST            = TRCN-DIST
551200                    AND ASGN-SUB-DIST    = TRCN-SDIST
551300                    AND ASGN-AJ-JOB-NO   = TRCN-ASSIGNMENT
551400* IGNORE CRAFT      AND ASGN-AJ-JOB-CC   = P925-ASGN-CC
551500                    MOVE SPACES         TO WS-LEAD-TIME
551600                 END-IF
551700              END-IF
551800           END-IF
551900        END-IF
552000     END-IF
552100*** 331E - IF IGNORE-LEAD-TIME AND REGULAR OWNER, BLANK OUT LEAD
552200     IF IGNORE-LEAD-TIME
552300        AND NOT VACANCY-FILLED
552400        MOVE SPACES TO WS-LEAD-TIME
552500     END-IF
552600*CNC0600 RJA B
552700     IF WS-CAN-WRR-NEW
552800        IF  TRCN-DIST    > SPACES
552900        AND TRCN-SDIST   > SPACES
553000*       FETCH SUB-DIST LEAD TIME
553100           SET SUB-DIST-TYPE-REC        TO TRUE
553200           MOVE TRCN-DIST               TO CNTL-DIST
553300           MOVE TRCN-SDIST              TO CNTL-SUB-DIST
553400           PERFORM P8030-READ-CNTL-FILE
553500           IF SUCCESS
553600              MOVE CNTL-LEAD-CALL-TIME  TO WS-SD-LEAD-TIME
553700           ELSE
553800              MOVE 'P6130-6'            TO ERR-PARAGRAPH
553900              MOVE CNTLKEY              TO ERR-KEY
554000              PERFORM P9999-GOT-PROBLEM
554100           END-IF
554200
554300*       COMPARE WS-SD-LEAD-TIME W/ COMPUTED WS-LEAD-TIME
554400*       AND SAVE THE GREATER
554500           IF WS-SD-LEAD-TIME > WS-LEAD-TIME
554600              MOVE WS-SD-LEAD-TIME      TO WS-LEAD-TIME
554700           END-IF
554800        END-IF
554900
555000*CNLD-207-DXC-B
555100        MOVE WS-LEAD-TIME         TO P925-CAN-WRR-LEAD-TIME
555200*CNLD-207-DXC-E
555300*CNLD-250-DXC-B
555400        IF VACANCY-FILLED
555500        AND (SHIFT-CALLED OR IGNORE-LEAD-TIME)
555600*07/26/23 RJA B CNC0600 CNLD-269
555700*          PERFORM P7300-CHECK-BSTD-EMP-SCHDL
555800           IF P925-PROMOTING-EMP
555900              SET PROMOTING-EMP-IGNORE-LD-TM TO TRUE
556000           END-IF
556100*07/26/23 RJA E
556200        END-IF
556300*CNLD-250-DXC-E
556400
556500*CNLD-251-B CNC0600
556600        IF IGNORE-LEAD-TIME
556700*07/26/23 RJA B CNC0600 CNLD-269
556800*          AND (NOT VACANCY-FILLED OR BOOSTED-EMPL-YES)
556900           AND ((NOT VACANCY-FILLED) OR
557000                PROMOTING-EMP-IGNORE-LD-TM)
557100*07/26/23 RJA E
557200*          WS-LEAD-TIME WILL BE USED FOR THE MTOD EDIT IN P6125;
557300*          P925-CAN-WRR-LEAD-TIME WILL BE USED ELSEWHERE
557400           MOVE SPACES            TO P925-CAN-WRR-LEAD-TIME
557500        END-IF
557600*CNLD-251-E
557700     END-IF
557800*CNC0600 RJA E
557900     .
558000*=================================================================
558100 P6150-GET-POOL-CNTL.
558200*=================================================================
558300     SET POOL-TYPE-REC            TO TRUE
558400     MOVE P925-ASGN-CC            TO WS-CRAFT-CODE-CHECK
558500     IF BLE-CRAFT
558600        MOVE TRCN-EN-FROM-DIST    TO CNTL-DIST
558700        MOVE TRCN-EN-FROM-SDIST   TO CNTL-SUB-DIST
558800        MOVE TRCN-EN-FROM-POOL    TO CNTL-POOL-CODE
558900     ELSE
559000        MOVE TRCN-TR-FROM-DIST    TO CNTL-DIST
559100        MOVE TRCN-TR-FROM-SDIST   TO CNTL-SUB-DIST
559200        MOVE TRCN-TR-FROM-POOL    TO CNTL-POOL-CODE
559300     END-IF
559400     MOVE 'F'                     TO CNTL-POOL-TYPE
559500     PERFORM P8030-READ-CNTL-FILE
559600*** CNC0331E - SAVE POOL RECORD FOR LATER USE
559700     IF SUCCESS
559800        MOVE WS-CNTL-FILE         TO WORK-SAVE-POOL
559900     ELSE
560000        MOVE 'P6150-1'            TO ERR-PARAGRAPH
560100        MOVE CNTLKEY              TO ERR-KEY
560200        PERFORM P9999-GOT-PROBLEM
560300     END-IF.
560400*=================================================================
560500 P6151-GET-POOL-CNTL-3A.
560600*=================================================================
560700*** 331E - NEW
560800     SET CREW-PROFILE-REC         TO TRUE
560900     MOVE P925-ASGN-CC            TO WS-CRAFT-CODE-CHECK
561000     IF BLE-CRAFT
561100        MOVE TRCN-EN-FROM-DIST    TO CNTL-DIST
561200        MOVE TRCN-EN-FROM-SDIST   TO CNTL-SUB-DIST
561300        MOVE TRCN-EN-FROM-POOL    TO CNTL-POOL-CODE
561400     ELSE
561500        MOVE TRCN-TR-FROM-DIST    TO CNTL-DIST
561600        MOVE TRCN-TR-FROM-SDIST   TO CNTL-SUB-DIST
561700        MOVE TRCN-TR-FROM-POOL    TO CNTL-POOL-CODE
561800     END-IF
561900     MOVE 'F'                     TO CNTL-POOL-TYPE
562000     PERFORM P8030-READ-CNTL-FILE
562100     IF NOT SUCCESS
562200        MOVE 'P6151-1'            TO ERR-PARAGRAPH
562300        MOVE CNTLKEY              TO ERR-KEY
562400        PERFORM P9999-GOT-PROBLEM
562500     END-IF.
562600*=================================================================
562700 P6160-CALC-TTA-DATE-TIME.
562800*=================================================================
562900*CNC0524
563000
563000*CNLD-271-B
563000*
563000*    IF  P925-TTA-ORDER-DATE-TIME     > ZERO
563100*    AND P925-OD-DATE-TIME            > ZERO
563200*    AND P925-TTA-ORDER-DATE-TIME NOT = P925-OD-DATE-TIME
563300*       MOVE ZEROS                   TO DATE-CONVERSION-PARMS
563400*       SET  PARM-DIFF               TO TRUE
563500*       MOVE P925-TTA-ORDER-DATE     TO PARM-PRI-DATE-GREG
563600*       MOVE P925-TTA-ORDER-TIME     TO PARM-PRI-HRMN
563700*       MOVE P925-OD-DATE            TO PARM-SEC-DATE-GREG
563800*       MOVE P925-OD-TIME            TO PARM-SEC-HRMN
563900*       EXEC CICS LINK
564000*                 PROGRAM (P903-PGM)
564100*                 COMMAREA(DATE-CONVERSION-PARMS)
564200*                 LENGTH  (P903-LGTH)
564300*                 RESP    (WS-RESPONSE)
564400*       END-EXEC
564500*       MOVE WS-RESPONSE             TO FILE-STATUS
564600*       IF NOT SUCCESS
564700*          MOVE 'P6160-1'            TO ERR-PARAGRAPH
564800*          MOVE 'P903'               TO ERR-KEY
564900*          PERFORM P9999-GOT-PROBLEM
565000*       END-IF
565100*       MULTIPLY PARM-RES-TOT-DAYS BY 24 GIVING WORK-HR
565200*       ADD  PARM-RES-HR             TO WORK-HR
565300*       MOVE PARM-RES-MN             TO WORK-MN
565400*       MOVE ZEROS                   TO DATE-CONVERSION-PARMS
565500*       SET  PARM-ADD                TO TRUE
565600*       IF WORK-HR                    > ZERO
565700*       OR WORK-MN                    > 15
565800*          MOVE P925-OD-DATE         TO PARM-PRI-DATE-GREG
565900*          MOVE P925-OD-TIME         TO PARM-PRI-HRMN
566000*       ELSE
566100*          MOVE P925-TTA-ORDER-DATE  TO PARM-PRI-DATE-GREG
566200*          MOVE P925-TTA-ORDER-TIME  TO PARM-PRI-HRMN
566300*       END-IF
566400**C949 - BEGIN
566500*    ELSE
566600*       MOVE ZEROS                   TO DATE-CONVERSION-PARMS
566700*       SET  PARM-ADD                TO TRUE
566800*       MOVE P925-OD-DATE            TO PARM-PRI-DATE-GREG
566900*       MOVE P925-OD-TIME            TO PARM-PRI-HRMN
567000*    END-IF
567100**C949 - END
567100
566600     MOVE ZEROS                   TO DATE-CONVERSION-PARMS
566700     SET  PARM-ADD                TO TRUE
566800     MOVE P925-OD-DATE            TO PARM-PRI-DATE-GREG
566900     MOVE P925-OD-TIME            TO PARM-PRI-HRMN
563000*
563000* CNLD-271-E
567100
567200     IF P925-REST-STATUS-TTA      NOT > ZEROES
567300        MOVE '0001'                  TO PARM-SEC-HRMN
567400     ELSE
567500        MOVE P925-REST-STATUS-TTA    TO PARM-SEC-HRMN
567600     END-IF
567700     EXEC CICS LINK
567800               PROGRAM (P903-PGM)
567900               COMMAREA(DATE-CONVERSION-PARMS)
568000               LENGTH  (P903-LGTH)
568100               RESP    (WS-RESPONSE)
568200     END-EXEC
568300     MOVE WS-RESPONSE                TO FILE-STATUS
568400     IF NOT SUCCESS
568500        MOVE 'P6160-2'               TO ERR-PARAGRAPH
568600        MOVE 'P903'                  TO ERR-KEY
568700        PERFORM P9999-GOT-PROBLEM
568800     END-IF
568900     MOVE PARM-RES-DATE-GREG         TO WS-TEMP-DATE
569000     MOVE PARM-RES-HRMN              TO WS-TEMP-TIME
569100     MOVE SPACES                     TO TZ-PARAMETERS
569200     MOVE WS-EMP-TIME-ZONE           TO TZ-IN-ZONE
569300     MOVE WS-TEMP-DATE-TIME          TO TZ-IN-DATE-TIME
569400     MOVE P925-TIME-ZONE             TO TZ-OUT-ZONE
569500     PERFORM P8996-TIMEZONE
569600     IF TZ-INVALID-PARAMETERS
569700        MOVE 'P6160TZ1'              TO ERR-PARAGRAPH
569800        PERFORM P8996-TZERROR
569900     END-IF
570000     MOVE TZ-OUT-DATE-TIME       TO WS-TEMP-DATE-TIME1
570100     MOVE WS-TEMP-DATE1-DD       TO P925-REST-STATUS-TTA-DTTM(5:2)
570200     MOVE WS-TEMP-TIME1          TO P925-REST-STATUS-TTA-DTTM(1:4)
570300     .
570400*CNC0600-B
570500*=================================================================
570600*CNLD-230-B CNC0600
570700*P6170-GET-28D-TOTAL-OD.
570800 P6170-GET-TTOD.
570900*CNLD-230-E
571000*=================================================================
571100
571200     SET PS08-INQUIRY-FUN            TO TRUE
571300     MOVE P925-EMP-NO                TO PS08-EMP-NBR
571400
571500     EXEC CICS LINK
571600               PROGRAM(PS08-PGM)
571700               COMMAREA(PS08-COMMAREA-PARMS)
571800               LENGTH(PS08-LGTH)
571900               RESP(WS-RESPONSE)
572000     END-EXEC
572100     MOVE WS-RESPONSE                TO FILE-STATUS
572200     IF NOT SUCCESS
572300        MOVE 'P6100-7'               TO ERR-PARAGRAPH
572400        MOVE 'PS08LINK'              TO ERR-KEY
572500        PERFORM P9999-GOT-PROBLEM
572600     END-IF
572700     IF NOT PS08-NO-ERRORS
572800        MOVE 'P6100-8'               TO ERR-PARAGRAPH
572900        MOVE PS08-RETURN-ERRORS      TO ERR-KEY
573000        MOVE 'CHECK S08 INPUT PARAMETERS'
573100                                     TO ERR-SENTENCE
573200        PERFORM P9999-GOT-PROBLEM
573300     END-IF
573400     .
573500*=================================================================
573600 P6180-7DAY-RESET-BRK-EDITS.
573700*=================================================================
573800
573900     MOVE P925-EMP-NO              TO MSTR3NBRK
574000
574100     EXEC CICS READ
574200               DATASET(MSTR3-VIA-EMP-NBR)
574300               INTO(WS-MSTR3)
574400               LENGTH(MSTR3ENBR-RLGTH)
574500               RIDFLD(MSTR3NBRK)
574600               KEYLENGTH(MSTR3ENBR-KLGTH)
574700               RESP(WS-RESPONSE)
574800     END-EXEC
574900     MOVE WS-RESPONSE              TO FILE-STATUS.
575000     IF NOT SUCCESS
575100        IF NOT (NO-RECORD-FND OR END-OF-FILE)
575200           MOVE 'P6180-0'          TO ERR-PARAGRAPH
575300           MOVE MSTR3NBRK          TO ERR-KEY
575400           PERFORM P9999-GOT-PROBLEM
575500        END-IF
575600     ELSE
575700* CNLD-214 B CNC0600
575800*
575900*CNLD-244-B #3 CNC0600
576000*       PERFORM P6196-ORD-MINUS-LEAD-AND-LOCAL
576100        PERFORM P6196-OD-MINUS-LEAD-AND-LOCAL
576200*CNLD-244-E
576300*
576400        MOVE SPACES TO NATURAL-RESET-AT-CALL-FL
576500                       NATURAL-RESET-BEFORE-CALL-FL
576600                       DONT-CHECK-RB-OR-7D-FL
576700
576800        MOVE P925-OD-DATE   TO WS-EMP-EFF-DATE
576900        MOVE P925-OD-TIME   TO WS-EMP-EFF-TIME
577000
577100*CNLD-259 B CNC0600
577200        IF WS-OD-MINUS-LEAD-DTTM <= MSTR3-SYSTEM-UD2-TO
577300        AND NOT (P925-EMP-STATUS-RED AND P925-OVERRIDE-DENY)
577400           SET P925-EMP-STATUS-RED   TO TRUE
577500           SET P925-OVERRIDE-DENY    TO TRUE
577600           SET P925-RFR-LEAD-IN-SYS-UD TO TRUE
577700        END-IF
577800
577900        IF WS-EMP-EFF-DATE-TIME <= MSTR3-SYSTEM-RESET-BRK
578000        AND NOT (P925-EMP-STATUS-RED AND P925-OVERRIDE-DENY)
578100           SET P925-EMP-STATUS-RED   TO TRUE
578200           SET P925-OVERRIDE-DENY    TO TRUE
578300           SET P925-RFR-OD-IN-SYS-RB TO TRUE
578400        END-IF
578500
578600        IF NOT (WS-OD-MINUS-LEAD-DTTM <= MSTR3-SYSTEM-UD2-TO OR
578700                WS-EMP-EFF-DATE-TIME  <= MSTR3-SYSTEM-RESET-BRK)
578800*CNLD-259 E
578900           IF (MSTR3-PROJ-RESET-BRK = MSTR3-SYSTEM-RESET-BRK)
579000           AND MSTR3-SYSTEM-RESET-BRK > '0000000000'
579100*          CALL IS HAPPENING AFTER A SYSTEM-RESET;
579200*          SYSTEM-RESETS HAPPEN WHEN EMP IS AT HOME;
579300*
579400*          IF FOR SOME REASON EMP IS NOT AT HOME, WE WILL STILL
579500*          MARK THE FIRST VALID HOS AFTER SYSTEM-RESET AS
579600*          7DAY-START.
579700*
579800*          CHECK FOR ANY HOS B/W SYSTEM-RESET AND THIS CALL
579900
580000              PERFORM P1131-PRV-HOS-AFTER-SYS-RESET
580100           ELSE
580200*RJA  5/17/2023 B CNC0600
580300*
580400*CHECKING IF NATURAL RESET HAS HAPPENED ALREADY
580500              PERFORM P1132-RECALC-PROJ-RESET-BRK
580600*RJA  5/17/2023 E
580700           END-IF
580800*
580900           IF NOT DONT-CHECK-RB-OR-7D
581000              PERFORM P1140-CALCULATE-7DAY-END
581100              PERFORM P6181-DO-CHECK-RB-OR-7D
581200           END-IF
581300*
581400*CNLD-259 B CNC0600
581500        END-IF
581600*CNLD-259 E
581700* CNLD-214 E
581800     END-IF
581900     .
582000*
582100 P6181-DO-CHECK-RB-OR-7D.
582200*
582300
582400*    ON 08S, P925-LOCAL-LT-UDR2  & P925-MTOD-GT-LOCAL CONDITIONS
582500*    WILL BE CHECKED ONLY FOR VACANCY-FILL OR HELPED EMPLOYEES.
582600
582700*CNLD-207-DXC-B
582800
582900*CNLD-244-B #3 CNC0600
583000*    IF WS-ORDER-MINUS-LEAD-DTTM     < WS-UPD-PROJ-DATE-TIME
583100     IF WS-OD-MINUS-LEAD-DTTM       <= WS-UPD-PROJ-DATE-TIME
583200*CNLD-244-E
583300
583400*CNLD-230-B
583500*    NATURAL-RESETS ARE ONLY WRITTEN WHEN AT HOME;
583600*    THIS CHECK IS VALID ONLY AT HOME
583700     AND (AT-HOME-TERM OR WS-OUTPOST-HOME)
583800*CNLD-230-E
583900*CNLD-244-B #3 CNC0600
584000*       PERFORM P6197-CHK-TRN-ORD-RST-BRK-DIF
584100        PERFORM P6197-CHK-TIME-UNTIL-RESET-BRK
584200*CNLD-244-E
584300        IF EMP-RST-IN-HR-YES
584400*CNLD-244-B #3 CNC0600
584500*          SET P925-ORDR-LT-RESET
584600*                            TO TRUE
584700           SET P925-RESET-IN-LT-1HR TO TRUE
584800*CNLD-244-E
584900        END-IF
585000     END-IF
585100
585200*CNLD-244-B #3 CNC0600
585300*    IF WS-ORDER-MINUS-LEAD-DTTM     > WS-UPD-PROJ-DATE-TIME
585400     IF WS-OD-MINUS-LEAD-DTTM        > WS-UPD-PROJ-DATE-TIME
585500*CNLD-244-E
585600
585700*CNLD-230-B
585800*    NATURAL-RESETS ARE ONLY WRITTEN WHEN AT HOME;
585900*    THIS CHECK IS VALID ONLY AT HOME
586000     AND (AT-HOME-TERM OR WS-OUTPOST-HOME)
586100*CNLD-230-E
586200*CNLD-259 B CNC0600   **EMP CAN BE CALLED AFTER 2ND UDR**
586300*       IF  WS-LOCAL-DATE-TIME      <= WS-UPD-PROJ-DATE-TIME
586400        IF  WS-LOCAL-DATE-TIME      <= WS-UPD-PROJ-UD2-TO
586500*CNLD-259 E CNC0600
586600*CNLD-251-B CNC0600
586700*       IGNORE-LEAD-TIME IS TRUE FOR 'SHOW JOBS' WHERE CALLER
586800*       DOESN'T ACTUALLY CALL THE OWNER; OWNER SHOWS UP FOR JOB.
586900        AND NOT (IGNORE-LEAD-TIME
587000*07/26/23 RJA B CNC0600 CNLD-269
587100**CNLD-250-DXC-B
587200*                 AND (NOT VACANCY-FILLED OR BOOSTED-EMPL-YES))
587300**CNLD-250-DXC-E
587400                 AND ((NOT VACANCY-FILLED) OR
587500                      PROMOTING-EMP-IGNORE-LD-TM))
587600*07/26/23 RJA E
587700*CNLD-251-E
587800*CNLD-259 B CNC0600
587900*          SET P925-LOCAL-LT-RESET
588000*                            TO TRUE
588100           SET P925-LOCAL-LE-UDR2 TO TRUE
588200*CNLD-259 E CNC0600
588300*CNLD-244-B #3 CNC0600
588400*          MOVE WS-UPD-PROJ-TIME
588500*                            TO P925-RB-MSG-1-HRMN
588600*
588700*       NATURAL RESET HAPPENS WHEN LOCAL-DATE-TIME > WS-UPD-PROJ
588800           MOVE ZEROS        TO DATE-CONVERSION-PARMS
588900           SET PARM-ADD      TO TRUE
589000*CNLD-259 B CNC0600   **EMP CAN BE CALLED AFTER 2ND UDR**
589100*          MOVE WS-UPD-PROJ-DATE TO PARM-PRI-DATE-GREG
589200*          MOVE WS-UPD-PROJ-TIME TO PARM-PRI-HRMN
589300           MOVE WS-UPD-PROJ-UD2-TO-DATE TO PARM-PRI-DATE-GREG
589400           MOVE WS-UPD-PROJ-UD2-TO-TIME TO PARM-PRI-HRMN
589500*CNLD-259 E CNC0600
589600           MOVE '0001'       TO PARM-SEC-HRMN
589700           EXEC CICS LINK
589800               PROGRAM(P903-PGM)
589900               COMMAREA(DATE-CONVERSION-PARMS)
590000               LENGTH(P903-LGTH)
590100               RESP(WS-RESPONSE)
590200           END-EXEC
590300           MOVE WS-RESPONSE  TO FILE-STATUS
590400           IF NOT SUCCESS
590500              MOVE 'P6180-3' TO ERR-PARAGRAPH
590600              MOVE 'P903LINK'
590700                             TO ERR-KEY
590800              PERFORM P9999-GOT-PROBLEM
590900           END-IF
591000           MOVE PARM-RES-HRMN
591100                             TO P925-RB-MSG-1-HRMN
591200*CNLD-244-E
591300        END-IF
591400*CNLD-207-DXC-E
591500     ELSE
591600*
591700*       CHECK ATLEAST 6HRS AVAILABLE BEFORE RESET
591800*
591900*CNLD-230-B
592000*       IF AT-HOME-TERM AND NOT P925-EMP-STATUS-RED
592100*CNLD-230-E
592200        MOVE ZEROS        TO DATE-CONVERSION-PARMS
592300        SET PARM-ADD      TO TRUE
592400        MOVE P925-OD-DATE TO PARM-PRI-DATE-GREG
592500        MOVE P925-OD-TIME TO PARM-PRI-HRMN
592600        MOVE '0600'       TO PARM-SEC-HRMN
592700        EXEC CICS LINK
592800            PROGRAM(P903-PGM)
592900            COMMAREA(DATE-CONVERSION-PARMS)
593000            LENGTH(P903-LGTH)
593100            RESP(WS-RESPONSE)
593200        END-EXEC
593300        MOVE WS-RESPONSE  TO FILE-STATUS
593400        IF NOT SUCCESS
593500           MOVE 'P6180-2' TO ERR-PARAGRAPH
593600           MOVE 'P903LINK'
593700                          TO ERR-KEY
593800           PERFORM P9999-GOT-PROBLEM
593900        END-IF
594000        MOVE PARM-RES-DATE-GREG
594100                          TO WS-OD-ERT-DATE
594200        MOVE PARM-RES-HRMN
594300                          TO WS-OD-ERT-TIME
594400* CNLD-214 B CNC0600
594500*             IF WS-OD-ERT-DATE-TIME
594600*                               >= MSTR3-7DAY-END-PERIOD
594700*                AND MSTR3-7DAY-END-PERIOD > '0000000000'
594800        IF WS-OD-ERT-DATE-TIME
594900                          >= WS-WRR-7DAY-END
595000           AND WS-WRR-7DAY-END       > '0000000000'
595100* CNLD-214 E
595200*CNLD-230-B
595300           IF (AT-HOME-TERM OR WS-OUTPOST-HOME)
595400              IF NOT (P925-EMP-STATUS-RED AND P925-OVERRIDE-DENY)
595500                 SET P925-EMP-STATUS-RED
595600                                TO TRUE
595700                 SET P925-OVERRIDE-DENY
595800                                TO TRUE
595900                 SET P925-RFR-7DAY-HRS
596000                                TO TRUE
596100              END-IF
596200           ELSE
596300              IF NOT  P925-EMP-STATUS-RED
596400                 SET P925-EMP-STATUS-RED
596500                                TO TRUE
596600                 SET P925-OVERRIDE-ALLOW
596700                                TO TRUE
596800                 SET P925-RFR-7DAY-HRS
596900                                TO TRUE
597000              END-IF
597100           END-IF
597200*CNLD-230-E
597300        END-IF
597400
597500        IF WS-TIEUP-HOME
597600* 19Q QUOC'S EMAIL 05/14/23; SHIFT-CALL JOBS WILL ALWAYS BE A
597700* TURNAROUND (ORIGIN = DESTINATION); THIS CHECK IS TO INCLUDE ANY
597800* PEOPLE AT THE OUTPOST PROTECTING A YARD-JOB.
597900           OR (EIBTRNID = P08S-TRAN)
598000           OR WS-TRCN-YARD-REC
598100*
598200           MOVE P925-REST-STATUS-ERT
598300                             TO WS-7DAY-ERT
598400        ELSE
598500*CNLD-274-B
598600* IF THERE IS A VALID TIME IN TKCR-36-EST-LAYOVER-TIME, USE THIS
598700* TO CALCULATE 7DAY-ERT, ELSE USE STANDARD 10 HOURS.
598800*             COMPUTE WS-7DAY-ERT = (2 * P925-REST-STATUS-ERT )
598900*                                    + TKCR-36-EST-LAYOVER-TIME
599000*CNLD-274-E
599100*             COMPUTE WS-7DAY-ERT = (2 * P925-REST-STATUS-ERT )
599200*                                    + 10HRS
599300
599400           MOVE ZEROES       TO TEMP-CALC-MNS
599500                                TEMP-TIME1
599600           MOVE P925-REST-STATUS-ERT
599700                             TO TEMP-TIME1-4
599800           MOVE TEMP-TIME1-MN
599900                             TO TEMP-CALC-MNS
600000           ADD TEMP-TIME1-HR TO TEMP-TIME1-HR
600100           ADD TEMP-TIME1-MN TO TEMP-CALC-MNS
600200           IF TEMP-CALC-MNS  > 59
600300              ADD 1          TO TEMP-TIME1-HR
600400              SUBTRACT 60    FROM TEMP-CALC-MNS
600500           END-IF
600600           MOVE TEMP-CALC-MNS(2:2)
600700                             TO TEMP-TIME1-MN
600800*CNLD-274-B
601000*          ADD 1000          TO TEMP-TIME1
601100           IF WS-EST-LAYOVER-TIME      > 0000
601000*             WS-EST-LAYOVER-TIME IS TKCR-36-EST-LAYOVER-TIME
601400              ADD WS-EST-LAYOVER-TIME
601500                             TO TEMP-TIME1
601600           ELSE
601800              ADD 1000       TO TEMP-TIME1
601900           END-IF
602000*CNLD-274-E
602100           MOVE TEMP-TIME1   TO WS-7DAY-ERT
602200        END-IF
602300*
602400        MOVE ZEROS           TO DATE-CONVERSION-PARMS
602500        SET PARM-ADD         TO TRUE
602600        MOVE P925-OD-DATE    TO PARM-PRI-DATE-GREG
602700        MOVE P925-OD-TIME    TO PARM-PRI-HRMN
602800        MOVE WS-7DAY-ERT     TO PARM-SEC-HRMN
602900        EXEC CICS LINK
603000            PROGRAM(P903-PGM)
603100            COMMAREA(DATE-CONVERSION-PARMS)
603200            LENGTH(P903-LGTH)
603300            RESP(WS-RESPONSE)
603400        END-EXEC
603500        MOVE WS-RESPONSE     TO FILE-STATUS
603600        IF NOT SUCCESS
603700           MOVE 'P6180-1'    TO ERR-PARAGRAPH
603800           MOVE 'P903LINK'   TO ERR-KEY
603900           PERFORM P9999-GOT-PROBLEM
604000        END-IF
604100        MOVE PARM-RES-DATE-GREG
604200                             TO WS-OD-ERT-DATE
604300        MOVE PARM-RES-HRMN   TO WS-OD-ERT-TIME
604400* CNLD-214 B CNC0600
604500*             IF WS-OD-ERT-DATE-TIME >= MSTR3-7DAY-END-PERIOD
604600*                AND MSTR3-7DAY-END-PERIOD > '0000000000'
604700        IF WS-OD-ERT-DATE-TIME >= WS-WRR-7DAY-END
604800           AND WS-WRR-7DAY-END       > '0000000000'
604900*CNLD-230-B
605000           AND NOT P925-EMP-STATUS-RED
605100*CNLD-230-E
605200* CNLD-214 E
605300           SET P925-EMP-STATUS-RED
605400                             TO TRUE
605500           SET P925-OVERRIDE-ALLOW
605600                             TO TRUE
605700*CNLD-230-B
605800           MOVE WS-7DAY-ERT  TO WS-7DAY-ERT-NUM
605900           MOVE WS-7DAY-ERT-NUM
606000                             TO P925-RFR-MSG
606100           IF WS-TIEUP-HOME
606200              SET P925-RFR-7DAY-ERT
606300                             TO TRUE
606400           ELSE
606500              SET P925-RFR-7DAY-RND-ERT
606600                             TO TRUE
606700           END-IF
606800*CNLD-230-E
606900        END-IF
607000     END-IF
607100     .
607200* CNLD-214 B CNC0600
607300*
607400 P1131-PRV-HOS-AFTER-SYS-RESET.
607500*
607600*    CONTROL REACHES HERE ONLY IF :
607700*    MSTR3-SYSTEM-RESET-BRK = MSTR3-PROJ-RESET-BRK
607800
607900     PERFORM P1132A-FETCH-WRR-START
608000
608100     IF MSTR3-PROJ-RESET-BRK > WS-WRR-START-DTTM
608200        MOVE MSTR3-PROJ-RESET-BRK TO WS-7DAY-START-DTTM
608300     ELSE
608400        PERFORM P1132D-COMP-8DAYS-AGO
608500
608600        IF WS-8DAYS-AGO-DTTM > WS-WRR-START-DTTM
608700           MOVE WS-8DAYS-AGO-DTTM  TO WS-7DAY-START-DTTM
608800        ELSE
608900*          START READING FROM (WS-WRR-START-DTTM - 1 DAY)
609000           PERFORM P1132B-WRR-START-MINUS-1DY
609100        END-IF
609200     END-IF
609300
609400     MOVE SPACES                     TO WS-EMP-TOD
609500     MOVE MSTR3-EMP-NBR              TO EMPTOD-EMP-NBR
609600     MOVE WS-7DAY-START-DATE         TO DE-YYMMDD
609700     SET DE-YYMMDD-FORMAT            TO TRUE
609800     PERFORM P8998-DATEEDIT
609900     MOVE DE-CCYYMMDD                TO EMPTOD-OD-DATE-CENT
610000     MOVE WS-7DAY-START-TIME         TO EMPTOD-OD-TIME
610100     MOVE EMPTOD-KEY-AREA            TO EMPTOD-EMPKEY
610200
610300     PERFORM P8060-EMPTOD-STARTBR
610400     MOVE 'N'                        TO WS-READ-DONE-CODE
610500     MOVE '0000000000'               TO WS-7DAY-START-DTTM
610600     PERFORM UNTIL READ-DONE
610700        PERFORM P8070-EMPTOD-READNEXT
610800        IF SUCCESS
610900           IF EMPTOD-EMP-NBR = MSTR3-EMP-NBR
611000              AND WS-EMP-EFF-DATE-TIME > EMPTOD-OD-YYMMDD-HRMN
611100*
611200              IF (NOT EMPTOD-VIRTUAL-ENTRY) AND
611300*
611400                 (NOT EMPTOD-IMPOSED-REST-REC)
611500*             EMPTOD-IMPOSED-REST-REC IS UNLIKELY TO BE FOUND WITH
611600*             NEW CAN WRR, ADDING THIS AS A SANITY CHECK
611700                 IF EMPTOD-RESET-BREAK-REC
611800                    MOVE '0000000000'   TO WS-7DAY-START-DTTM
611900                 END-IF
612000                 IF EMPTOD-CONTACT AND
612100                    WS-7DAY-START-DTTM > '0000000000'
612200                    IF ((EMPTOD-OD-YYMMDD-HRMN >=
612300                             WS-UPD-PROJ-UD1-FROM
612400                          AND EMPTOD-OD-YYMMDD-HRMN <=
612500                               WS-UPD-PROJ-UD1-TO)
612600                        OR
612700                        (EMPTOD-OD-YYMMDD-HRMN >=
612800                            WS-UPD-PROJ-UD2-FROM
612900                          AND EMPTOD-OD-YYMMDD-HRMN <=
613000                                  WS-UPD-PROJ-UD2-TO)
613100                        OR
613200                        (EMPTOD-OFFD-YYMMDD-HRMN >=
613300                            WS-UPD-PROJ-UD1-FROM
613400                          AND EMPTOD-OFFD-YYMMDD-HRMN <=
613500                                  WS-UPD-PROJ-UD1-TO)
613600                        OR
613700                        (EMPTOD-OFFD-YYMMDD-HRMN >=
613800                            WS-UPD-PROJ-UD2-FROM
613900                          AND EMPTOD-OFFD-YYMMDD-HRMN <=
614000                                  WS-UPD-PROJ-UD2-TO))
614100                       PERFORM P1136E-EXTEND-PROJ-RESET
614200                       MOVE EMPTOD-OFFD-YYMMDD-HRMN
614300                                   TO LAST-EMPTOD-OFFD-YYMMDD-HRMN
614400                    END-IF
614500                 END-IF
614600*
614700                 IF (NOT EMPTOD-CONTACT) AND
614800                    (NOT EMPTOD-RESET-BREAK-REC)
614900*
615000                    IF WS-7DAY-START-DTTM NOT > '0000000000'
615100                    AND EMPTOD-OD-YYMMDD-HRMN <=
615200                                              WS-WRR-START-DTTM
615300                    AND EMPTOD-OFFD-YYMMDD-HRMN >
615400                                              WS-WRR-START-DTTM
615500                       MOVE WS-WRR-START-DTTM
615600                                   TO WS-7DAY-START-DTTM
615700                       PERFORM P1136-COMPUTE-PROJ-RESET
615800                       MOVE EMPTOD-OFFD-YYMMDD-HRMN
615900                                   TO LAST-EMPTOD-OFFD-YYMMDD-HRMN
616000                    END-IF
616100
616200                    IF WS-7DAY-START-DTTM NOT > '0000000000'
616300                    AND EMPTOD-OD-YYMMDD-HRMN >=
616400                                              WS-WRR-START-DTTM
616500*
616600                       MOVE EMPTOD-OD-YYMMDD-HRMN
616700                                        TO WS-7DAY-START-DTTM
616800*
616900                       PERFORM P1136-COMPUTE-PROJ-RESET
617000                       MOVE EMPTOD-OFFD-YYMMDD-HRMN
617100                                TO LAST-EMPTOD-OFFD-YYMMDD-HRMN
617200                    END-IF
617300
617400                    IF WS-7DAY-START-DTTM     > '0000000000'
617500                    AND EMPTOD-OD-YYMMDD-HRMN >
617600                        WS-UPD-PROJ-DATE-TIME
617700                    AND (EMPTOD-HOS-CLAIM OR
617800                         EMPTOD-COMMUTE   OR
617900                         EMPTOD-MANUAL)
618000*                      TRAIN RELATED HOS SHOULD BE SKIPPED:
618100*                      WITH TRAINS, (ORDER - LEAD) SHOULD BE MORE
618200*                      THAN PROJECTED-RESET WHICH IS CHECKED AT
618300*                      THE TIME OF CALL; HERE, WE ONLY LOOK FOR
618400*                      RESETS BEFORE HOS-CLAIMS AND MANUAL/COMMUTE
618500*
618600*                      THERE WILL BE AT LEAST 1 HOS RECORD BETWEEN
618700*                      SYSTEM RESET AND THIS NATURAL RESET
618800                       SET NATURAL-RESET-BEFORE-CALL TO TRUE
618900*
619000                       MOVE EMPTOD-OD-YYMMDD-HRMN
619100                                        TO WS-7DAY-START-DTTM
619200                       PERFORM P1136-COMPUTE-PROJ-RESET
619300                       MOVE EMPTOD-OFFD-YYMMDD-HRMN
619400                                   TO LAST-EMPTOD-OFFD-YYMMDD-HRMN
619500                    END-IF
619600                    IF WS-7DAY-START-DTTM     > '0000000000'
619700                    AND EMPTOD-OFFD-YYMMDD-HRMN >
619800                       LAST-EMPTOD-OFFD-YYMMDD-HRMN
619900*                      THERE CAN BE OVERLAPPING HOS, PROJ-RESET
620000*                      SHOULD BE COMPUTED W/ GREATEST OFFD READ
620100                       PERFORM P1136-COMPUTE-PROJ-RESET
620200                       MOVE EMPTOD-OFFD-YYMMDD-HRMN
620300                                   TO LAST-EMPTOD-OFFD-YYMMDD-HRMN
620400                    END-IF
620500*
620600                 END-IF
620700*
620800              END-IF
620900*
621000           ELSE
621100              SET READ-DONE          TO TRUE
621200           END-IF
621300        ELSE
621400           SET READ-DONE             TO TRUE
621500        END-IF
621600     END-PERFORM
621700     PERFORM P8090-EMPTOD-ENDBR
621800
621900     IF (WS-7DAY-START-DTTM NOT > '0000000000')
622000*       NO HOS RECORDS WERE FOUND AFTER SYSTEM RESET
622100
622200        SET DONT-CHECK-RB-OR-7D      TO TRUE
622300
622400     ELSE
622500*       HOS RECORDS WERE FOUND AFTER SYSTEM RESET;
622600
622700*    NO NEED FOR 'MSTR3-PROJ-RESET-BRK > WS-UPD-PROJ-DATE-TIME'
622800*    CHECK HERE AS MSTR3-SYSTEM-RESET-BRK = MSTR3-PROJ-RESET-BRK
622900*    AND WE STARTED READING EMPTOD FROM THERE
623000
623100*CNLD-244-B #3 CNC0600
623200*       IF WS-ORDER-MINUS-LEAD-DTTM > WS-UPD-PROJ-DATE-TIME
623300*       AND WS-EMP-EFF-DATE-TIME    > WS-UPD-PROJ-DATE-TIME
623400        IF WS-OD-MINUS-LEAD-DTTM    > WS-UPD-PROJ-DATE-TIME
623500*CNLD-244-E
623600
623700*RJA  5/22/2023 B CNC0600
623800*       LOCAL TIME CHECK IS NOT REQUIRED FOR SHIFT-CALL REG OWNERS
623900
624000*CNLD-259 B CNC0600   **EMP CAN BE CALLED AFTER 2ND UDR**
624100*       AND ((WS-LOCAL-DATE-TIME      > WS-UPD-PROJ-DATE-TIME)
624200        AND ((WS-LOCAL-DATE-TIME      > WS-UPD-PROJ-UD2-TO)
624300*CNLD-259 E CNC0600
624400
624500*07/26/23 RJA B CNC0600 CNLD-269
624600**CNLD-250-DXC-B
624700*             OR ((EIBTRNID = P08S-TRAN OR IGNORE-LEAD-TIME) AND
624800*                (NOT VACANCY-FILLED OR BOOSTED-EMPL-YES )))
624900**CNLD-250-DXC-E
625000             OR ((EIBTRNID = P08S-TRAN OR IGNORE-LEAD-TIME) AND
625100                 ((NOT VACANCY-FILLED) OR
625200                  PROMOTING-EMP-IGNORE-LD-TM)))
625300*07/26/23 RJA E
625400*RJA  5/22/2023 E CNC0600
625500
625600*       NATURAL-RESET-AT-CALL CAN HAPPEN ONLY WHEN CALLED AT HOME;
625700*       THIS FIRST TRAIN-CALL AFTER A SYS RESET SHOULD BE AT HOME;
625800*       IF FOR SOME REASON IT ISN'T, WE WILL STILL NEED TO RECORD
625900*       THIS AS A NATURAL-RESET FOR CALCULATION PURPOSES, SO THE
626000*       AT-HOME CHECK SHOULD NOT BE ADDED HERE.
626100           SET NATURAL-RESET-AT-CALL TO TRUE
626200*
626300           SET DONT-CHECK-RB-OR-7D   TO TRUE
626400        END-IF
626500     END-IF
626600     .
626700
626800*RJA  5/17/2023 B CNC0600
626900*
627000 P1132-RECALC-PROJ-RESET-BRK.
627100*
627200     PERFORM P1132A-FETCH-WRR-START
627300
627400     IF MSTR3-7DAY-END-PERIOD > '0000000000'
627500*       COMPUTE 7DAY START FROM MSTR3
627600        PERFORM P1140A-CALCULATE-7DAY-START
627700
627800        IF WS-7DAY-START-DTTM > WS-WRR-START-DTTM
627900           CONTINUE
628000        ELSE
628100           PERFORM P1132D-COMP-8DAYS-AGO
628200
628300           IF WS-8DAYS-AGO-DTTM > WS-WRR-START-DTTM
628400              MOVE WS-8DAYS-AGO-DTTM  TO WS-7DAY-START-DTTM
628500           ELSE
628600*             START READING FROM (WS-WRR-START-DTTM - 1 DAY)
628700              PERFORM P1132B-WRR-START-MINUS-1DY
628800           END-IF
628900        END-IF
629000     ELSE
629100        PERFORM P1132D-COMP-8DAYS-AGO
629200
629300        IF WS-8DAYS-AGO-DTTM > WS-WRR-START-DTTM
629400           MOVE WS-8DAYS-AGO-DTTM  TO WS-7DAY-START-DTTM
629500        ELSE
629600*          START READING FROM (WS-WRR-START-DTTM - 1 DAY)
629700           PERFORM P1132B-WRR-START-MINUS-1DY
629800        END-IF
629900     END-IF
630000
630100     PERFORM P1133-PRV-HOS-AFTER-7DY-START
630200     .
630300*
630400 P1132A-FETCH-WRR-START.
630500*
630600     IF WS-WRR-START-DTTM > SPACES
630700* VALIDATE DTTM ON SUB-DISTRICT CONTROL
630800        PERFORM P1132C-CHECK-WRR-START
630900     END-IF
631000
631100     IF WS-WRR-START-DTTM NOT > SPACES
631200* NO DTTM/VALID-DTTM ON SUB-DISTRICT CHECK THE CORPORATE CONTROL
631300        MOVE SPACES          TO CNTLKEY-AREA
631400        SET COMPANY-TYPE-REC TO TRUE
631500        EXEC CICS READ
631600                  DATASET(CNTL-FILE-VIA-CNTLKEY)
631700                  INTO(WS-CNTL-FILE)
631800                  LENGTH(CNTLFILE-RLGTH)
631900                  RIDFLD(CNTLKEY-AREA)
632000                  KEYLENGTH(CNTLFILE-KLGTH)
632100                  RESP(WS-RESPONSE)
632200        END-EXEC
632300        MOVE WS-RESPONSE TO FILE-STATUS
632400        IF NOT SUCCESS
632500          MOVE 'P1132A-1' TO ERR-PARAGRAPH
632600          PERFORM P9999-GOT-PROBLEM
632700        END-IF
632800        IF CNTL-00-WRR-BEGINNING-DTTM > SPACES
632900           MOVE CNTL-00-WRR-BEGINNING-DTTM
633000                                TO WS-WRR-START-DTTM
633100           PERFORM P1132C-CHECK-WRR-START
633200        END-IF
633300     END-IF
633400
633500     IF WS-WRR-START-DTTM NOT > SPACES
633600* NO DATE ON CONTROLS DEFAULT TO GOVERNMENT DATE
633700        MOVE '2305250001' TO WS-WRR-START-DTTM
633800     END-IF
633900     .
634000
634100*
634200 P1132B-WRR-START-MINUS-1DY.
634300*
634400* SUBTRACT 1 DAY FROM THE ABOVE RESULT - THE THEORY HERE IS THAT
634500*  NO TOUR OF DUTY WILL HAVE LASTED MORE THAN 24 HOURS, SO WE CAN
634600*  GO BACK 1 DAY AND START LOOKING AT THE RECORDS STARTING FROM
634700*  THAT DATE TO DETERMINE IF ANY OF THE TIME ON DUTY SHOULD COUNT
634800     MOVE ZEROS              TO DATE-CONVERSION-PARMS
634900     SET PARM-SUBTRACT       TO TRUE
635000     MOVE WS-WRR-START-DATE  TO PARM-PRI-DATE-GREG
635100     MOVE 01                 TO PARM-SEC-GREG-DAY
635200     EXEC CICS LINK
635300               PROGRAM(P903-PGM)
635400               COMMAREA(DATE-CONVERSION-PARMS)
635500               LENGTH(P903-LGTH)
635600               RESP(WS-RESPONSE)
635700     END-EXEC
635800     MOVE WS-RESPONSE             TO FILE-STATUS
635900     IF NOT SUCCESS
636000        MOVE 'P1132B-1'           TO ERR-PARAGRAPH
636100        MOVE 'P903LINK'           TO ERR-KEY
636200        PERFORM P9999-GOT-PROBLEM
636300     END-IF
636400
636500     MOVE PARM-RES-DATE-GREG TO WS-7DAY-START-DATE
636600     MOVE WS-WRR-START-TIME  TO WS-7DAY-START-TIME
636700     .
636800
636900*
637000 P1132C-CHECK-WRR-START.
637100*
637200     MOVE WS-WRR-START-DATE   TO DE-YYMMDD
637300     SET DE-YYMMDD-FORMAT     TO TRUE
637400     PERFORM P8998-DATEEDIT
637500     IF DE-INVALID-DATE
637600        MOVE SPACES TO WS-WRR-START-DTTM
637700     END-IF
637800     IF WS-WRR-START-TIME > SPACES
637900        MOVE WS-WRR-START-TIME   TO TE-MILITARY-TIME
638000        SET TE-MILITARY-FORMAT   TO TRUE
638100        PERFORM P8997-TIMEEDIT
638200        IF TE-INVALID-TIME
638300           MOVE SPACES TO WS-WRR-START-DTTM
638400        END-IF
638500     END-IF
638600     .
638700*
638800 P1132D-COMP-8DAYS-AGO.
638900*
639000* COMPUTE THE DATE 8 DAYS AGO FROM CURRENT ON-DUTY TIME
639100     MOVE ZEROS                 TO DATE-CONVERSION-PARMS
639200     SET PARM-SUBTRACT          TO TRUE
639300     MOVE WS-EMP-EFF-DATE       TO PARM-PRI-DATE-GREG
639400     MOVE WS-EMP-EFF-TIME       TO PARM-PRI-HRMN
639500     MOVE 000008                TO PARM-SEC-GREG-DAY
639600     EXEC CICS LINK
639700               PROGRAM(P903-PGM)
639800               COMMAREA(DATE-CONVERSION-PARMS)
639900               LENGTH(P903-LGTH)
640000               RESP(WS-RESPONSE)
640100     END-EXEC
640200     MOVE WS-RESPONSE           TO FILE-STATUS
640300     IF NOT SUCCESS
640400        MOVE 'P1132D-1'         TO ERR-PARAGRAPH
640500        MOVE 'P903LINK'         TO ERR-KEY
640600        PERFORM P9999-GOT-PROBLEM
640700     END-IF
640800     MOVE PARM-RES-DATE-GREG    TO WS-8DAYS-AGO-DATE
640900     MOVE PARM-RES-HRMN         TO WS-8DAYS-AGO-TIME
641000     .
641100*RJA  5/17/2023 E
641200*
641300 P1133-PRV-HOS-AFTER-7DY-START.
641400*
641500     MOVE SPACES                     TO WS-EMP-TOD
641600     MOVE MSTR3-EMP-NBR              TO EMPTOD-EMP-NBR
641700     MOVE WS-7DAY-START-DATE         TO DE-YYMMDD
641800     SET DE-YYMMDD-FORMAT            TO TRUE
641900     PERFORM P8998-DATEEDIT
642000     MOVE DE-CCYYMMDD                TO EMPTOD-OD-DATE-CENT
642100     MOVE WS-7DAY-START-TIME         TO EMPTOD-OD-TIME
642200     MOVE EMPTOD-KEY-AREA            TO EMPTOD-EMPKEY
642300
642400     PERFORM P8060-EMPTOD-STARTBR
642500     MOVE 'N'                        TO WS-READ-DONE-CODE
642600     MOVE '0000000000'               TO WS-7DAY-START-DTTM
642700     PERFORM UNTIL READ-DONE
642800        PERFORM P8070-EMPTOD-READNEXT
642900        IF SUCCESS
643000           IF EMPTOD-EMP-NBR = MSTR3-EMP-NBR
643100              AND WS-EMP-EFF-DATE-TIME > EMPTOD-OD-YYMMDD-HRMN
643200              IF (NOT EMPTOD-VIRTUAL-ENTRY) AND
643300*
643400                 (NOT EMPTOD-IMPOSED-REST-REC)
643500*             EMPTOD-IMPOSED-REST-REC IS UNLIKELY TO BE FOUND WITH
643600*             NEW CAN WRR, ADDING THIS AS A SANITY CHECK
643700                 IF EMPTOD-RESET-BREAK-REC
643800                    MOVE '0000000000'   TO WS-7DAY-START-DTTM
643900                 END-IF
644000                 IF EMPTOD-CONTACT AND
644100                    WS-7DAY-START-DTTM > '0000000000'
644200                    IF ((EMPTOD-OD-YYMMDD-HRMN >=
644300                             WS-UPD-PROJ-UD1-FROM
644400                          AND EMPTOD-OD-YYMMDD-HRMN <=
644500                               WS-UPD-PROJ-UD1-TO)
644600                        OR
644700                        (EMPTOD-OD-YYMMDD-HRMN >=
644800                            WS-UPD-PROJ-UD2-FROM
644900                          AND EMPTOD-OD-YYMMDD-HRMN <=
645000                                  WS-UPD-PROJ-UD2-TO)
645100                        OR
645200                        (EMPTOD-OFFD-YYMMDD-HRMN >=
645300                            WS-UPD-PROJ-UD1-FROM
645400                          AND EMPTOD-OFFD-YYMMDD-HRMN <=
645500                                  WS-UPD-PROJ-UD1-TO)
645600                        OR
645700                        (EMPTOD-OFFD-YYMMDD-HRMN >=
645800                            WS-UPD-PROJ-UD2-FROM
645900                          AND EMPTOD-OFFD-YYMMDD-HRMN <=
646000                                  WS-UPD-PROJ-UD2-TO))
646100                       PERFORM P1136E-EXTEND-PROJ-RESET
646200                       MOVE EMPTOD-OFFD-YYMMDD-HRMN
646300                                   TO LAST-EMPTOD-OFFD-YYMMDD-HRMN
646400                    END-IF
646500                 END-IF
646600                 IF (NOT EMPTOD-CONTACT) AND
646700                    (NOT EMPTOD-RESET-BREAK-REC)
646800
646900                    IF WS-7DAY-START-DTTM NOT > '0000000000'
647000                    AND EMPTOD-OD-YYMMDD-HRMN <=
647100                                              WS-WRR-START-DTTM
647200                    AND EMPTOD-OFFD-YYMMDD-HRMN >
647300                                              WS-WRR-START-DTTM
647400                       MOVE WS-WRR-START-DTTM
647500                                   TO WS-7DAY-START-DTTM
647600                       PERFORM P1136-COMPUTE-PROJ-RESET
647700                       MOVE EMPTOD-OFFD-YYMMDD-HRMN
647800                                   TO LAST-EMPTOD-OFFD-YYMMDD-HRMN
647900                    END-IF
648000                    IF WS-7DAY-START-DTTM NOT > '0000000000'
648100                    AND EMPTOD-OD-YYMMDD-HRMN >=
648200                                              WS-WRR-START-DTTM
648300                       MOVE EMPTOD-OD-YYMMDD-HRMN
648400                                        TO WS-7DAY-START-DTTM
648500                       PERFORM P1136-COMPUTE-PROJ-RESET
648600                       MOVE EMPTOD-OFFD-YYMMDD-HRMN
648700                                TO LAST-EMPTOD-OFFD-YYMMDD-HRMN
648800                    END-IF
648900
649000                    IF WS-7DAY-START-DTTM     > '0000000000'
649100                    AND EMPTOD-OD-YYMMDD-HRMN >
649200                        WS-UPD-PROJ-DATE-TIME
649300                    AND (EMPTOD-HOS-CLAIM OR
649400                         EMPTOD-COMMUTE   OR
649500                         EMPTOD-MANUAL)
649600*                      TRAIN RELATED HOS SHOULD BE SKIPPED :
649700*                      WITH TRAINS, (ORDER - LEAD) SHOULD BE MORE
649800*                      THAN PROJECTED-RESET WHICH IS CHECKED AT
649900*                      THE TIME OF CALL; HERE, WE ONLY LOOK FOR
650000*                      RESETS BEFORE HOS-CLAIMS AND MANUAL/COMMUTE
650100*
650200                       SET NATURAL-RESET-BEFORE-CALL TO TRUE
650300*
650400                       MOVE EMPTOD-OD-YYMMDD-HRMN
650500                                        TO WS-7DAY-START-DTTM
650600                       PERFORM P1136-COMPUTE-PROJ-RESET
650700                       MOVE EMPTOD-OFFD-YYMMDD-HRMN
650800                                   TO LAST-EMPTOD-OFFD-YYMMDD-HRMN
650900                    END-IF
651000
651100                    IF WS-7DAY-START-DTTM     > '0000000000'
651200                    AND EMPTOD-OFFD-YYMMDD-HRMN >
651300                        LAST-EMPTOD-OFFD-YYMMDD-HRMN
651400*                      THERE CAN BE OVERLAPPING HOS, PROJ-RESET
651500*                      SHOULD BE COMPUTED W/ GREATEST OFFD READ
651600                       PERFORM P1136-COMPUTE-PROJ-RESET
651700                       MOVE EMPTOD-OFFD-YYMMDD-HRMN
651800                                   TO LAST-EMPTOD-OFFD-YYMMDD-HRMN
651900                    END-IF
652000                 END-IF
652100              END-IF
652200           ELSE
652300              SET READ-DONE          TO TRUE
652400           END-IF
652500        ELSE
652600           SET READ-DONE             TO TRUE
652700        END-IF
652800     END-PERFORM
652900     PERFORM P8090-EMPTOD-ENDBR
653000
653100     IF (WS-7DAY-START-DTTM NOT > '0000000000')
653200*       NO HOS RECORDS WERE FOUND;
653300        SET DONT-CHECK-RB-OR-7D      TO TRUE
653400     ELSE
653500*      ?WILL HAVE TO RETHINK THE IVR-NOTIFY-PROJECTED-RESET
653600*      ?EXTENSION PROCESS
653700        IF MSTR3-PROJ-RESET-BRK-CH > WS-UPD-PROJ-DATE-TIME
653800           MOVE MSTR3-PROJ-RESET-BRK-CH TO WS-UPD-PROJ-DATE-TIME
653900        END-IF
654000*
654100*CNLD-244-B #3 CNC0600
654200*       IF WS-ORDER-MINUS-LEAD-DTTM > WS-UPD-PROJ-DATE-TIME
654300*       AND WS-EMP-EFF-DATE-TIME    > WS-UPD-PROJ-DATE-TIME
654400        IF WS-OD-MINUS-LEAD-DTTM    > WS-UPD-PROJ-DATE-TIME
654500*CNLD-244-E
654600
654700*RJA  5/22/2023 B CNC0600
654800*       LOCAL TIME CHECK IS NOT REQUIRED FOR SHIFT-CALL REG OWNERS
654900
655000*CNLD-259 B CNC0600   **EMP CAN BE CALLED AFTER 2ND UDR**
655100*       AND ((WS-LOCAL-DATE-TIME      > WS-UPD-PROJ-DATE-TIME)
655200        AND ((WS-LOCAL-DATE-TIME      > WS-UPD-PROJ-UD2-TO)
655300*CNLD-259 E CNC0600
655400
655500*07/26/23 RJA B CNC0600 CNLD-269
655600**CNLD-250-DXC-B
655700*             OR ((EIBTRNID = P08S-TRAN  OR IGNORE-LEAD-TIME) AND
655800*                (NOT VACANCY-FILLED     OR BOOSTED-EMPL-YES  )))
655900**CNLD-250-DXC-E
656000              OR ((EIBTRNID = P08S-TRAN  OR IGNORE-LEAD-TIME) AND
656100                  ((NOT VACANCY-FILLED) OR
656200                   PROMOTING-EMP-IGNORE-LD-TM)))
656300*07/26/23 RJA E
656400
656500*RJA  5/22/2023 E CNC0600
656600
656700*RJA  5/17/2023 B CNC0600
656800*
656900*       NATURAL-RESET-AT-CALL CAN HAPPEN ONLY WHEN CALLED AT HOME
657000*
657100        AND (AT-HOME-TERM OR WS-OUTPOST-HOME)
657200*RJA  5/17/2023 E
657300*
657400           SET NATURAL-RESET-AT-CALL TO TRUE
657500*
657600           SET DONT-CHECK-RB-OR-7D   TO TRUE
657700        END-IF
657800     END-IF
657900     .
658000
658100*
658200 P1136-COMPUTE-PROJ-RESET.
658300*
658400     MOVE EMPTOD-OFFD-DATE        TO WS-DAY1-DATE
658500     MOVE EMPTOD-OFFD-TIME        TO WS-DAY1-TIME
658600
658700     MOVE ZEROS                   TO DATE-CONVERSION-PARMS
658800     SET PARM-ADD                 TO TRUE
658900     MOVE WS-DAY1-DATE            TO PARM-PRI-DATE-GREG
659000     MOVE 01                      TO PARM-SEC-GREG-DAY
659100     EXEC CICS LINK
659200               PROGRAM(P903-PGM)
659300               COMMAREA(DATE-CONVERSION-PARMS)
659400               LENGTH(P903-LGTH)
659500               RESP(WS-RESPONSE)
659600     END-EXEC
659700     MOVE WS-RESPONSE             TO FILE-STATUS
659800     IF NOT SUCCESS
659900        MOVE 'P1136-1'            TO ERR-PARAGRAPH
660000        MOVE 'P903LINK'           TO ERR-KEY
660100        PERFORM P9999-GOT-PROBLEM
660200     END-IF
660300     MOVE PARM-RES-DATE-GREG      TO WS-DAY2-DATE
660400
660500     MOVE ZEROS                   TO DATE-CONVERSION-PARMS
660600     SET PARM-ADD                 TO TRUE
660700     MOVE WS-DAY1-DATE            TO PARM-PRI-DATE-GREG
660800     MOVE 02                      TO PARM-SEC-GREG-DAY
660900     EXEC CICS LINK
661000               PROGRAM(P903-PGM)
661100               COMMAREA(DATE-CONVERSION-PARMS)
661200               LENGTH(P903-LGTH)
661300               RESP(WS-RESPONSE)
661400     END-EXEC
661500     MOVE WS-RESPONSE             TO FILE-STATUS
661600     IF NOT SUCCESS
661700        MOVE 'P1136-2'            TO ERR-PARAGRAPH
661800        MOVE 'P903LINK'           TO ERR-KEY
661900        PERFORM P9999-GOT-PROBLEM
662000     END-IF
662100     MOVE PARM-RES-DATE-GREG      TO WS-DAY3-DATE
662200
662300     IF WS-DAY1-TIME >= 2200 AND WS-DAY1-TIME <= 2359
662400        MOVE ZEROS                TO DATE-CONVERSION-PARMS
662500        SET PARM-ADD              TO TRUE
662600        MOVE WS-DAY1-DATE         TO PARM-PRI-DATE-GREG
662700        MOVE WS-DAY1-TIME         TO PARM-PRI-HRMN
015310*CNLD-304 B
111600*       MOVE 3200                 TO PARM-SEC-HRMN
111600        MOVE 3159                 TO PARM-SEC-HRMN
015310*CNLD-304 E
662900        EXEC CICS LINK
663000                  PROGRAM(P903-PGM)
663100                  COMMAREA(DATE-CONVERSION-PARMS)
663200                  LENGTH(P903-LGTH)
663300                  RESP(WS-RESPONSE)
663400        END-EXEC
663500        MOVE WS-RESPONSE          TO FILE-STATUS
663600        IF NOT SUCCESS
663700           MOVE 'P1136-3'         TO ERR-PARAGRAPH
663800           MOVE 'P903LINK'        TO ERR-KEY
663900           PERFORM P9999-GOT-PROBLEM
664000        END-IF
664100        MOVE PARM-RES-DATE-GREG   TO WS-UPD-PROJ-DATE
664200        MOVE PARM-RES-HRMN        TO WS-UPD-PROJ-TIME
664300        MOVE WS-DAY1-DATE-TIME    TO WS-UPD-PROJ-UD1-FROM
664400        MOVE WS-DAY2-DATE         TO WS-UPD-PROJ-UD1-TO(1:6)
664500        MOVE '0800'               TO WS-UPD-PROJ-UD1-TO(7:4)
664600        MOVE WS-DAY2-DATE         TO WS-UPD-PROJ-UD2-FROM(1:6)
664700        MOVE '2200'               TO WS-UPD-PROJ-UD2-FROM(7:4)
664800        MOVE WS-DAY3-DATE         TO WS-UPD-PROJ-UD2-TO(1:6)
664900        MOVE '0559'               TO WS-UPD-PROJ-UD2-TO(7:4)
665000     ELSE
665100        IF WS-DAY1-TIME = 0000
665200           MOVE WS-DAY2-DATE      TO WS-UPD-PROJ-DATE
665300*CNLD-259 B CNC0600
665400*          RESET DURATION WILL BE LESS THAN THE REQUIRED MINIMUM
665500*          OF 32 HOURS IN THIS CASE; WILL BE 31H 59M.
665600*          MOVE '0800'            TO WS-UPD-PROJ-TIME
665700           MOVE '0759'            TO WS-UPD-PROJ-TIME
665800*CNLD-259 E CNC0600
665900           MOVE WS-DAY1-DATE      TO WS-UPD-PROJ-UD1-FROM(1:6)
666000                                    WS-UPD-PROJ-UD1-TO(1:6)
666100                                    WS-UPD-PROJ-UD2-FROM(1:6)
666200           MOVE '0000'            TO WS-UPD-PROJ-UD1-FROM(7:4)
666300           MOVE '0800'            TO WS-UPD-PROJ-UD1-TO(7:4)
666400           MOVE '2200'            TO WS-UPD-PROJ-UD2-FROM(7:4)
666500           MOVE WS-DAY2-DATE      TO WS-UPD-PROJ-UD2-TO(1:6)
666600           MOVE '0559'            TO WS-UPD-PROJ-UD2-TO(7:4)
666700        ELSE
666800           MOVE WS-DAY3-DATE      TO WS-UPD-PROJ-DATE
666900           MOVE '0559'            TO WS-UPD-PROJ-TIME
667000           MOVE WS-DAY1-DATE      TO WS-UPD-PROJ-UD1-FROM(1:6)
667100           MOVE '2200'            TO WS-UPD-PROJ-UD1-FROM(7:4)
667200           MOVE WS-DAY2-DATE      TO WS-UPD-PROJ-UD1-TO(1:6)
667300           MOVE '0800'            TO WS-UPD-PROJ-UD1-TO(7:4)
667400           MOVE WS-DAY2-DATE      TO WS-UPD-PROJ-UD2-FROM(1:6)
667500           MOVE '2200'            TO WS-UPD-PROJ-UD2-FROM(7:4)
667600           MOVE WS-DAY3-DATE      TO WS-UPD-PROJ-UD2-TO(1:6)
667700           MOVE '0559'            TO WS-UPD-PROJ-UD2-TO(7:4)
667800        END-IF
667900     END-IF
668000     .
668100
668200*
668300 P1136E-EXTEND-PROJ-RESET.
668400*
668500        MOVE ZEROS                   TO DATE-CONVERSION-PARMS
668600        SET PARM-ADD                 TO TRUE
668700        MOVE WS-UPD-PROJ-DATE        TO PARM-PRI-DATE-GREG
668800        MOVE 01                      TO PARM-SEC-GREG-DAY
668900        EXEC CICS LINK
669000                  PROGRAM(P903-PGM)
669100                  COMMAREA(DATE-CONVERSION-PARMS)
669200                  LENGTH(P903-LGTH)
669300                  RESP(WS-RESPONSE)
669400        END-EXEC
669500        MOVE WS-RESPONSE             TO FILE-STATUS
669600        IF NOT SUCCESS
669700           MOVE 'P1136-1'            TO ERR-PARAGRAPH
669800           MOVE 'P903LINK'           TO ERR-KEY
669900           PERFORM P9999-GOT-PROBLEM
670000        END-IF
670100        MOVE PARM-RES-DATE-GREG      TO WS-UPD-PROJ-DATE
670200        MOVE '0559'                  TO WS-UPD-PROJ-TIME
670300     .
670400*
670500 P1140-CALCULATE-7DAY-END.
670600*
670700     MOVE ZEROS                    TO DATE-CONVERSION-PARMS
670800     SET PARM-ADD                  TO TRUE
670900     MOVE WS-7DAY-START-DATE       TO PARM-PRI-DATE-GREG
671000     MOVE WS-7DAY-START-TIME       TO PARM-PRI-HRMN
671100     MOVE 000006                   TO PARM-SEC-GREG-DAY
671200     MOVE 2359                     TO PARM-SEC-HRMN
671300     EXEC CICS LINK
671400               PROGRAM(P903-PGM)
671500               COMMAREA(DATE-CONVERSION-PARMS)
671600               LENGTH(P903-LGTH)
671700               RESP(WS-RESPONSE)
671800     END-EXEC
671900     MOVE WS-RESPONSE              TO FILE-STATUS
672000     IF NOT SUCCESS
672100        MOVE 'P1140-1'             TO ERR-PARAGRAPH
672200        MOVE 'P903LINK'            TO ERR-KEY
672300        PERFORM P9999-GOT-PROBLEM
672400     END-IF
672500     MOVE PARM-RES-DATE-GREG       TO WS-WRR-7DAY-END-DATE
672600     MOVE PARM-RES-HRMN            TO WS-WRR-7DAY-END-TIME
672700     .
672800*
672900 P1140A-CALCULATE-7DAY-START.
673000*
673100     MOVE ZEROS                    TO DATE-CONVERSION-PARMS
673200     SET PARM-SUBTRACT             TO TRUE
673300     MOVE MSTR3-7DAY-END-DATE      TO PARM-PRI-DATE-GREG
673400     MOVE MSTR3-7DAY-END-TIME      TO PARM-PRI-HRMN
673500     MOVE 000006                   TO PARM-SEC-GREG-DAY
673600     MOVE 2359                     TO PARM-SEC-HRMN
673700     EXEC CICS LINK
673800               PROGRAM(P903-PGM)
673900               COMMAREA(DATE-CONVERSION-PARMS)
674000               LENGTH(P903-LGTH)
674100               RESP(WS-RESPONSE)
674200     END-EXEC
674300     MOVE WS-RESPONSE              TO FILE-STATUS
674400     IF NOT SUCCESS
674500        MOVE 'P1140A-1'            TO ERR-PARAGRAPH
674600        MOVE 'P903LINK'            TO ERR-KEY
674700        PERFORM P9999-GOT-PROBLEM
674800     END-IF
674900     MOVE PARM-RES-DATE-GREG       TO WS-7DAY-START-DATE
675000     MOVE PARM-RES-HRMN            TO WS-7DAY-START-TIME
675100     .
675200* CNLD-214 E
675300*CNC0600-B
675400*
675500 P6185-CHECK-LOCAL-UNDISTURBED.
675600*
675700        EXEC CICS ASKTIME
675800                  ABSTIME(WS-ABSTIME)
675900        END-EXEC
676000        ADD WS-ABSTIME-OFFSET  TO WS-ABSTIME
676100        EXEC CICS FORMATTIME
676200                  ABSTIME(WS-ABSTIME)
676300                  YYYYMMDD(WS-SYSTEM-DATE-CENT)
676400                  TIME(WS-SYSTEM-TIME-AREA)
676500        END-EXEC
676600*
676700*       CONVERT SYSTEM DATE/TIME TO LOCAL DATE/TIME
676800*
676900        MOVE ZEROS                      TO TZ-PARAMETERS
677000        MOVE SPACES                     TO TZ-STATUS-FLAG
677100        MOVE TZ-SYSTEM-TIME-ZONE        TO TZ-IN-ZONE
677200        MOVE WS-EMP-TIME-ZONE           TO TZ-OUT-ZONE
677300        MOVE WS-SYSTEM-DATE-TIME        TO TZ-IN-DATE-TIME
677400        PERFORM P8996-TIMEZONE
677500        MOVE TZ-OUT-DATE-TIME-CENT      TO WS-LOCAL-DATE-TIME-CENT
677600
677700        IF (WS-LOCAL-DATE-TIME >= MSTR3-SYSTEM-UD1-FROM-NUM
677800          AND WS-LOCAL-DATE-TIME <= MSTR3-SYSTEM-UD1-TO-NUM)
677900          OR (WS-LOCAL-DATE-TIME >= MSTR3-SYSTEM-UD2-FROM-NUM
678000          AND WS-LOCAL-DATE-TIME <= MSTR3-SYSTEM-UD2-TO-NUM)
678100          OR (EMP-MTOD-NUM > WS-LOCAL-DATE-TIME)
678200
678300*CNLD-251-B CNC0600
678400*       IGNORE-LEAD-TIME IS TRUE FOR 'SHOW JOBS' WHERE CALLER
678500*       DOESN'T ACTUALLY CALL THE OWNER; OWNER SHOWS UP FOR JOB.
678600           IF NOT (IGNORE-LEAD-TIME
678700*07/26/23 RJA B CNC0600 CNLD-269
678800*                  AND (NOT VACANCY-FILLED OR BOOSTED-EMPL-YES))
678900                   AND ((NOT VACANCY-FILLED) OR
679000                        PROMOTING-EMP-IGNORE-LD-TM))
679100*07/26/23 RJA E
679200*CNLD-251-E
679300              SET P925-MTOD-GT-LOCAL    TO TRUE
679400*CNLD-251-B
679500           END-IF
679600*CNLD-251-E
679700        END-IF
679800*
679900     .
680000*CNC0600-E
680100*
680200*CNLD-207-DXC-B
680300*
680400*CNLD-244-B #3 CNC0600
680500*P6196-ORD-MINUS-LEAD-AND-LOCAL.
680600 P6196-OD-MINUS-LEAD-AND-LOCAL.
680700*CNLD-244-E
680800*
680900
681000     EXEC CICS ASKTIME
681100               ABSTIME(WS-ABSTIME)
681200     END-EXEC
681300     ADD WS-ABSTIME-OFFSET  TO WS-ABSTIME
681400     EXEC CICS FORMATTIME
681500               ABSTIME(WS-ABSTIME)
681600               YYYYMMDD(WS-SYSTEM-DATE-CENT)
681700               TIME(WS-SYSTEM-TIME-AREA)
681800     END-EXEC
681900*
682000*    CONVERT SYSTEM DATE/TIME TO LOCAL DATE/TIME
682100*
682200     MOVE ZEROS                      TO TZ-PARAMETERS
682300     MOVE SPACES                     TO TZ-STATUS-FLAG
682400     MOVE TZ-SYSTEM-TIME-ZONE        TO TZ-IN-ZONE
682500     MOVE WS-EMP-TIME-ZONE           TO TZ-OUT-ZONE
682600     MOVE WS-SYSTEM-DATE-TIME        TO TZ-IN-DATE-TIME
682700     PERFORM P8996-TIMEZONE
682800     MOVE TZ-OUT-DATE-TIME-CENT      TO WS-LOCAL-DATE-TIME-CENT
682900*
683000     MOVE ZEROS                      TO DATE-CONVERSION-PARMS
683100     SET PARM-SUBTRACT               TO TRUE
683200*CNLD-244-B #3 CNC0600
683300*    MOVE P925-ORDER-DATE            TO PARM-PRI-DATE-GREG
683400*    MOVE P925-ORDER-TIME            TO PARM-PRI-HRMN
683500     MOVE P925-OD-DATE               TO PARM-PRI-DATE-GREG
683600     MOVE P925-OD-TIME               TO PARM-PRI-HRMN
683700*CNLD-244-E
683800*CNLD-251-B CNC0600
683900*    MOVE WS-LEAD-TIME               TO PARM-SEC-HRMN
684000     MOVE P925-CAN-WRR-LEAD-TIME     TO PARM-SEC-HRMN
684100*CNLD-251-E
684200     EXEC CICS LINK
684300               PROGRAM(P903-PGM)
684400               COMMAREA(DATE-CONVERSION-PARMS)
684500               LENGTH(P903-LGTH)
684600               RESP(WS-RESPONSE)
684700     END-EXEC
684800     MOVE WS-RESPONSE                TO FILE-STATUS
684900     IF NOT SUCCESS
685000        MOVE 'P6196-1'               TO ERR-PARAGRAPH
685100        PERFORM P9999-GOT-PROBLEM
685200     END-IF
685300*CNLD-244-B #3 CNC0600
685400*    MOVE PARM-RES-DATE-GREG         TO WS-ORDER-MINUS-LEAD-DT
685500*    MOVE PARM-RES-HRMN              TO WS-ORDER-MINUS-LEAD-TM
685600     MOVE PARM-RES-DATE-GREG         TO WS-OD-MINUS-LEAD-DT
685700     MOVE PARM-RES-HRMN              TO WS-OD-MINUS-LEAD-TM
685800*CNLD-244-E
685900     .
686000*
686100*CNLD-244-B #3 CNC0600
686200*P6197-CHK-TRN-ORD-RST-BRK-DIF.
686300 P6197-CHK-TIME-UNTIL-RESET-BRK.
686400*CNLD-244-E
686500*
686600     MOVE ZEROS                      TO DATE-CONVERSION-PARMS
686700     SET  PARM-DIFF                  TO TRUE
686800*CNLD-244-B #3 CNC0600
686900*    MOVE WS-ORDER-MINUS-LEAD-DT     TO PARM-PRI-DATE-GREG
687000*    MOVE WS-ORDER-MINUS-LEAD-TM     TO PARM-PRI-HRMN
687100     MOVE WS-OD-MINUS-LEAD-DT        TO PARM-PRI-DATE-GREG
687200     MOVE WS-OD-MINUS-LEAD-TM        TO PARM-PRI-HRMN
687300*CNLD-244-E
687400     MOVE WS-UPD-PROJ-DATE           TO PARM-SEC-DATE-GREG
687500     MOVE WS-UPD-PROJ-TIME           TO PARM-SEC-HRMN
687600     EXEC CICS LINK
687700               PROGRAM (P903-PGM)
687800               COMMAREA(DATE-CONVERSION-PARMS)
687900               LENGTH  (P903-LGTH)
688000               RESP    (WS-RESPONSE)
688100     END-EXEC
688200     MOVE WS-RESPONSE                TO FILE-STATUS
688300     IF NOT SUCCESS
688400        MOVE 'P6197-1'               TO ERR-PARAGRAPH
688500        PERFORM P9999-GOT-PROBLEM
688600     END-IF
688700*CNLD-244-B #3 CNC0600
688800*    IF PARM-RES-HRMN                <  0100
688900     IF PARM-RES-HRMN                <  0059
689000*CNLD-244-E
689100        AND PARM-RES-TOT-DAYS        = ZERO
689200*CNLD-244-B #3 CNC0600
689300*       NATURAL RESET HAPPENS WHEN WS-OD-MINUS-LEAD > WS-UPD-PROJ
689400        ADD 1 TO PARM-RES-MN
689500*CNLD-244-E
689600        SET EMP-RST-IN-HR-YES        TO TRUE
689700        MOVE PARM-RES-HRMN(3:2)      TO P925-RB-MSG-2-MN
689800     END-IF
689900     .
690000*CNLD-207-DXC-E
123800
123800*CNLD-302 B  COMMENTING
690100*=================================================================
690200*P6200-CALC-24-IMP-REST.
690300*=================================================================
690400*   WS-24-IMPOSED-REST = 2400
690500*   WS-IMPOSED-REST-START = 0400
690600*-----------------------------------------------------------------
690700*    MOVE ZEROS                    TO DATE-CONVERSION-PARMS
690800*    SET  PARM-ADD                 TO TRUE
690900*    MOVE P925-OFFD-DATE           TO PARM-PRI-DATE-GREG
691000*    MOVE P925-OFFD-TIME           TO PARM-PRI-HRMN
691100*    MOVE WS-24-IMPOSED-REST       TO PARM-SEC-HRMN
691200*    EXEC CICS LINK
691300*              PROGRAM (P903-PGM)
691400*              COMMAREA(DATE-CONVERSION-PARMS)
691500*              LENGTH  (P903-LGTH)
691600*              RESP    (WS-RESPONSE)
691700*    END-EXEC
691800*    MOVE WS-RESPONSE              TO FILE-STATUS
691900*    IF NOT SUCCESS
692000*       MOVE 'P6200-1'             TO ERR-PARAGRAPH
692100*       PERFORM P9999-GOT-PROBLEM
692200*    END-IF
692300*    MOVE PARM-RES-DATE-GREG       TO P925-MTOD-DATE
692400*    MOVE PARM-RES-HRMN            TO P925-MTOD-TIME
692500*
692600*    IF P925-EXTEND-REST
692700*       IF P925-MTOD-TIME > WS-IMPOSED-REST-START
692800*          MOVE ZEROS              TO DATE-CONVERSION-PARMS
692900*          SET PARM-ADD            TO TRUE
693000*          MOVE P925-MTOD-DATE     TO PARM-PRI-DATE-GREG
693100*          MOVE P925-MTOD-TIME     TO PARM-PRI-HRMN
693200*          MOVE WS-24-IMPOSED-REST TO PARM-SEC-HRMN
693300*          EXEC CICS LINK
693400*                    PROGRAM (P903-PGM)
693500*                    COMMAREA(DATE-CONVERSION-PARMS)
693600*                    LENGTH (P903-LGTH)
693700*                    RESP (WS-RESPONSE)
693800*          END-EXEC
693900*          MOVE WS-RESPONSE        TO FILE-STATUS
694000*          IF NOT SUCCESS
694100*             MOVE 'P6200-2'       TO ERR-PARAGRAPH
694200*             PERFORM P9999-GOT-PROBLEM
694300*          END-IF
694400*          MOVE PARM-RES-DATE-GREG TO P925-MTOD-DATE
694500*       END-IF
694600*       MOVE WS-IMPOSED-REST-START TO P925-MTOD-TIME
694700*    END-IF.
694700*
694700*CNLD-302 E
694700
694800*=================================================================
694900 P6400-CALC-ACTUAL-TIME.
695000*=================================================================
695100
695200*    READ THE HOURS OF SERVICE TABLE TO OBTAIN THE ADD
695300*    ARBITRARY TIME INDICATOR.  IT IS BASED ON THE DIST/SUB-DIST,
695400*    THE JOB TYPE (SERVICE), TERMINAL AND ROAD/YARD INDICATOR.
695500*    THE ADD ARB FLAG INDICATES IF PREP OR FINAL ARE ADDED TO THE
695600*    ON DUTY OR OFF DUTY TIMES USED TO CALCULATE THE TTOD.
695700
695800     MOVE ZERO                          TO HSVC-FOUND-CODE
695900     MOVE SPACE                         TO WS-ADD-ARB
696000     PERFORM P8100-GET-HSVC-CNTL-REC
696100     IF SUCCESS
696200        PERFORM P8120-GET-SERVICE-DATA
696300     END-IF
696400
696500*CNC0600 - RJA - B
696600     IF WS-CAN-WRR-NEW
696700        SET ADD-FINAL TO TRUE
696800*           ADD-FINAL ALSO SETS ADD-PREP
696900     END-IF
697000*CNC0600 - RJA - E
697100
697200     IF P925-TIE-UP-ROAD
697300        IF NOT P925-LOCAL-COMMUTER
697400           IF ADD-PREP
697500*CNC0600 - RJA - B
697600*             PERFORM P6420-CALC-ROAD-ONDUTY
697700              IF NOT WS-CAN-WRR-NEW
697800                 PERFORM P6420-CALC-ROAD-ONDUTY
697900              ELSE
698000                 PERFORM P6425-CALC-ROAD-ONDUTY
698100              END-IF
698200*CNC0600 - RJA - E
698300           END-IF
698400        END-IF
698500     END-IF
698600
698700     IF P925-TIE-UP-ROAD
698800        AND P925-LOCAL-COMMUTER
698900        PERFORM P6440-CALC-LOCAL-ACTUAL
699000     END-IF
699100
699200     IF P925-TIE-UP-YARD
699300*CNC0600 - RJA - B
699400*       PERFORM P6480-CALC-YARD-ACTUAL
699500        IF NOT WS-CAN-WRR-NEW
699600           PERFORM P6480-CALC-YARD-ACTUAL
699700        ELSE
699800           PERFORM P6485-CALC-YARD-ACTUAL
699900        END-IF
700000*CNC0600 - RJA - E
700100     END-IF.
700200*=================================================================
700300 P6420-CALC-ROAD-ONDUTY.
700400*=================================================================
700500     IF P925-ORDER-DATE-TIME > ZERO
700600      AND P925-OD-DATE-TIME  > ZERO
700700        MOVE ZEROS                    TO DATE-CONVERSION-PARMS
700800        SET PARM-DIFF                 TO TRUE
700900        MOVE P925-ORDER-DATE          TO PARM-PRI-DATE-GREG
701000        MOVE P925-ORDER-TIME          TO PARM-PRI-HRMN
701100        MOVE P925-OD-DATE             TO PARM-SEC-DATE-GREG
701200        MOVE P925-OD-TIME             TO PARM-SEC-HRMN
701300        EXEC CICS LINK
701400                  PROGRAM(P903-PGM)
701500                  COMMAREA(DATE-CONVERSION-PARMS)
701600                  LENGTH(P903-LGTH)
701700                  RESP(WS-RESPONSE)
701800        END-EXEC
701900        MOVE WS-RESPONSE              TO FILE-STATUS
702000        IF NOT SUCCESS
702100           MOVE 'P6420-1'             TO ERR-PARAGRAPH
702200           MOVE 'P903'                TO ERR-KEY
702300           PERFORM P9999-GOT-PROBLEM
702400        END-IF
702500        MULTIPLY PARM-RES-TOT-DAYS BY 24 GIVING WORK-HR
702600        ADD PARM-RES-HR               TO WORK-HR
702700        MOVE PARM-RES-MN              TO WORK-MN
702800*** 331E - USE ADJUSTED ONDUTY TIME IF > ORDERED TIME
702900***      - SET FLAG TO INDICATE THAT ADJ-OD WAS USED
703000        IF WORK-HR > ZERO
703100           OR WORK-MN > 15
703200           OR P925-OD-DATE-TIME > P925-ORDER-DATE-TIME
703300           SET P925-USED-ADJ-OD       TO TRUE
703400*          IF WS-ADJUST-ERT
703500*             MOVE P925-REST-STATUS-ERT TO WS-MINUTES
703600*             ADD WORK-HR             TO WS-MIN-HR
703700*             MOVE WS-MIN-MN          TO WS-TEMP-MN
703800*             ADD WORK-MN             TO WS-TEMP-MN
703900*             IF WS-TEMP-MN > 59
704000*                ADD 1                TO WS-MIN-HR
704100*                SUBTRACT 60        FROM WS-TEMP-MN
704200*             END-IF
704300*             MOVE WS-TEMP-MN         TO WS-MIN-MN
704400*             MOVE WS-MINUTES         TO P925-REST-STATUS-ERT
704500*          END-IF
704600        ELSE
704700           MOVE P925-ORDER-DATE-TIME     TO P925-OD-DATE-TIME
704800        END-IF
704900     END-IF.
705000*
705100*CNC0600 - RJA - B
705200*
705300*    IN P6420-CALC-ROAD-ONDUTY, THE ONLY SCENARIO WHEN
705400*    P925-OD-DATE-TIME IS OVERRIDDEN WITH A GREATER TIME IS -
705500*    WHEN P925-ORDER-DATE-TIME > P925-OD-DATE-TIME AND THEIR
705600*    DIFFERENCE IS LESS THAN 15 MINUTES.
705700*
705800*    IN P6425-CALC-ROAD-ONDUTY,
705900*    P925-OD-DATE-TIME IS NEVER OVERRIDDEN WITH A GREATER TIME.
706000*
706100*=================================================================
706200 P6425-CALC-ROAD-ONDUTY.
706300*=================================================================
706400     IF P925-ORDER-DATE-TIME > ZERO
706500      AND P925-OD-DATE-TIME  > ZERO
706600      AND P925-ORDER-DATE-TIME NOT = P925-OD-DATE-TIME
706700        SET P925-USED-ADJ-OD       TO TRUE
706800     END-IF.
706900*CNC0600 - RJA - E
707000*
707100*=================================================================
707200 P6440-CALC-LOCAL-ACTUAL.
707300*=================================================================
707400
707500*    READ THE CREW PROFILE TO OBTAIN THE DEPARTURE AND ARRIVAL
707600*    OFFSETS.
707700
707800     MOVE SPACES                        TO WS-TRCN-FILE
707900     MOVE P925-TRCNKEY1                 TO TRCNKEY1
708000     EXEC CICS READ
708100               DATASET(TRAIN-CN-VIA-TRCNKEY1)
708200               INTO(WS-TRCN-FILE)
708300               LENGTH(TRAINCN-RLGTH)
708400               RIDFLD(TRCNKEY1)
708500               KEYLENGTH(TRAINCN-KLGTH)
708600               RESP(WS-RESPONSE)
708700     END-EXEC
708800     MOVE WS-RESPONSE                   TO FILE-STATUS
708900
709000*    IF THE DEPARTURE OR ARRIVAL OFFSETS ARE POPULATED THEN
709100*    ADJUST THE ON DUTY OR OFF DUTY TIME BASED ON THE OFFSETS
709200*    AND THE ADD ARB FLAG.
709300
709400     IF SUCCESS
709500        IF TRCN-DEP-OFFSET-TIME > SPACES
709600           OR TRCN-ARR-OFFSET-TIME > SPACES
709700*CNC0600 - RJA - B
709800*          PERFORM P6460-ADJUST-CREW-PROFILE
709900           IF NOT WS-CAN-WRR-NEW
710000              PERFORM P6460-ADJUST-CREW-PROFILE
710100           ELSE
710200              PERFORM P6465-ADJUST-CREW-PROFILE
710300           END-IF
710400*CNC0600 - RJA - E
710500        END-IF
710600     END-IF.
710700*=================================================================
710800 P6460-ADJUST-CREW-PROFILE.
710900*=================================================================
711000*    IF THE PREP TIME (OR DEPART. OFFSET, IF NO PREP TIME EXISTS)
711100*    IS LESS THAN 15 MINUTES, DON'T INCLUDE IT IN THE EMPLOYEE'S
711200*    HOS CALCULATIONS (MOVE THE ORDER TIME TO THE ON-DUTY TIME).
711300
711400     IF ADD-PREP
711500        IF P925-ORDER-DATE-TIME > ZERO
711600         AND P925-OD-DATE-TIME  > ZERO
711700         AND P925-ORDER-DATE-TIME NOT = P925-OD-DATE-TIME
711800           MOVE ZEROS                    TO DATE-CONVERSION-PARMS
711900           SET PARM-DIFF                 TO TRUE
712000           MOVE P925-ORDER-DATE          TO PARM-PRI-DATE-GREG
712100           MOVE P925-ORDER-TIME          TO PARM-PRI-HRMN
712200           MOVE P925-OD-DATE             TO PARM-SEC-DATE-GREG
712300           MOVE P925-OD-TIME             TO PARM-SEC-HRMN
712400           EXEC CICS LINK
712500                     PROGRAM(P903-PGM)
712600                     COMMAREA(DATE-CONVERSION-PARMS)
712700                     LENGTH(P903-LGTH)
712800                     RESP(WS-RESPONSE)
712900           END-EXEC
713000           MOVE WS-RESPONSE              TO FILE-STATUS
713100           IF NOT SUCCESS
713200              MOVE 'P6460-1'             TO ERR-PARAGRAPH
713300              MOVE 'P903'                TO ERR-KEY
713400              PERFORM P9999-GOT-PROBLEM
713500           END-IF
713600           MULTIPLY PARM-RES-TOT-DAYS BY 24 GIVING WORK-HR
713700           ADD PARM-RES-HR               TO WORK-HR
713800           MOVE PARM-RES-MN              TO WORK-MN
713900*** 331E - USE ADJUSTED ONDUTY TIME IF > ORDERED TIME
714000***      - SET FLAG TO INDICATE THAT ADJ-OD WAS USED
714100           IF WORK-HR > ZERO
714200              OR WORK-MN > 15
714300              OR P925-OD-DATE-TIME > P925-ORDER-DATE-TIME
714400              SET P925-USED-ADJ-OD       TO TRUE
714500*             IF WS-ADJUST-ERT
714600*                MOVE P925-REST-STATUS-ERT  TO WS-MINUTES
714700*                ADD WORK-HR             TO WS-MIN-HR
714800*                MOVE WS-MIN-MN          TO WS-TEMP-MN
714900*                ADD WORK-MN             TO WS-TEMP-MN
715000*                IF WS-TEMP-MN > 59
715100*                   ADD 1                TO WS-MIN-HR
715200*                   SUBTRACT 60        FROM WS-TEMP-MN
715300*                END-IF
715400*                MOVE WS-TEMP-MN         TO WS-MIN-MN
715500*                MOVE WS-MINUTES         TO P925-REST-STATUS-ERT
715600*             END-IF
715700           ELSE
715800              MOVE P925-ORDER-DATE-TIME  TO P925-OD-DATE-TIME
715900           END-IF
716000        ELSE
716100           IF TRCN-DEP-OFFSET-TIME <= SPACES
716200              OR (TRCN-DEP-OFFSET-HR <= ZERO
716300              AND TRCN-DEP-OFFSET-MN <= '15')
716400              CONTINUE
716500           ELSE
716600              MOVE ZERO                  TO WS-OFFSET-HR-1
716700              MOVE TRCN-DEP-OFFSET-HR    TO WS-OFFSET-HR-2
716800              MOVE TRCN-DEP-OFFSET-MN    TO WS-OFFSET-MN
716900
717000              MOVE ZEROS                 TO DATE-CONVERSION-PARMS
717100              SET PARM-SUBTRACT          TO TRUE
717200              MOVE P925-OD-DATE          TO PARM-PRI-DATE-GREG
717300              MOVE P925-OD-TIME          TO PARM-PRI-TIME
717400              MOVE WS-OFFSET-HR-NUM      TO PARM-SEC-HR
717500              MOVE WS-OFFSET-MN          TO PARM-SEC-MN
717600              EXEC CICS LINK
717700                        PROGRAM(P903-PGM)
717800                        COMMAREA(DATE-CONVERSION-PARMS)
717900                        LENGTH(P903-LGTH)
718000                        RESP(WS-RESPONSE)
718100              END-EXEC
718200              MOVE WS-RESPONSE           TO FILE-STATUS
718300              IF NOT SUCCESS
718400                 MOVE 'P6460-2'          TO ERR-PARAGRAPH
718500                 MOVE 'P903'             TO ERR-KEY
718600                 PERFORM P9999-GOT-PROBLEM
718700              END-IF
718800              MOVE PARM-RES-DATE-GREG    TO P925-OD-DATE
718900              MOVE PARM-RES-HRMN         TO P925-OD-TIME
719000           END-IF
719100        END-IF
719200     END-IF
719300
719400*    ADD THE FINAL IF THE ADD ARB FLAG IS Y.
719500
719600     IF ADD-FINAL
719700        IF P925-OFFD-DATE-TIME > SPACES
719800           OR WS-ADJUST-ERT
719900           MOVE ZERO                       TO WS-OFFSET-MN
720000           IF TRCN-ARR-OFFSET-TIME > SPACES
720100              IF TRCN-ARR-OFFSET-HR > '0'
720200                 OR TRCN-ARR-OFFSET-MN >= '15'
720300                 MOVE 15                   TO WS-OFFSET-MN
720400              ELSE
720500                 IF TRCN-ARR-OFFSET-MN > ZERO
720600                    AND TRCN-ARR-OFFSET-MN IS NUMERIC
720700                    MOVE TRCN-ARR-OFFSET-MN TO WS-OFFSET-MN
720800                 END-IF
720900              END-IF
721000
721100              IF WS-ADJUST-ERT
721200                 MOVE P925-REST-STATUS-ERT TO WS-MINUTES
721300                 MOVE WS-MIN-MN            TO WS-TEMP-MN
721400                 MOVE ZEROES               TO CALC-MNS
721500                 MOVE TRCN-ARR-OFFSET-MN   TO WORK-TIME1(4:2)
721600                 MOVE WORK-TIME1-MN        TO CALC-MNS
721700                 ADD CALC-MNS              TO WS-TEMP-MN
721800                 IF WS-TEMP-MN > 59
721900                    ADD 1                  TO WS-MIN-HR
722000                    SUBTRACT 60          FROM WS-TEMP-MN
722100                 END-IF
722200                 MOVE WS-TEMP-MN           TO WS-MIN-MN
722300                 MOVE WS-MINUTES           TO P925-REST-STATUS-ERT
722400              ELSE
722500                 MOVE ZEROS             TO DATE-CONVERSION-PARMS
722600                 SET PARM-ADD           TO TRUE
722700                 MOVE P925-OFFD-DATE    TO PARM-PRI-DATE-GREG
722800                 MOVE P925-OFFD-TIME    TO PARM-PRI-TIME
722900                 MOVE WS-OFFSET-MN      TO PARM-SEC-MN
723000                 EXEC CICS LINK
723100                           PROGRAM(P903-PGM)
723200                           COMMAREA(DATE-CONVERSION-PARMS)
723300                           LENGTH(P903-LGTH)
723400                           RESP(WS-RESPONSE)
723500                 END-EXEC
723600                 MOVE WS-RESPONSE     TO FILE-STATUS
723700                 IF NOT SUCCESS
723800                    MOVE 'P6460-3'    TO ERR-PARAGRAPH
723900                    MOVE 'P903'       TO ERR-KEY
724000                    PERFORM P9999-GOT-PROBLEM
724100                 END-IF
724200                 MOVE PARM-RES-DATE-GREG TO P925-OFFD-DATE
724300                 MOVE PARM-RES-HRMN   TO P925-OFFD-TIME
724400              END-IF
724500           END-IF
724600        END-IF
724700     END-IF.
724800*
724900*CNC0600 - RJA - B
725000*=================================================================
725100 P6465-ADJUST-CREW-PROFILE.
725200*=================================================================
725300*
725400*  ->ORIGINAL CNC0600 SPEC:
725500*       THE CALCULATED PREP TIME (ON-DUTY TO ORDER TIME) OR STATIC
725600*       PREP TIME OFF OF TRCN {IF NO CALCULATED PREP EXISTS}
725700*       IS INCLUDED.
725800*  ->CHANGED ON 04/21/23:
725900*       DISREGARD PREP TIME OF TRCN
726000*
726100     IF ADD-PREP
726200        IF P925-ORDER-DATE-TIME > ZERO
726300         AND P925-OD-DATE-TIME  > ZERO
726400         AND P925-ORDER-DATE-TIME NOT = P925-OD-DATE-TIME
726500           SET P925-USED-ADJ-OD          TO TRUE
726600*CNC0600 - RJA - B    04/21/23 CHANGE
726700*       ELSE
726800*          IF TRCN-DEP-OFFSET-HR > ZERO OR
726900*             TRCN-DEP-OFFSET-MN > ZERO
727000*             MOVE ZERO                  TO WS-OFFSET-HR-NUM
727100*                                           WS-OFFSET-MN
727200*             IF TRCN-DEP-OFFSET-HR > ZERO
727300*                MOVE TRCN-DEP-OFFSET-HR TO WS-OFFSET-HR-NUM
727400*             END-IF
727500*             IF TRCN-DEP-OFFSET-MN > ZERO
727600*                MOVE TRCN-DEP-OFFSET-MN TO WS-OFFSET-MN
727700*             END-IF
727800*
727900*             MOVE ZEROS                 TO DATE-CONVERSION-PARMS
728000*             SET PARM-SUBTRACT          TO TRUE
728100*             MOVE P925-OD-DATE          TO PARM-PRI-DATE-GREG
728200*             MOVE P925-OD-TIME          TO PARM-PRI-TIME
728300*             MOVE WS-OFFSET-HR-NUM      TO PARM-SEC-HR
728400*             MOVE WS-OFFSET-MN          TO PARM-SEC-MN
728500*             EXEC CICS LINK
728600*                       PROGRAM(P903-PGM)
728700*                       COMMAREA(DATE-CONVERSION-PARMS)
728800*                       LENGTH(P903-LGTH)
728900*                       RESP(WS-RESPONSE)
729000*             END-EXEC
729100*             MOVE WS-RESPONSE           TO FILE-STATUS
729200*             IF NOT SUCCESS
729300*                MOVE 'P6465-1'          TO ERR-PARAGRAPH
729400*                MOVE 'P903'             TO ERR-KEY
729500*                PERFORM P9999-GOT-PROBLEM
729600*             END-IF
729700*             MOVE PARM-RES-DATE-GREG    TO P925-OD-DATE
729800*             MOVE PARM-RES-HRMN         TO P925-OD-TIME
729900*          END-IF
730000*CNC0600 - RJA - E    04/21/23 CHANGE
730100        END-IF
730200     END-IF
730300
730400*    ADD FINAL. ADD-FINAL WILL BE TRUE IF WS-CAN-WRR-NEW IS TRUE.
730500
730600*
730700*  ->ORIGINAL CNC0600 SPEC:
730800*       INCLUDE ALL PREP/FINAL TIME IN TIME-ON-DUTY
730900*  ->CHANGED ON 04/21/23:
731000*       DISREGARD FINAL TIME OF TRCN
731100*
731200*CNC0600 - NOTE: COMPARE THIS CODE WITH PRE-WRR CODE IN P6460
731300*
731400     IF ADD-FINAL
731500        IF P925-OFFD-DATE-TIME > SPACES
731600           OR WS-ADJUST-ERT
731700           MOVE ZERO                    TO WS-OFFSET-HR-NUM
731800                                           WS-OFFSET-MN
731900           IF TRCN-ARR-OFFSET-HR > ZERO
732000              MOVE TRCN-ARR-OFFSET-HR   TO WS-OFFSET-HR-NUM
732100           END-IF
732200           IF TRCN-ARR-OFFSET-MN > ZERO
732300              MOVE TRCN-ARR-OFFSET-MN   TO WS-OFFSET-MN
732400           END-IF
732500
732600           IF WS-ADJUST-ERT
732700              MOVE ZERO                 TO WORK-TIME1
732800              MOVE P925-REST-STATUS-ERT TO WORK-TIME1-4
732900
733000*CNC0600 - RJA - B    04/21/23 CHANGE (KEEP IN SYNC W/ P6460 LOGIC
733100*
733200*             ADD  WS-OFFSET-HR-NUM     TO WORK-TIME1-HR
733300*
733400*CNC0600 - RJA - E    04/21/23 CHANGE
733500
733600              MOVE WORK-TIME1-MN        TO WS-TEMP-MN
733700              ADD  WS-OFFSET-MN         TO WS-TEMP-MN
733800              IF WS-TEMP-MN > 59
733900                 ADD 1                  TO WORK-TIME1-HR
734000                 SUBTRACT 60          FROM WS-TEMP-MN
734100              END-IF
734200              MOVE WS-TEMP-MN           TO WORK-TIME1-MN
734300
734400              MOVE WORK-TIME1-4         TO P925-REST-STATUS-ERT
734500*CNC0600 - RJA - B    04/21/23 CHANGE
734600*          ELSE
734700*             MOVE ZEROS             TO DATE-CONVERSION-PARMS
734800*             SET PARM-ADD           TO TRUE
734900*             MOVE P925-OFFD-DATE    TO PARM-PRI-DATE-GREG
735000*             MOVE P925-OFFD-TIME    TO PARM-PRI-TIME
735100*             MOVE WS-OFFSET-HR-NUM  TO PARM-SEC-HR
735200*             MOVE WS-OFFSET-MN      TO PARM-SEC-MN
735300*             EXEC CICS LINK
735400*                       PROGRAM(P903-PGM)
735500*                       COMMAREA(DATE-CONVERSION-PARMS)
735600*                       LENGTH(P903-LGTH)
735700*                       RESP(WS-RESPONSE)
735800*             END-EXEC
735900*             MOVE WS-RESPONSE     TO FILE-STATUS
736000*             IF NOT SUCCESS
736100*                MOVE 'P6465-2'    TO ERR-PARAGRAPH
736200*                MOVE 'P903'       TO ERR-KEY
736300*                PERFORM P9999-GOT-PROBLEM
736400*             END-IF
736500*             MOVE PARM-RES-DATE-GREG TO P925-OFFD-DATE
736600*             MOVE PARM-RES-HRMN   TO P925-OFFD-TIME
736700*CNC0600 - RJA - E    04/21/23 CHANGE
736800           END-IF
736900        END-IF
737000     END-IF.
737100*CNC0600 - RJA - E
737200*
737300*=================================================================
737400 P6480-CALC-YARD-ACTUAL.
737500*=================================================================
737600*    RETRIEVE THE PREP AND FINAL TIMES FROM THE TIMEKEEPING
737700*    PROFILE.  IF THE ADD ARBITRARY INDICATES THAT THE TIMES
737800*    SHOULD INCLUDED THEN THEY MUST BE ADDED.
737900
738000     MOVE SPACES                         TO WS-TKCR-FILE
738100     MOVE SPACES                         TO P983-COMMAREA-PARMS
738200     SET P983-GET-TK-PROFILE-REC         TO TRUE
738300     SET DE-REFORMAT-ONLY                TO TRUE
738400     SET DE-YYMMDD-FORMAT                TO TRUE
738500     MOVE P925-OD-DATE                   TO DE-YYMMDD
738600     PERFORM P8998-DATEEDIT
738700     MOVE DE-CCYYMMDD                    TO P983-CEYRMODY
738800     MOVE P925-EMP-NO                    TO P983-TKPRO-EMP-NO
738900     MOVE P925-JOB-TYPE                  TO P983-TKPRO-JOB-TYPE
739000     MOVE P925-ASGN-CC                   TO P983-TKPRO-CRAFT
739100     SET P983-TKPRO-KEY-TRCN             TO TRUE
739200     MOVE P925-TRCNKEY1                  TO P983-TKPRO-TRCN-KEY
739300     SET P983-TKPRO-RETURN-REC           TO TRUE
739400     EXEC CICS LINK
739500               PROGRAM(P983-PGM)
739600               COMMAREA(P983-COMMAREA-PARMS)
739700               LENGTH(P983-LGTH)
739800               RESP(WS-RESPONSE)
739900     END-EXEC
740000     MOVE WS-RESPONSE                    TO FILE-STATUS
740100     IF NOT SUCCESS
740200        MOVE 'P6480-1'                   TO ERR-PARAGRAPH
740300        MOVE 'P983LINK'                  TO ERR-KEY
740400        PERFORM P9999-GOT-PROBLEM
740500     END-IF
740600     IF P983-OUTPUT-MSG-CODE NOT > SPACES
740700        MOVE P983-TKPRO-RECORD           TO WS-TKCR-FILE
740800     END-IF
740900*
741000*    IF THE CALCULATED PREP TIME (ON-DUTY TO ORDER TIME) OR STATIC
741100*    PREP TIME, OFF OF TK PROFILE, {IF NO CALCULATED PREP EXISTS}
741200*    IS LESS THAN 15 MINUTES, DON'T INCLUDE IT IN THE EMPLOYEE'S
741300*    HOS CALCULATIONS (MOVE THE ORDER TIME TO THE ON-DUTY TIME).
741400*
741500     IF ADD-PREP
741600        IF P925-ORDER-DATE-TIME > ZERO
741700         AND P925-OD-DATE-TIME  > ZERO
741800         AND P925-ORDER-DATE-TIME NOT = P925-OD-DATE-TIME
741900           MOVE ZEROS                    TO DATE-CONVERSION-PARMS
742000           SET PARM-DIFF                 TO TRUE
742100           MOVE P925-ORDER-DATE          TO PARM-PRI-DATE-GREG
742200           MOVE P925-ORDER-TIME          TO PARM-PRI-HRMN
742300           MOVE P925-OD-DATE             TO PARM-SEC-DATE-GREG
742400           MOVE P925-OD-TIME             TO PARM-SEC-HRMN
742500           EXEC CICS LINK
742600                     PROGRAM(P903-PGM)
742700                     COMMAREA(DATE-CONVERSION-PARMS)
742800                     LENGTH(P903-LGTH)
742900                     RESP(WS-RESPONSE)
743000           END-EXEC
743100           MOVE WS-RESPONSE              TO FILE-STATUS
743200           IF NOT SUCCESS
743300              MOVE 'P6480-2'             TO ERR-PARAGRAPH
743400              MOVE 'P903'                TO ERR-KEY
743500              PERFORM P9999-GOT-PROBLEM
743600           END-IF
743700           MULTIPLY PARM-RES-TOT-DAYS BY 24 GIVING WORK-HR
743800           ADD PARM-RES-HR               TO WORK-HR
743900           MOVE PARM-RES-MN              TO WORK-MN
744000*** 331E - USE ADJUSTED ONDUTY TIME IF > ORDERED TIME
744100***      - SET FLAG TO INDICATE THAT ADJ-OD WAS USED
744200           IF WORK-HR > ZERO
744300              OR WORK-MN > 15
744400              OR P925-OD-DATE-TIME > P925-ORDER-DATE-TIME
744500              SET P925-USED-ADJ-OD       TO TRUE
744600*             IF WS-ADJUST-ERT
744700*                MOVE P925-REST-STATUS-ERT  TO WS-MINUTES
744800*                ADD WORK-HR             TO WS-MIN-HR
744900*                MOVE WS-MIN-MN          TO WS-TEMP-MN
745000*                ADD WORK-MN             TO WS-TEMP-MN
745100*                IF WS-TEMP-MN > 59
745200*                   ADD 1                TO WS-MIN-HR
745300*                   SUBTRACT 60        FROM WS-TEMP-MN
745400*                END-IF
745500*                MOVE WS-TEMP-MN         TO WS-MIN-MN
745600*                MOVE WS-MINUTES         TO P925-REST-STATUS-ERT
745700*             END-IF
745800           ELSE
745900              MOVE P925-ORDER-DATE-TIME  TO P925-OD-DATE-TIME
746000           END-IF
746100        ELSE
746200           IF TKCR-TK-ED-PREP-TM <= SPACES
746300              OR TKCR-TK-ED-PREP-TM-NUM <= 15
746400              CONTINUE
746500           ELSE
746600              IF TKCR-TK-ED-PREP-TM IS NUMERIC
746700                 MOVE TKCR-TK-ED-PREP-TM TO WS-OFFSET-MN
746800
746900                 MOVE ZEROS              TO DATE-CONVERSION-PARMS
747000                 SET PARM-SUBTRACT       TO TRUE
747100                 MOVE P925-OD-DATE       TO PARM-PRI-DATE-GREG
747200                 MOVE P925-OD-TIME       TO PARM-PRI-TIME
747300                 MOVE WS-OFFSET-MN       TO PARM-SEC-MN
747400                 EXEC CICS LINK
747500                           PROGRAM(P903-PGM)
747600                           COMMAREA(DATE-CONVERSION-PARMS)
747700                           LENGTH(P903-LGTH)
747800                           RESP(WS-RESPONSE)
747900                 END-EXEC
748000                 MOVE WS-RESPONSE        TO FILE-STATUS
748100                 IF NOT SUCCESS
748200                    MOVE 'P6480-3'       TO ERR-PARAGRAPH
748300                    MOVE 'P903'          TO ERR-KEY
748400                    PERFORM P9999-GOT-PROBLEM
748500                 END-IF
748600                 MOVE PARM-RES-DATE-GREG TO P925-OD-DATE
748700                 MOVE PARM-RES-HRMN      TO P925-OD-TIME
748800              END-IF
748900           END-IF
749000        END-IF
749100     END-IF
749200
749300     IF ADD-FINAL
749400        IF P925-OFFD-DATE-TIME > SPACES
749500           OR WS-ADJUST-ERT
749600           MOVE ZERO                       TO WS-OFFSET-MN
749700           IF TKCR-TK-ED-INSP-TM > ZERO
749800              IF TKCR-TK-ED-INSP-TM-NUM > 15
749900                 MOVE 15                   TO WS-OFFSET-MN
750000              ELSE
750100                 MOVE TKCR-TK-ED-INSP-TM-NUM TO WS-OFFSET-MN
750200              END-IF
750300           END-IF
750400
750500           IF WS-ADJUST-ERT
750600              MOVE P925-REST-STATUS-ERT    TO WS-MINUTES
750700              MOVE WS-MIN-MN               TO WS-TEMP-MN
750800              ADD TKCR-TK-ED-INSP-TM-NUM   TO WS-TEMP-MN
750900              IF WS-TEMP-MN > 59
751000                 ADD 1                     TO WS-MIN-HR
751100                 SUBTRACT 60             FROM WS-TEMP-MN
751200              END-IF
751300              MOVE WS-TEMP-MN              TO WS-MIN-MN
751400              MOVE WS-MINUTES              TO P925-REST-STATUS-ERT
751500           ELSE
751600              MOVE ZEROS                TO DATE-CONVERSION-PARMS
751700              SET PARM-ADD              TO TRUE
751800              MOVE P925-OFFD-DATE       TO PARM-PRI-DATE-GREG
751900              MOVE P925-OFFD-TIME       TO PARM-PRI-TIME
752000              MOVE WS-OFFSET-MN         TO PARM-SEC-MN
752100              EXEC CICS LINK
752200                        PROGRAM(P903-PGM)
752300                        COMMAREA(DATE-CONVERSION-PARMS)
752400                        LENGTH(P903-LGTH)
752500                        RESP(WS-RESPONSE)
752600              END-EXEC
752700              MOVE WS-RESPONSE        TO FILE-STATUS
752800              IF NOT SUCCESS
752900                 MOVE 'P6480-4'       TO ERR-PARAGRAPH
753000                 MOVE 'P903'          TO ERR-KEY
753100                 PERFORM P9999-GOT-PROBLEM
753200              END-IF
753300              MOVE PARM-RES-DATE-GREG TO P925-OFFD-DATE
753400              MOVE PARM-RES-HRMN      TO P925-OFFD-TIME
753500           END-IF
753600        END-IF
753700     END-IF.
753800*
753900*CNC0600 - RJA - B
754000*=================================================================
754100 P6485-CALC-YARD-ACTUAL.
754200*=================================================================
754300
754400     MOVE SPACES                         TO WS-TKCR-FILE
754500     MOVE SPACES                         TO P983-COMMAREA-PARMS
754600     SET P983-GET-TK-PROFILE-REC         TO TRUE
754700     SET DE-REFORMAT-ONLY                TO TRUE
754800     SET DE-YYMMDD-FORMAT                TO TRUE
754900     MOVE P925-OD-DATE                   TO DE-YYMMDD
755000     PERFORM P8998-DATEEDIT
755100     MOVE DE-CCYYMMDD                    TO P983-CEYRMODY
755200     MOVE P925-EMP-NO                    TO P983-TKPRO-EMP-NO
755300     MOVE P925-JOB-TYPE                  TO P983-TKPRO-JOB-TYPE
755400     MOVE P925-ASGN-CC                   TO P983-TKPRO-CRAFT
755500     SET P983-TKPRO-KEY-TRCN             TO TRUE
755600     MOVE P925-TRCNKEY1                  TO P983-TKPRO-TRCN-KEY
755700     SET P983-TKPRO-RETURN-REC           TO TRUE
755800     EXEC CICS LINK
755900               PROGRAM(P983-PGM)
756000               COMMAREA(P983-COMMAREA-PARMS)
756100               LENGTH(P983-LGTH)
756200               RESP(WS-RESPONSE)
756300     END-EXEC
756400     MOVE WS-RESPONSE                    TO FILE-STATUS
756500     IF NOT SUCCESS
756600        MOVE 'P6485-1'                   TO ERR-PARAGRAPH
756700        MOVE 'P983LINK'                  TO ERR-KEY
756800        PERFORM P9999-GOT-PROBLEM
756900     END-IF
757000     IF P983-OUTPUT-MSG-CODE NOT > SPACES
757100        MOVE P983-TKPRO-RECORD           TO WS-TKCR-FILE
757200     END-IF
757300*
757400*  ->ORIGINAL CNC0600 SPEC:
757500*       THE CALCULATED PREP TIME (ON-DUTY TO ORDER TIME) OR STATIC
757600*       PREP TIME OFF OF TK PROFILE {IF NO CALCULATED PREP EXISTS}
757700*       IS INCLUDED.
757800*  ->CHANGED ON 04/21/23:
757900*       DISREGARD PREP TIME OF TK PROFILE
758000*
758100     IF ADD-PREP
758200        IF P925-ORDER-DATE-TIME > ZERO
758300         AND P925-OD-DATE-TIME  > ZERO
758400         AND P925-ORDER-DATE-TIME NOT = P925-OD-DATE-TIME
758500           SET P925-USED-ADJ-OD       TO TRUE
758600*CNC0600 - RJA - B    04/21/23 CHANGE
758700*       ELSE
758800*          IF TKCR-TK-ED-PREP-TM-NUM > ZERO
758900*             MOVE TKCR-TK-ED-PREP-TM TO WS-OFFSET-MN
759000*
759100*             MOVE ZEROS              TO DATE-CONVERSION-PARMS
759200*             SET PARM-SUBTRACT       TO TRUE
759300*             MOVE P925-OD-DATE       TO PARM-PRI-DATE-GREG
759400*             MOVE P925-OD-TIME       TO PARM-PRI-TIME
759500*             MOVE WS-OFFSET-MN       TO PARM-SEC-MN
759600*             EXEC CICS LINK
759700*                       PROGRAM(P903-PGM)
759800*                       COMMAREA(DATE-CONVERSION-PARMS)
759900*                       LENGTH(P903-LGTH)
760000*                       RESP(WS-RESPONSE)
760100*             END-EXEC
760200*             MOVE WS-RESPONSE        TO FILE-STATUS
760300*             IF NOT SUCCESS
760400*                MOVE 'P6485-2'       TO ERR-PARAGRAPH
760500*                MOVE 'P903'          TO ERR-KEY
760600*                PERFORM P9999-GOT-PROBLEM
760700*             END-IF
760800*             MOVE PARM-RES-DATE-GREG TO P925-OD-DATE
760900*             MOVE PARM-RES-HRMN      TO P925-OD-TIME
761000*          END-IF
761100*CNC0600 - RJA - E    04/21/23 CHANGE
761200        END-IF
761300     END-IF
761400
761500*
761600*  ->ORIGINAL CNC0600 SPEC:
761700*       INCLUDE ALL PREP/FINAL TIME IN TIME-ON-DUTY
761800*  ->CHANGED ON 04/21/23:
761900*       DISREGARD FINAL TIME OF TKCR
762000*
762100*CNC0600 - NOTE: COMPARE THIS CODE WITH PRE-WRR CODE IN P6480
762200     IF ADD-FINAL
762300        IF P925-OFFD-DATE-TIME > SPACES
762400           OR WS-ADJUST-ERT
762500           MOVE ZERO                  TO WS-OFFSET-MN
762600           IF TKCR-TK-ED-INSP-TM-NUM > ZERO
762700              MOVE TKCR-TK-ED-INSP-TM-NUM TO WS-OFFSET-MN
762800           END-IF
762900
763000           IF WS-ADJUST-ERT
763100              MOVE ZERO               TO WORK-TIME1
763200              MOVE P925-REST-STATUS-ERT TO WORK-TIME1-4
763300              MOVE WORK-TIME1-MN      TO WS-TEMP-MN
763400              ADD WS-OFFSET-MN        TO WS-TEMP-MN
763500              IF WS-TEMP-MN > 59
763600                 ADD 1                TO WORK-TIME1-HR
763700                 SUBTRACT 60        FROM WS-TEMP-MN
763800              END-IF
763900              MOVE WS-TEMP-MN         TO WORK-TIME1-MN
764000
764100              MOVE WORK-TIME1-4       TO P925-REST-STATUS-ERT
764200*CNC0600 - RJA - B    04/21/23 CHANGE
764300*          ELSE
764400*             MOVE ZEROS              TO DATE-CONVERSION-PARMS
764500*             SET PARM-ADD            TO TRUE
764600*             MOVE P925-OFFD-DATE     TO PARM-PRI-DATE-GREG
764700*             MOVE P925-OFFD-TIME     TO PARM-PRI-TIME
764800*             MOVE WS-OFFSET-MN       TO PARM-SEC-MN
764900*             EXEC CICS LINK
765000*                       PROGRAM(P903-PGM)
765100*                       COMMAREA(DATE-CONVERSION-PARMS)
765200*                       LENGTH(P903-LGTH)
765300*                       RESP(WS-RESPONSE)
765400*             END-EXEC
765500*             MOVE WS-RESPONSE        TO FILE-STATUS
765600*             IF NOT SUCCESS
765700*                MOVE 'P6485-3'       TO ERR-PARAGRAPH
765800*                MOVE 'P903'          TO ERR-KEY
765900*                PERFORM P9999-GOT-PROBLEM
766000*             END-IF
766100*             MOVE PARM-RES-DATE-GREG TO P925-OFFD-DATE
766200*             MOVE PARM-RES-HRMN      TO P925-OFFD-TIME
766300*CNC0600 - RJA - E    04/21/23 CHANGE
766400           END-IF
766500        END-IF
766600     END-IF.
766700*CNC0600 - RJA - E
766800*
766900*****************************************************************
767000 P6500-CHECK-FOR-DEADHEAD.
767100*****************************************************************
767200     SET NO-DEADHEAD-FOUND              TO TRUE
767300     MOVE SPACES                        TO WS-CNTL-FILE
767400     SET SUB-DIST-TYPE-REC              TO TRUE
767500     MOVE ASGN-DIST                     TO CNTL-DIST
767600     MOVE ASGN-SUB-DIST                 TO CNTL-SUB-DIST
767700     MOVE CNTLKEY-AREA                  TO CNTLKEY
767800     PERFORM P8030-READ-CNTL-FILE
767900     IF NOT SUCCESS
768000        MOVE 'P6500-1'                  TO ERR-PARAGRAPH
768100        MOVE CNTLKEY                    TO ERR-KEY
768200        PERFORM P9999-GOT-PROBLEM
768300     END-IF
768400*
768500*    CONVERT THE ASGN-DATE-TIME TO SYSTEM TIME.  WE'LL USE THE
768600*    RESULTS TO GO AFTER A DEADHEAD RECORD ON THE POINTER FILE.
768700*
768800     MOVE ASGN-DATE-TIME                TO TZ-IN-DATE-TIME
768900     MOVE CNTL-TIME-ZONE                TO TZ-IN-ZONE
769000     SET TZ-OUT-SYSTEM-ZONE             TO TRUE
769100     PERFORM P8996-TIMEZONE
769200     IF TZ-INVALID-PARAMETERS
769300        MOVE 'P6500-2'                  TO ERR-PARAGRAPH
769400        PERFORM P8996-TZERROR
769500     END-IF
769600
769700     MOVE TZ-OUT-DATE-CENT              TO WS-POINT-EFF-DATE
769800     MOVE TZ-OUT-TIME                   TO WS-POINT-EFF-TIME
769900*
770000*    LOOK FOR A DEADHEAD POINTER RECORD WITH THE SAME TIME AS THE
770100*    ASGN-DATE-TIME.  IF ONE EXISTS, IT INDICATES THE EMPLOYEE
770200*    IS ON AN OUTPOST ASSIGNMENT.  IF IT DOESN'T EXIST, IT
770300*    MEANS THE EMPLOYEE WAS ASSIGNED FUTHER NOTICE VIA THE
770400*    VACANCY FILL PROCESS, AND IS NOT ON AN OUTPOST.
770500*
770600     MOVE SPACES                        TO WS-POINTER
770700     MOVE ASGN-EMP-NO                   TO POINT-EMP-NBR
770800     SET POINT-ASGN-CHANGE              TO TRUE
770900     MOVE WS-POINT-EFF-DATE-TIME        TO POINT-EFF-CE-DATE-TIME
771000     MOVE ZEROES                        TO POINT-SEQ
771100     SET POINTER-NOT-DONE               TO TRUE
771200     PERFORM UNTIL POINTER-DONE
771300        MOVE POINT-NBR-KEY              TO POINTKEY
771400        EXEC CICS READ
771500                  GTEQ
771600                  DATASET(POINT-FILE-VIA-EMP)
771700                  INTO(WS-POINTER)
771800                  LENGTH(POINT-RLGTH)
771900                  RIDFLD(POINTKEY)
772000                  KEYLENGTH(POINT-KLGTH)
772100                  RESP(WS-RESPONSE)
772200        END-EXEC
772300        MOVE WS-RESPONSE                TO FILE-STATUS
772400        IF NOT SUCCESS
772500           IF NOT END-OF-FILE
772600              MOVE 'P6500-3'            TO ERR-PARAGRAPH
772700              MOVE POINTKEY             TO ERR-KEY
772800              PERFORM P9999-GOT-PROBLEM
772900           END-IF
773000           SET POINTER-DONE             TO TRUE
773100        ELSE
773200           IF POINT-EMP-NBR = ASGN-EMP-NO
773300              AND POINT-ASGN-CHANGE
773400              AND POINT-EFF-CE-DATE-TIME = WS-POINT-EFF-DATE-TIME
773500              IF POINT-DEADHEAD-FUN
773600                 SET DEADHEAD-FOUND     TO TRUE
773700                 SET POINTER-DONE       TO TRUE
773800              END-IF
773900           ELSE
774000              SET POINTER-DONE          TO TRUE
774100           END-IF
774200        END-IF
774300        IF POINTER-NOT-DONE
774400           ADD +1                       TO POINT-SEQ
774500        END-IF
774600     END-PERFORM
774700     .
774800******************************************************************
774900 P6550-IS-HOME-AN-OUTPOST.
775000******************************************************************
775100*
775200* WE KNOW WE HAVE EMPLOYEE INFORMATION
775300* GET ON-DUTY ASIGNMENT INFORMATION
775400     PERFORM P8220-GET-JOB-ON-DUTY
775500     INITIALIZE WS-HOME-IS-AN-OUTPOST-FL
775600     EVALUATE TRUE
775700        WHEN ASGN-UFP-JOB
775800* GET THE POOL INFORMATION FOR THAT JOB
775900           INITIALIZE            WS-CNTL-FILE
776000           SET  CREW-PROFILE-REC TO TRUE
776100           MOVE ASGN-DIST        TO CNTL-DIST
776200           MOVE ASGN-SUB-DIST    TO CNTL-SUB-DIST
776300           MOVE ASGN-UFP-POOL    TO CNTL-POOL-CODE
776400           MOVE 'F'              TO CNTL-POOL-TYPE
776500           PERFORM P8030-READ-CNTL-FILE
776600           IF CNTL-POOL-IS-OUTPOST
776700              SET WS-HOME-IS-AN-OUTPOST TO TRUE
776800           END-IF
776900        WHEN ASGN-AJ-JOB OF ASGN-JOB-TYPE
777000* GET THE TRAIN PROFILE INFORMATION FOR THAT JOB
777100           INITIALIZE            WS-TRCN-FILE
777200           MOVE ASGN-DIST        TO TRCN-DIST3
777300           MOVE ASGN-SUB-DIST    TO TRCN-SDIST3
777400           MOVE ASGN-AJ-JOB-NO   TO TRCN-ASSIGNMENT
777500           MOVE TRCN-KEY3        TO TRCNKEY3
777600           EXEC CICS READ
777700                     DATASET(TRAIN-CN-VIA-DSD-ASGN)
777800                     INTO(WS-TRCN-FILE)
777900                     LENGTH(TRAINCN-DSD-RLGTH)
778000                     RIDFLD(TRCNKEY3)
778100                     KEYLENGTH(TRAINCN-DSD-KLGTH)
778200                     RESP(WS-RESPONSE)
778300           END-EXEC
778400           MOVE WS-RESPONSE          TO FILE-STATUS
778500           IF NOT SUCCESS
778600              IF NOT NO-RECORD-FND
778700                 MOVE 'P6550-1'      TO ERR-PARAGRAPH
778800                 MOVE TRCNKEY1       TO ERR-KEY
778900                 PERFORM P9999-GOT-PROBLEM
779000              END-IF
779100           END-IF
779200           IF TRCN-ASGN-IS-OUTPOST
779300              SET WS-HOME-IS-AN-OUTPOST TO TRUE
779400           END-IF
779500        WHEN ASGN-JOB-TYPE = 'X'
779600* XBOARD TRAIN SHOULD NEVER BE HERE, ALL XB EMP ARE WORKING JOBS
779700           CONTINUE
779800        WHEN OTHER
779900           CONTINUE
780000     END-EVALUATE
780100     .
780200******************************************************************
780300 P7000-CONVERT-MASTER-DATES.
780400******************************************************************
780500*
780600     SET  DE-YYMMDD-FORMAT          TO TRUE
780700     MOVE EMP-MTOD-DATE             TO DE-YYMMDD
780800     PERFORM P8998-DATEEDIT
780900     MOVE DE-CCYYMMDD               TO WS-EMP-MTOD-DATE-CENT
781000     MOVE EMP-MTOD-TIME             TO WS-EMP-MTOD-HRMN
781100
781200     SET  DE-YYMMDD-FORMAT          TO TRUE
781300     MOVE EMP-US-RSTD-DATE          TO DE-YYMMDD
781400     PERFORM P8998-DATEEDIT
781500     MOVE DE-CCYYMMDD               TO WS-EMP-US-RSTD-DATE-CENT
781600     MOVE EMP-US-RSTD-TIME          TO WS-EMP-US-RSTD-HRMN
781700
781800     SET  DE-YYMMDD-FORMAT          TO TRUE
781900     MOVE EMP-PERS-REST-DATE        TO DE-YYMMDD
782000     PERFORM P8998-DATEEDIT
782100     MOVE DE-CCYYMMDD               TO WS-EMP-PERS-REST-DATE-CENT
782200     MOVE EMP-PERS-REST-TIME        TO WS-EMP-PERS-REST-HRMN
782300
782400     SET  DE-YYMMDD-FORMAT          TO TRUE
782500     MOVE TUT-DATE                  TO DE-YYMMDD
782600     PERFORM P8998-DATEEDIT
782700     MOVE DE-CCYYMMDD               TO WS-LAST-TUT-DATE-CENT
782800     MOVE TUT-TIME-OF-DAY           TO WS-LAST-TUT-HRMN
782900
783000     SET  DE-YYMMDD-FORMAT          TO TRUE
783100     MOVE AT-DATE                   TO DE-YYMMDD
783200     PERFORM P8998-DATEEDIT
783300     MOVE DE-CCYYMMDD               TO WS-LAST-AT-DATE-CENT
783400     MOVE AT-TIME-OF-DAY            TO WS-LAST-AT-HRMN.
783500*
783600******************************************************************
783700 P7100-CONVERT-P925-DATES.
783800******************************************************************
783900*
784000     SET  DE-YYMMDD-FORMAT          TO TRUE
784100     MOVE P925-OD-DATE              TO DE-YYMMDD
784200     PERFORM P8998-DATEEDIT
784300     MOVE DE-CCYYMMDD               TO WS-HOLD-P925-OD-DATE
784400     MOVE P925-OD-TIME              TO WS-HOLD-P925-OD-TIME.
784500*
784600******************************************************************
784700 P7105-RESPITE-CALCS.
784800******************************************************************
784900*
785000     IF P925-RESPITE-FROM-TIME <= WS-HOLD-P925-OD-TIME
785100        MOVE ZEROES                 TO DATE-CONVERSION-PARMS
785200        SET PARM-ADD                TO TRUE
785300        MOVE WS-HOLD-P925-OD-DATE(3:6)
785400                                    TO PARM-PRI-DATE-GREG
785500        MOVE 1                      TO PARM-SEC-DATE-GREG
785600        EXEC CICS LINK
785700                  PROGRAM (P903-PGM)
785800                  COMMAREA(DATE-CONVERSION-PARMS)
785900                  LENGTH (P903-LGTH)
786000                  RESP (WS-RESPONSE)
786100        END-EXEC
786200        MOVE WS-RESPONSE            TO FILE-STATUS
786300        IF NOT SUCCESS
786400           MOVE 'P7105-1'           TO ERR-PARAGRAPH
786500           PERFORM P9999-GOT-PROBLEM
786600        END-IF
786700        MOVE PARM-RES-GREG-CENT     TO WS-RESPITE-OD-CE
786800        MOVE PARM-RES-DATE-GREG     TO WS-RESPITE-OD-DATE
786900     ELSE
787000        MOVE WS-HOLD-P925-OD-DATE   TO WS-RESPITE-OD-DT-CE
787100     END-IF
787200     MOVE P925-RESPITE-FROM-TIME    TO WS-RESPITE-OD-TIME
787300     .
787400*
787500*C1117-BEG
787600******************************************************************
787700 P7150-CALC-RESPITE-DURATION.
787800*
787900     MOVE P925-RESPITE-FROM-TIME    TO WS-RESP-FROM-HRMN
788000     MOVE P925-RESPITE-TO-TIME      TO WS-RESP-TO-HRMN
788100     IF WS-RESP-FROM-HRMN            < WS-RESP-TO-HRMN
788200        COMPUTE WS-RESPITE-HR =
788300                WS-RESP-TO-HR - WS-RESP-FROM-HR
788400        IF WS-RESP-FROM-MN > WS-RESP-TO-MN
788500           SUBTRACT 1 FROM WS-RESPITE-HR
788600           COMPUTE WS-RESPITE-MN =
788700                WS-RESP-TO-MN + 60 - WS-RESP-FROM-MN
788800        ELSE
788900           COMPUTE WS-RESPITE-MN =
789000                   WS-RESP-TO-MN - WS-RESP-FROM-MN
789100        END-IF
789200     ELSE
789300        COMPUTE WS-RESPITE-HR =
789400                WS-RESP-TO-HR + 24 - WS-RESP-FROM-HR
789500        IF WS-RESP-FROM-MN > WS-RESP-TO-MN
789600           SUBTRACT 1 FROM WS-RESPITE-HR
789700           COMPUTE WS-RESPITE-MN =
789800                  WS-RESP-TO-MN + 60 - WS-RESP-FROM-MN
789900        ELSE
790000           COMPUTE WS-RESPITE-MN =
790100                   WS-RESP-TO-MN - WS-RESP-FROM-MN
790200        END-IF
790300     END-IF
790400     .
790500******************************************************************
790600*C1117-END
790700******************************************************************
790800 P7200-CONVERT-2ND-DATES.
790900******************************************************************
791000*
791100     SET  DE-YYMMDD-FORMAT          TO TRUE
791200     MOVE EMPTOD-OD-DATE            TO DE-YYMMDD
791300     PERFORM P8998-DATEEDIT
791400     MOVE DE-CCYYMMDD               TO WS-HOLD-2ND-OD-DATE
791500     MOVE EMPTOD-OD-TIME            TO WS-HOLD-2ND-OD-TIME.
791600*
791700*07/26/23 RJA B CNC0600 CNLD-269
791800**CNLD-250-DXC-B
791900******************************************************************
792000* P7300-CHECK-BSTD-EMP-SCHDL.
792100******************************************************************
792200**
792300**
792400*     MOVE SPACES                    TO WS-ASSIGN-COMMAREA
792500*                                       WS-ASGN-FILE
792600*     SET  GET-EMPS-LATEST-TEMP-JOB  TO TRUE
792700*     MOVE P925-EMP-NO               TO ASGN-EMP-NO
792800*     MOVE WS-ASGN-FILE              TO WS-ASSIGN-RECORD
792900*     EXEC CICS LINK
793000*               PROGRAM(P901-PGM)
793100*               COMMAREA(WS-ASSIGN-COMMAREA)
793200*               LENGTH(P901-LGTH)
793300*               RESP(WS-RESPONSE)
793400*     END-EXEC
793500*     MOVE WS-RESPONSE               TO FILE-STATUS
793600*     IF NOT SUCCESS
793700*        MOVE 'P7300-1'              TO ERR-PARAGRAPH
793800*        MOVE 'P901LINK'             TO ERR-KEY
793900*        PERFORM P9999-GOT-PROBLEM
794000*     END-IF
794100*     MOVE WS-ASSIGN-RECORD          TO WS-ASGN-FILE
794200*     IF ASGN-ASSIGNMENT > SPACES
794300*        IF ASGN-DIST                = TRCN-DIST
794400*           AND ASGN-SUB-DIST        = TRCN-SDIST
794500*           AND ASGN-AJ-JOB-NO       = TRCN-ASSIGNMENT
794600*           AND ASGN-AJ-JOB-CC   NOT = P925-ASGN-CC
794700*           SET WS-BOOSTED-EMP-SM-ASGN-YES
794800*                                    TO TRUE
794900** USE IT FOR OWNER CRAFT  P925-ASGN-CC
795000*        END-IF
795100*     ELSE
795200*        PERFORM P8210-GET-OWNED-JOB
795300*        IF ASGN-ASSIGNMENT > SPACES
795400*           IF ASGN-DIST             = TRCN-DIST
795500*              AND ASGN-SUB-DIST     = TRCN-SDIST
795600*              AND ASGN-AJ-JOB-NO    = TRCN-ASSIGNMENT
795700** IGNORE CRAFT      AND ASGN-AJ-JOB-CC  = P925-ASGN-CC
795800*              AND ASGN-AJ-JOB-CC NOT = P925-ASGN-CC
795900*              SET WS-BOOSTED-EMP-SM-ASGN-YES
796000*                                    TO TRUE
796100*           END-IF
796200*        END-IF
796300*     END-IF
796400**
796500*     IF WS-BOOSTED-EMP-SM-ASGN-YES
796600**CONVERT P925-YARD-DATE-TIME INTO DAY OF THE WEEK
796700*        MOVE ZEROS                  TO DATE-CONVERSION-PARMS
796800*        SET PARM-CONV               TO TRUE
796900*        MOVE P925-OD-DATE           TO PARM-PRI-DATE-GREG
797000*        EXEC CICS LINK
797100*                  PROGRAM(P903-PGM)
797200*                  COMMAREA(DATE-CONVERSION-PARMS)
797300*                  LENGTH(P903-LGTH)
797400*                  RESP(WS-RESPONSE)
797500*        END-EXEC
797600*        MOVE WS-RESPONSE            TO FILE-STATUS
797700*        IF NOT SUCCESS
797800*           MOVE 'P7300-2'           TO ERR-PARAGRAPH
797900*           MOVE 'P903LINK'          TO ERR-KEY
798000*           PERFORM P9999-GOT-PROBLEM
798100*        END-IF
798200**
798300*        MOVE PARM-PRI-DAY-OF-WEEK   TO WS-CALL-DAY
798400**
798500*        MOVE SPACES                 TO JSKEY1
798600*                                       WS-JOB-SCHEDULE
798700*        MOVE ASGN-DIST              TO JSK1-ASGN-DIST
798800*        MOVE ASGN-SUB-DIST          TO JSK1-ASGN-SUB-DIST
798900*        MOVE ASGN-AJ-JOB-NO         TO JSK1-ASGN
799000**READ OWNER'S SCHEDULE FIRST AND THEN BST EMP
799100*        MOVE P925-ASGN-CC           TO JSK1-ASGN-CC
799200**
799300*        PERFORM P7350-BROWSE-SCDL-OF-EMP
799400**READING SCHDL FOR BOOSTED EMP
799500*        IF ASSGN-OWNER-SCHDL > ZEROES
799600*           MOVE SPACES              TO JSKEY1
799700*                                       WS-JOB-SCHEDULE
799800*           MOVE ASGN-DIST           TO JSK1-ASGN-DIST
799900*           MOVE ASGN-SUB-DIST       TO JSK1-ASGN-SUB-DIST
800000*           MOVE ASGN-AJ-JOB-NO      TO JSK1-ASGN
800100**READ OWNER'S SCHEDULE FIRST AND THEN BST EMP
800200*           MOVE ASGN-AJ-JOB-CC      TO JSK1-ASGN-CC
800300*           MOVE ZEROES              TO K
800400*           MOVE SPACES              TO WS-REC-FLAG
800500*           PERFORM P7350-BROWSE-SCDL-OF-EMP
800600**           IF ASSGN-OWNER-SCHDL = SEL-EMP-SCHDL
800700*              SET BOOSTED-EMPL-YES  TO TRUE
800800*
800900*           END-IF
801000*        END-IF
801100*     END-IF.
801200******************************************************************
801300* P7350-BROWSE-SCDL-OF-EMP.
801400******************************************************************
801500** READ JS FILE FOR SELECTED EMP
801600*     MOVE JS-KEY1                   TO WS-JSK-1-KEY
801700*                                       JSKEY1
801800**
801900*     EXEC CICS STARTBR
802000*               DATASET(JS-VIA-JSKEY1)
802100*               RIDFLD(JSKEY1)
802200*               GTEQ
802300*               RESP(WS-RESPONSE)
802400*     END-EXEC
802500*     MOVE WS-RESPONSE               TO FILE-STATUS
802600*
802700*     IF NOT SUCCESS
802800*        MOVE 08                     TO K
802900*        IF NOT (NO-RECORD-FND OR END-OF-FILE)
803000*           MOVE 'P7350-1'           TO ERR-PARAGRAPH
803100*           MOVE JSKEY1              TO ERR-KEY
803200*           PERFORM P9999-GOT-PROBLEM
803300*        END-IF
803400*     END-IF
803500*     PERFORM UNTIL K > 07 OR WS-REC-FND
803600*        EXEC CICS READNEXT
803700*                  DATASET(JS-VIA-JSKEY1)
803800*                  INTO(WS-JOB-SCHEDULE)
803900*                  LENGTH(JSKEY1-RLGTH)
804000*                  RIDFLD(JSKEY1)
804100*                  KEYLENGTH(JSKEY1-KLGTH)
804200*                  RESP(WS-RESPONSE)
804300*        END-EXEC
804400*        MOVE WS-RESPONSE            TO FILE-STATUS
804500*        IF SUCCESS
804600*           IF WS-JSK-1-KEY          = JS-KEY1(1:12)
804700*           AND JSK1-ASGN-DAY        = WS-CALL-DAY
804800*               SET WS-REC-FND       TO TRUE
804900*               IF ASSGN-OWNER-SCHDL > ZEROES
805000*                  MOVE JSK1-ASGN-START-TIME
805100*                                    TO SEL-EMP-SCHDL
805200*               ELSE
805300*                  MOVE JSK1-ASGN-START-TIME
805400*                                    TO ASSGN-OWNER-SCHDL
805500*               END-IF
805600*           ELSE
805700*              ADD 1                 TO K
805800*           END-IF
805900*        ELSE
806000*           SET WS-REC-FND           TO TRUE
806100*           IF NOT (NO-RECORD-FND OR END-OF-FILE)
806200*              MOVE 'P7350-2'        TO ERR-PARAGRAPH
806300*              MOVE JSKEY1           TO ERR-KEY
806400*              PERFORM P9999-GOT-PROBLEM
806500*           END-IF
806600*        END-IF
806700*     END-PERFORM
806800*     EXEC CICS ENDBR
806900**               DATASET(JS-VIA-JSKEY1)
807000*               RESP(WS-RESPONSE)
807100*     END-EXEC.
807200**
807300**CNLD-250-DXC-E
807400**
807500*07/26/23 RJA E
807600*
807700******************************************************************
807800 P8000-READ-TK-CONTROL-GTEQ.
807900******************************************************************
808000*
808100     MOVE WORK-MISC-CLM-KEY     TO TKCRKEY
808200     EXEC CICS READ
808300               DATASET(TKCR-FILE-VIA-TKCRKEY)
808400               INTO(WS-TKCR-FILE)
808500               LENGTH(TKCRFILE-RLGTH)
808600               RIDFLD(TKCRKEY)
808700               KEYLENGTH(TKCRFILE-KLGTH)
808800               GTEQ
808900               RESP(WS-RESPONSE)
809000     END-EXEC
809100     MOVE WS-RESPONSE TO FILE-STATUS
809200     IF SUCCESS
809300        IF  MISC-CONTROL-REC
809400        AND TKCR-MISC-CLAIM-CD = WORK-MISC-CLAIM-CD
809500        AND TKCR-MISC-CRAFT-CD = WORK-MISC-CRAFT-CD
809600        AND TKCR-MISC-JOB-TYPE = WORK-MISC-JOB-TYPE
809700        AND TKCR-MISC-DIST     = WORK-MISC-DIST
809800        AND TKCR-MISC-SDIST    = WORK-MISC-SDIST
809900           SET MISC-CLM-FOUND TO TRUE
810000        END-IF
810100     ELSE
810200        IF NOT (NO-RECORD-FND OR END-OF-FILE)
810300           MOVE 'P8000-1'       TO ERR-PARAGRAPH
810400           MOVE TKCRKEY         TO ERR-KEY
810500           PERFORM P9999-GOT-PROBLEM
810600        END-IF
810700     END-IF.
810800*
810900******************************************************************
811000 P8010-READ-QUAL-FILE.
811100******************************************************************
811200*
811300     EXEC CICS READ
811400               DATASET(QUAL-FILE-VIA-QUALEMP)
811500               INTO(WS-QUAL-FILE)
811600               LENGTH(QUALEMP-RLGTH)
811700               RIDFLD(QUALEMP)
811800               KEYLENGTH(QUALEMP-KLGTH)
811900               RESP(WS-RESPONSE)
812000     END-EXEC
812100     MOVE WS-RESPONSE TO FILE-STATUS.
812200*
812300******************************************************************
812400 P8020-READ-TKCR.
812500******************************************************************
812600*
812700     EXEC CICS READ
812800               DATASET(TKCR-FILE-VIA-TKCRKEY)
812900               INTO(WS-TKCR-FILE)
813000               LENGTH(TKCRFILE-RLGTH)
813100               RIDFLD(TKCRKEY)
813200               KEYLENGTH(TKCRFILE-KLGTH)
813300               GTEQ
813400               RESP(WS-RESPONSE)
813500     END-EXEC
813600     MOVE WS-RESPONSE TO FILE-STATUS
813700     IF NOT SUCCESS
813800        IF NOT (NO-RECORD-FND OR END-OF-FILE)
813900           MOVE 'P8020-1'       TO ERR-PARAGRAPH
814000           MOVE TKCRKEY         TO ERR-KEY
814100           PERFORM P9999-GOT-PROBLEM
814200        END-IF
814300     END-IF.
814400*
814500******************************************************************
814600 P8030-READ-CNTL-FILE.
814700******************************************************************
814800*
814900     MOVE CNTLKEY-AREA              TO CNTLKEY
815000     EXEC CICS READ
815100               DATASET(CNTL-FILE-VIA-CNTLKEY)
815200               INTO(WS-CNTL-FILE)
815300               LENGTH(CNTLFILE-RLGTH)
815400               RIDFLD(CNTLKEY)
815500               KEYLENGTH(CNTLFILE-KLGTH)
815600               RESP(WS-RESPONSE)
815700     END-EXEC
815800     MOVE WS-RESPONSE               TO FILE-STATUS.
815900     IF NOT SUCCESS
816000        IF NOT NO-RECORD-FND
816100           MOVE 'P8030-1'           TO ERR-PARAGRAPH
816200           MOVE CNTLKEY             TO ERR-KEY
816300           PERFORM P9999-GOT-PROBLEM
816400        END-IF
816500     END-IF.
816600*
816700******************************************************************
816800 P8040-FIND-REST-HA-9-11.
816900******************************************************************
817000*
817100     MOVE ZEROS                         TO WORK-REST-CLAIMED
817200     MOVE ASGN-HA-PRIOR-AHMKEY          TO AHM-KEY
817300     MOVE AHM-FILE                      TO AHM-DATASET
817400     MOVE AHM-KEY                       TO AHMKEY
817500     EXEC CICS READ
817600               DATASET  (AHM-DATASET)
817700               INTO     (WS-AHIST-MISC)
817800               LENGTH   (AHM-RLGTH)
817900               RIDFLD   (AHMKEY)
818000               KEYLENGTH(AHM-KLGTH)
818100               RESP     (WS-RESPONSE)
818200     END-EXEC
818300     MOVE WS-RESPONSE                   TO FILE-STATUS
818400     IF  SUCCESS
818500     AND AHM-EMP-PERS-REST-CLMD          > '0000'
818600        MOVE AHM-EMP-PERS-REST-CLMD     TO WORK-REST-CLAIMED-A
818700     END-IF.
818800*
818900******************************************************************
819000 P8050-FIND-REST-HA-9-14.
819100******************************************************************
819200*
819300     MOVE ZEROS                         TO WORK-REST-CLAIMED
819400     MOVE 'N'                           TO WS-AHM-DONE-CODE
819500     MOVE ASGN-HA-PRIOR-AHMKEY          TO AHM-KEY
819600     MOVE SPACES                        TO AHM-VARIABLE
819700     MOVE AHM-FILE                      TO AHM-DATASET
819800     MOVE AHM-KEY                       TO AHMKEY
819900     EXEC CICS STARTBR
820000               DATASET(AHM-DATASET)
820100               RIDFLD (AHMKEY)
820200               GTEQ
820300               RESP   (WS-RESPONSE)
820400     END-EXEC
820500     MOVE WS-RESPONSE                   TO FILE-STATUS
820600     IF NOT SUCCESS
820700        MOVE 'P8055-1'                  TO ERR-PARAGRAPH
820800        MOVE AHMKEY                     TO ERR-KEY
820900        PERFORM P9999-GOT-PROBLEM
821000     END-IF
821100
821200     PERFORM UNTIL AHM-DONE
821300        EXEC CICS READNEXT
821400                  DATASET  (AHM-DATASET)
821500                  INTO     (WS-AHIST-MISC)
821600                  LENGTH   (AHM-RLGTH)
821700                  RIDFLD   (AHMKEY)
821800                  KEYLENGTH(AHM-KLGTH)
821900                  RESP     (WS-RESPONSE)
822000        END-EXEC
822100        MOVE WS-RESPONSE                TO FILE-STATUS
822200        IF  SUCCESS
822300        AND AHM-EMPLOYEE-RECORD
822400           IF AHM-EMP-PERS-REST-CLMD     > WORK-REST-CLAIMED-A
822500              MOVE AHM-EMP-PERS-REST-CLMD TO WORK-REST-CLAIMED-A
822600           END-IF
822700        ELSE
822800           SET  AHM-DONE                TO TRUE
822900        END-IF
823000     END-PERFORM
823100     EXEC CICS ENDBR
823200               DATASET(AHM-DATASET)
823300               RESP(WS-RESPONSE)
823400     END-EXEC.
823500*=================================================================
823600 P8060-EMPTOD-STARTBR.
823700*=================================================================
823800     EXEC CICS STARTBR
823900               DATASET(EMPTOD-VIA-EMP)
824000               RIDFLD(EMPTOD-EMPKEY)
824100               GTEQ
824200               RESP(WS-RESPONSE)
824300     END-EXEC
824400     MOVE WS-RESPONSE                   TO FILE-STATUS
824500     IF NOT SUCCESS
824600        MOVE 'P8060-1'                  TO ERR-PARAGRAPH
824700        MOVE EMPTOD-EMPKEY              TO ERR-KEY
824800        PERFORM P9999-GOT-PROBLEM
824900     END-IF
825000     .
825100*=================================================================
825200 P8070-EMPTOD-READNEXT.
825300*=================================================================
825400     EXEC CICS READNEXT
825500               DATASET(EMPTOD-VIA-EMP)
825600               INTO(WS-EMP-TOD)
825700               LENGTH(EMPTOD-EMP-RLGTH)
825800               RIDFLD(EMPTOD-EMPKEY)
825900               KEYLENGTH(EMPTOD-EMP-KLGTH)
826000               RESP(WS-RESPONSE)
826100     END-EXEC
826200     MOVE WS-RESPONSE                   TO FILE-STATUS
826300     IF NOT (SUCCESS OR NO-RECORD-FND OR END-OF-FILE)
826400        MOVE 'P8070-1'                  TO ERR-PARAGRAPH
826500        MOVE EMPTOD-EMPKEY              TO ERR-KEY
826600        PERFORM P9999-GOT-PROBLEM
826700     END-IF
826800     .
826900*=================================================================
827000 P8080-EMPTOD-READPREV.
827100*=================================================================
827200     EXEC CICS READPREV
827300               DATASET(EMPTOD-VIA-EMP)
827400               INTO(WS-EMP-TOD)
827500               LENGTH(EMPTOD-EMP-RLGTH)
827600               RIDFLD(EMPTOD-EMPKEY)
827700               KEYLENGTH(EMPTOD-EMP-KLGTH)
827800               RESP(WS-RESPONSE)
827900     END-EXEC
828000     MOVE WS-RESPONSE                   TO FILE-STATUS
828100     .
828200*=================================================================
828300 P8090-EMPTOD-ENDBR.
828400*=================================================================
828500     EXEC CICS ENDBR
828600               DATASET(EMPTOD-VIA-EMP)
828700               RESP(WS-RESPONSE)
828800     END-EXEC
828900     .
829000*=================================================================
829100 P8100-GET-HSVC-CNTL-REC.
829200*=================================================================
829300     MOVE SPACES                        TO WS-CNTL-FILE
829400                                           CNTLKEY-AREA
829500     SET HOURS-OF-SVC-REC               TO TRUE
829600     MOVE DIST OF WS-MSTR               TO CNTL-A1-DIST
829700     MOVE SUB-DIST OF WS-MSTR           TO CNTL-A1-SUB-DIST
829800     PERFORM P8030-READ-CNTL-FILE
829900     IF NOT SUCCESS
830000        MOVE '**'                       TO CNTL-A1-SUB-DIST
830100        PERFORM P8030-READ-CNTL-FILE
830200        IF NOT SUCCESS
830300           MOVE '**'                    TO CNTL-A1-DIST
830400           PERFORM P8030-READ-CNTL-FILE
830500        END-IF
830600     END-IF.
830700*=================================================================
830800 P8120-GET-SERVICE-DATA.
830900*=================================================================
831000     PERFORM VARYING I FROM 1 BY 1
831100        UNTIL I > 10
831200        IF CNTL-A1-SERVICE(I) = P925-JOB-TYPE
831300           AND CNTL-A1-TERM(I) = P925-TERM
831400           AND ((CNTL-A1-RD-YD(I) = 'Y'
831500                 AND P925-TIE-UP-YARD)
831600                 OR
831700               (CNTL-A1-RD-YD(I) = 'R'
831800                 AND P925-TIE-UP-ROAD))
831900           SET HSVC-FOUND               TO TRUE
832000           MOVE I                       TO SUB1
832100           MOVE 10                      TO I
832200        END-IF
832300     END-PERFORM
832400
832500     IF NOT HSVC-FOUND
832600        PERFORM VARYING I FROM 1 BY 1
832700           UNTIL I > 10
832800           IF ((CNTL-A1-SERVICE(I) = 'YD'
832900                AND P925-TIE-UP-YARD)
833000                OR
833100              (CNTL-A1-SERVICE(I) = 'RD'
833200                AND P925-TIE-UP-ROAD)
833300                AND CNTL-A1-TERM(I) = P925-TERM)
833400              SET HSVC-FOUND            TO TRUE
833500              MOVE I                    TO SUB1
833600              MOVE 10                   TO I
833700           END-IF
833800        END-PERFORM
833900     END-IF
834000
834100     IF HSVC-FOUND
834200        MOVE WS-CNTL-FILE               TO WORK-SAVE-CNTL
834300        SET HOURS-OF-SVC2-REC           TO TRUE
834400        PERFORM P8030-READ-CNTL-FILE
834500        IF SUB1 > 0
834600           MOVE CNTL-A2-ADD-ARB(SUB1)   TO WS-ADD-ARB
834700           MOVE CNTL-A2-SHORT-CALL-FLAG(SUB1)
834800                                        TO WS-SHORT-CALL
834900        END-IF
835000        MOVE WORK-SAVE-CNTL             TO WS-CNTL-FILE
835100     END-IF.
835200*****************************************************************
835300 P8200-GET-LATEST-TEMP-JOB.
835400*****************************************************************
835500     INITIALIZE WS-ASSIGN-COMMAREA
835600                WS-ASGN-FILE
835700     MOVE P925-EMP-NO                   TO ASGN-EMP-NO
835800     SET GET-EMPS-LATEST-TEMP-JOB       TO TRUE
835900     MOVE WS-ASGN-FILE                  TO WS-ASSIGN-RECORD
836000     EXEC CICS LINK
836100               PROGRAM(P901-PGM)
836200               COMMAREA(WS-ASSIGN-COMMAREA)
836300               LENGTH(P901-LGTH)
836400               RESP(WS-RESPONSE)
836500     END-EXEC
836600     MOVE WS-RESPONSE                   TO FILE-STATUS
836700     IF NOT SUCCESS
836800        MOVE 'P8200-1'                  TO ERR-PARAGRAPH
836900        MOVE 'P901LINK'                 TO ERR-KEY
837000        MOVE 'LINK TO 901 FAILED'       TO ERR-SENTENCE
837100        PERFORM P9999-GOT-PROBLEM
837200     END-IF
837300     MOVE WS-ASSIGN-RECORD              TO WS-ASGN-FILE
837400     .
837500*****************************************************************
837600 P8210-GET-OWNED-JOB.
837700*****************************************************************
837800     MOVE SPACES               TO WS-ASSIGN-COMMAREA
837900                                  WS-ASGN-FILE
838000     SET GET-JOB-EMPLOYEE-OWNS TO TRUE
838100     MOVE P925-EMP-NO          TO ASGN-EMP-NO
838200     MOVE WS-ASGN-FILE         TO WS-ASSIGN-RECORD
838300     EXEC CICS LINK
838400               PROGRAM(P901-PGM)
838500               COMMAREA(WS-ASSIGN-COMMAREA)
838600               LENGTH(P901-LGTH)
838700               RESP(WS-RESPONSE)
838800     END-EXEC
838900     MOVE WS-RESPONSE          TO FILE-STATUS
839000     IF NOT SUCCESS
839100        MOVE 'P8210-6'         TO ERR-PARAGRAPH
839200        MOVE 'P901LINK'        TO ERR-KEY
839300        PERFORM P9999-GOT-PROBLEM
839400     END-IF
839500     MOVE WS-ASSIGN-RECORD     TO WS-ASGN-FILE.
839600*****************************************************************
839700 P8220-GET-JOB-ON-DUTY.
839800*****************************************************************
839900     INITIALIZE WS-ASSIGN-COMMAREA
840000                WS-ASGN-FILE
840100     MOVE P925-EMP-NO                   TO ASGN-EMP-NO
840200     SET GET-JOB-ON-DUTY                TO TRUE
840300     MOVE WS-ASGN-FILE                  TO WS-ASSIGN-RECORD
840400     EXEC CICS LINK
840500               PROGRAM(P901-PGM)
840600               COMMAREA(WS-ASSIGN-COMMAREA)
840700               LENGTH(P901-LGTH)
840800               RESP(WS-RESPONSE)
840900     END-EXEC
841000     MOVE WS-RESPONSE                   TO FILE-STATUS
841100     IF NOT SUCCESS
841200        MOVE 'P8200-1'                  TO ERR-PARAGRAPH
841300        MOVE 'P901LINK'                 TO ERR-KEY
841400        MOVE 'LINK TO 901 FAILED'       TO ERR-SENTENCE
841500        PERFORM P9999-GOT-PROBLEM
841600     END-IF
841700     MOVE WS-ASSIGN-RECORD              TO WS-ASGN-FILE
841800     .
841900*
842000 COPY TIMEZONE.
842100*
842200 COPY TZERROR.
842300*
842400 COPY DATEEDIT.
842500*
842600 COPY TIMEEDIT.
842700*
842800******************************************************************
842900 P9000-RETURN.
843000******************************************************************
843100*
843200     MOVE P925-COMMAREA-PARMS TO DFHCOMMAREA
843300     EXEC CICS RETURN END-EXEC.
843400*
843500******************************************************************
843600 P9100-LINK-TO-P903.
843700******************************************************************
843800*
843900     EXEC CICS LINK
844000               PROGRAM(P903-PGM)
844100               COMMAREA(DATE-CONVERSION-PARMS)
844200               LENGTH(P903-LGTH)
844300               RESP(WS-RESPONSE)
844400     END-EXEC
844500     MOVE WS-RESPONSE                  TO FILE-STATUS
844600     IF NOT SUCCESS
844700        MOVE 'P903LINK'                TO ERR-KEY
844800        PERFORM P9999-GOT-PROBLEM
844900     END-IF.
845000*
845100******************************************************************
845200 P9999-GOT-PROBLEM.
845300******************************************************************
845400*
845500     MOVE P925-PGM TO ERR-PROGRAM
845600     MOVE DFHEIBLK TO ERR-EIBLK
845700     EXEC CICS LINK
845800               PROGRAM(PSTERR-PGM)
845900               COMMAREA(PSTERAR-AREA)
846000               LENGTH(PSTERAR-LGTH)
846100               RESP(WS-RESPONSE)
846200     END-EXEC
846300     MOVE WS-RESPONSE TO FILE-STATUS
846400     EXEC CICS ABEND
846500               ABCODE(PSTERR-ABCODE)
846600     END-EXEC.
846700*
846800 X9999-GOBACK.
846900     GOBACK.
847000*
847100*CNC0533-BEG
847200******************************************************************
847300     EXEC SQL INCLUDE AALSEL02 END-EXEC.
847400     EXEC SQL INCLUDE AALSHARE END-EXEC.
847500*CNC0533-END
