000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. CNP920.
000300*****************************************************************
000400*             E M P L O Y E E  "T I E  U P"                     *
000500*****************************************************************
000600*  DATE   INITIAL  LOG#   DESCRIPTION
000700*-------- ------- ------  ---------------------------------------
000800*09/23/91   MOO           ORIGINAL.
000900*12/22/93   LMB           UNAVAILABLE STATUS MODIFICATIONS.
001000*01/18/93   LMB           MODIFY DEADHEAD LOGIC TO: SET FIRST
001100*                         TEMPORARY VACANCY DATE; RELEASE TEMP
001200*                         EMPLOYEES WHEN PERSON DEADHEADED HOME
001300*                         RETURNS TO REGULAR JOB; CHANGE METHOD
001400*                         OF DETERMINING EMPLOYEE'S STATUS.
001500*04/05/94   LMB           ADD CARRIED TURN BY EMPLOYEE.
001600*04/22/94   DLO           SET EMP-LAST-SVC AT TIE-UP
001700*04/28/94   GER           TIMEZONE UPGRADES
001800*05/06/94   DLO           MAINTAIN SYSTEM AVAIL LIST WHEN STATUS
001900*                         CHANGES
002000*12/12/94   LMB           PASS EMPLOYEE'S CURRENT CRAFT TO P918
002100*02/07/95   FHK           ADD CALL TO P928 FOR TIE UP
002200*05/01/95   PLS           ADD PROCESSING FOR FASTSLOW SPAREBOARD.
002300*06/06/95   PLS           SEND CNP914 THE ADDITIONAL DATA FOR
002400*                         DETERMINING SHORT TURN FOR EXTRABOARD.
002500*06/22/95   PLS           PASS FASTSLOW BOARD SIDE USED IN
002600*                         SELECTION PROCESS, IF APPLICABLE.
002700*06/30/95   PLS           PASS WORK TRAIN TIE-UP REQUIREMENT
002800*                         FLAG IN ORDER TO UPDATE THE ASSIGNMENT
002900*                         HISTORY.
003000*07/12/95   FHK           GO TRAIN CHANGES.
003100*07/17/95   PLS  CNC0079  SEND ORIGIN STATION TO CNP925 WHEN
003200*                         CALCULATING PENALTY.
003300*07/25/95   FHK           CHANGE SVC-FI AND SPCL-QUAL-FI TO SE
003400*08/03/95   PLS  CNC0079  RETAIN PRIOR AHMKEY AND CRAFT CODE
003500*                         IN CASE A HELDAWAY CLAIM IS GENERATED.
003600*08/23/95   PLS  CNC0081  ADD TRIPS TO QUAL TRIP LOG, AND UPDATE
003700*                         QUAL DATE BASED ON TRIPS TAKEN, FOR
003800*                         AUTO-RENEW QUAL CODES, OR NON-EXPIRING
003900*                         QUAL CODES THAT REQUIRE A CERTAIN NBR
004000*                         OF TRIPS TO BE ACTIVATED.
004100*09/18/95   PLS    A-134  RETAIN HELDAWAY INFO IN THE ON DUTY
004200*                         RECORD, WHEN DOING A CANCEL AT AN AWAY
004300*                         TERMINAL.  ALLOWS CORRECT CALCULATION
004400*                         OF HELDAWAY DURING A SUBSEQUENT CALL.
004500*01/18/96   JES    C-225  DCAN REVAMP.
004600*02/01/96   JES    C-227  DELETE ON-DUTY REC FOR GO-TRAIN ASGN
004700*                         ADJ TIE-UP WITH REST > NEXT CALL TIME.
004800*                         (I.E. NO LONGER 920-SAVE-ON-DUTY).
004900*03/06/96   SRP    C-246  CORRECT MILEAGE CALC IN TS.           *
005000*10/11/96   RCW      ?    NORTHERN QUEBEC SPAREBOARDS - PHASE 2 *
005100*                         RECOMPILE FOR P912COMM LENGTH CHANGE  *
005200*02/10/96   RCW  CNC0113  U.S. PAYROLL
005300*02/10/96   RCW  CNC0113  U.S. PAYROLL STEP RATES
005400*03/10/98   NJB  CNC0134  PERS REST CALC UNDER ALT-REST-BOARD-PLCM
005500*03/04/98   LMB  CNC0134  QUICK-TIE.
005600*04/16/98   LMB  CNC0134  ALLOW ADJUST TIE UP AFTER THE PERSON HAS
005700*                         GONE ON DUTY AGAIN.
005800*04/24/98   LMB  CNC0134  TIE UP PASSES DCAN-TO INFO P926.
005900*06/17/98   LMB  BUG      DON'T PASS TIE-UP-TO DIST/SDIST TO P943
006000*                         WHEN DOING A CANCEL.
006100*07/09/98   LMB  C-425    REVISED ALT PLACEMENT LOGIC FOR BOARD
006200*                         POSITIONING.
006300*07/22/98   LMB  C-425    DON'T PASS SCHEDULE END FOR LOCALS THAT
006400*                         AREN'T COMMUTERS.
006500*08/05/98   LMB  C-426    TIE UP OR CANCEL AFTER WORK: SET ALT
006600*                         TIE UP TIME AND ALT REST REQUEST IN MSTR
006700*08/28/98   LMB  CNC0160  CAPTURE EXTENDED RUN INFORMATION.
006800*10/09/98   LMB  CNC0160  PASS HOME/AWAY TO P943 FOR TU FUNCTION.
006900*10/16/98   LMB  CNC0160  SET HIST FLAG IF REMOVED FROM ASSIGNMENT
007000*                         BEFORE PLACED ON IT.
007100*10/22/98   LMB  C-426    WHEN ALT PLACEMENT APPLIES, ALWAYS MOVE
007200*                         SCHEDULED END TIME TO MSTR REC (NOT JUST
007300*                         WHEN IT'S GREATER THAN TU TIME).
007400*12/15/98   GBJ           YEAR 2000 SWEEP.
007500*04/21/99   NJB           ADD TO-PLACE AVLIST LOGIC
007600*04/23/99   AJK           ADDED SNAPSHOT LOGIC.
007700*12/13/99   MOO  CNC0183  ADD LOGIC TO UPDATE MTOR & MTOY AND
007800*                         ADD NEW P925COMMAREA.
007900*12/16/99   PLS  C-475    RETAIN STATUS FOR DHD HOME
008000*01/05/00   MOO  CNC0183  ADD LOGIC TO UPDATE P943-FUN35-REST-STAT
008100*02/26/00   MOO  CNC0183  SAVE AJ-SCH-DURATION IN WORK HISTORY.
008200*03/02/00   NJB  CNC0270  PASS WORK ORDER TO 926
008300*03/24/00   AJK  CNC0275  ADD MERGER CLASSIFICATION LOGIC.
008400*03/29/00   PLS  CNC0279  SEND IC CALLS/TIE-UPS TO NAVIGATOR/TOPC
008500*09/26/00   PLS  BUG      INCLUDE TIME WHEN CANCEL AFTER WORKING
008600*                         OR CANCEL AFTER REPORTING, IN HOURS OF
008700*                         SERVICE CALCULATION.
008800*02/21/01   SWS  CNC0331  ADD CNPS08 LINK.
008900*04/24/01   TJR           ADD MOVE FOR NEW CHANGED-JOB-TYPE FIELD
009000*08/31/01   AJK  C498     DISPLACED TV-A1 STATUS BUG
009100*10/16/01   AJK  C475     DONT RETURN EMPLOYEE TO HIS PREVIOUS
009200*                         OFF STATUS IF HE'S TIEING UP A TEMP JOB
009300*                         THAT HE HOLDS 'FURTHER NOTICE'.  PUT HIM
009400*                         IN 'A0' STATUS.
009500*10/31/01   AJK  CNC0331A MTOD/HOS ADDENDUM A.
009600*02/19/03   SAM  C535     FIXED BOARD PLACEMENT FOR ADJ TIEUP BUG.
009700*03/07/03   JAJ  CNC0331B MTOD/HOS ADDENDUM B.
009800*03/14/03   SAM  CNC0311A CHANGED TO COMPARE EMP-HOME-TERM WITH
009900*                         FINAL-STATION TO POPULATE P925-TERM
010000*05/16/03   JAJ  BUG C549 ACTUAL TIME DEFINITION DOES NOT APPLY
010100*                         TO US HOURS.
010200*06/05/03   BLD  CNC0331C MANDATORY REST - G&I
010300*09/24/03   GER  BUG C472 EMP-HIST EFF DATE OF TIE-UP NOT BEING
010400*                         WRITTEN IN THE SAME TIMEZONE AS THE
010500*                         EMP-HIST-EFF DATE OF THE CALL RECORD.
010600*                         CALL USES THE TZ OF THE JOB. TIEUP WAS
010700*                         USING THE TZ OF THE TRAIN.
010800*                         EXAMPLE-( TRAIN 37/TB  TW123TZ 23 )
010900*                                 ( JOB   37TWTAMU01CO      )
011000*                                 ( 37/TB = EASTERN TZ      )
011100*                                 ( 37/TW = CENTRAL TZ      )
011200*03/12/04   NRL  CNC0331F CALL 925 TO CALCULATE ACTUAL TIME.
011300*04/14/04   NRL  CNC0331G ADD SUPPORT FOR RESPITE, GET EMP REST
011400*                         STATUS FOR EMPTOD FILE.
011500*05/03/04   NRL  CNC0331G ADD TIME ZONE TO THE S08 COMM DATA.
011600*05/06/04   NRL  A287     WRITE A LAYOFF WORK HISTORY RECORD WHEN
011700*                         AN EMPLOYEE IS RETURNED TO UNAVAILABLE
011800*                         STATUS AT TIE UP.  USED BY ACTIVITY DTL.
011900*05/18/04   AJK           CONVERT P925-OD-DATE-TIME TO ASGN'S
012000*                         TIME-ZONE BEFORE LINKING TO 925.
012100*05/26/04   NRL  CNC0331F FIX A TIME ZONE PROBLEM WITH USING THE
012200*                         ADJUSTED ON DUTY TIME.
012300*08/18/04   AJK  C602     FIX DEADHEAD HOME PROCESSING TO DELETE
012400*                         TV ASGN ONLY IF IT'S 'FURTHER NOTICE'
012500*08/19/04   TRK  A305     ADD ALT-REST-PLACEMENT TO ADJUSTED TIE
012600*                         HISTORY REC
012700*09/03/04   AJK  C308     FIX WORK HISTORY ABEND IN DEADHEAD HOME
012800*                         PROCESSING.
012900*05/05/05   MET  CNC0331H HOURS OF SERVICE CLAIMS.
013000*05/09/05   AJK  CNC0331I UPDATE EMP-MTOD, WHEN APPLICABLE, FOR
013100*                         'CW' AND 'RL' CANCELLED EMPLOYEES.
013200*08/03/05   MET  BUG      ACTIVITY DETAIL ECC.
013300*10/14/05   MET  CNC0374D EXPRESS PAY REQUEST.
013400*03/06/06   AJK  C636     RELIEF XB LOGIC - STAMP WORK HISTORY
013500*                         WITH CORRECT YD/LO INDICATOR.
013600*06/30/06   MET  C596     P1109 LOGIC TO DETERMINE IF EMPLOYEE IS
013700*                         AT THE HOME TERMINAL IS NOT CORRECT.
013800*12/31/06   JES  CNC0413  ADD TEMP TRACK TABLE (TTA) ROWS
013900*                         INSERTION FOR DEADHEADS.
014000*05/03/07   AJK           DEADHEAD PROCESSING - STAMP THE TOD LOG
014100*                         ENTRY WITH THE REST STATUS PASSED FROM
014200*                         08Z, NOT WITH WS-EMP-REST-STATUS (THIS
014300*                         IS THE REST VALUE FROM THE EMP'S LAST
014400*                         WORKING ASSIGNMENT).
014500*05/30/07   RAL  CNC0331E IMPOSED REST ON TIEUP CHANGES
014600*06/08/07   AJK           VIRTUAL HOS FIX - DON'T ADD EMPLOYEE TO
014700*                         TEMP TRACKING TABLE DUE TO HAVING AN AVL
014800*                         TRACKING RECORD.
014900*06/15/07   RAL  CNC0331E USE ADJUSTED ONDUTY FOR MTOD CHANGES
015000*09/20/07   AJK           WE NO LONGER NEED TO DO TIMEZONE
015100*                         CONVERSIONS WHEN COMPARING THE EMP'S
015200*                         ADJ OD TIME AGAINST THEIR ORIGINAL OD
015300*                         TIME. (THE AHM-EMP2-WRK-OD-DTTM IS NOW
015400*                         BEING STAMPED IN THE EMP'S TIME ZONE,
015500*                         INSTEAD OF THE ASSIGNMENT'S TZ.)
015600*03/26/08   AJK  C772     WHEN DETERMINING IF AN ASSIGNMENT IS
015700*                         TYING UP AT HOME (P1109-SET-HOS-PARMS)
015800*                         REFERENCE P920-FINAL-STATION INSTEAD OF
015900*                         AH-FINAL-STATION, IF ANY.  IF THE EMPL.
016000*                         CHANGED THE FINAL STATION DURING THE TIE
016100*                         UP PROCESS, IT HASN'T BEEN COMMITTED TO
016200*                         THE AHIST RECORD YET.
016300*04/18/08   AJK  C781     WHEN GETTING THE EMPLOYEE'S REST STATUS
016400*                         (GREEN, YELLOW, RED) FROM THE AHM-EMP2
016500*                         RECORD, REFERENCE P920-TIE-UP-CC, NOT
016600*                         P920-ASGN-CC, TO GET THE CORRECT AHM-
016700*                         CRAFT-SEQ.
016800*06/19/08   AJK  C788     POPULATE QUAL-EMP-NO2 FROM QUAL-EMP-NO,
016900*                         IF BLANK, WHEN UPDATING QUAL CODE.
017000*02/04/09   JES  CNC0436B CHANGE PAGER-NO(ROOM NBR) FROM WSMSTR
017100*                         TO LVE-TABLE
017200*05/08/09   RXS  CNC0484  BUILD HSL EVENTS FOR TIE UP
017300*05/21/09   JES  CNC0484  ADDED PS93 TIME-ZONE MOVE
017400*05/29/09   NJB  CNC0484  CORRECTED DURATION & LIMBO TIME SENT
017500*                         TO S93 -
017600*                         INCLUDE TIME OFF BETWEEN SERVICE IF EMP
017700*                         WAS OFF FOR LESS THAN 4 HOURS. ALSO
017800*                         INCLUDE PREVIOUS DUTY IN LIMBO CALC
017900*                         IF EMP WAS OFF FOR LESS THAN 10 HOURS
018000*                         BETWEEN SERVICE
018100*06/03/09   NJB  CNC0484  READ THE AHM-EMPLOYEE-RECORD AND SAVE
018200*                         THE AHM-OD-ASSIGN TO SEND IT TO S93
018300*06/12/09   RXS  CNC0484  USER NEW P925-US-PREV-TOT-DUTY FOR LIMBO
018400*                         CALCULATIONS
018500*06/16/09   RXS  CNC0484  WRITE HOS LOG FOR EMPLOYEE DEADHEAD
018600*06/16/09   RXS  CNC0484  UPDATE HOS LOG IF OFF DUTY IS CHANGED
018700*07/08/09   JES  CNC0436B AFHT-FAC-CD AND USE-PH-NBR-ON-FILE
018800*                         LOGIC
018900*07/09/09   JES  CNC0436B ADD IVR-CANCEL LOGIC
019000*07/21/09   BLD  CNC0436B PASS IVR INFORMATION TO P927 WHEN
019100*                         DISPLACED EMPLOYEE IS IN AN IVR AREA
019200*07/31/09   AJF  CNC0436B SEARCH FOR WILDCARDED RECORDS WHEN
019300*                         ASSIGNMENT TYPE IS 'A'.
019400*08/13/09   JES  CNC0436B NEW LAYOFF-CODE-2 VALUE.
019500*09/04/09   JES  CNC0436B INSERT/UPDATE LVE TABLE WITH ROOM NBR.
019600*09/08/09   JES  CNC0436E RESTORE USE OF PAGER-NO FROM MSTR.
019700*10/12/09   SXK           SQL TUNING. CHANGED LVECNT01. CHECKING
019800*                         SQL-SUCCESS INSTEAD OF LVE-COUNT VALUE.
019900*10/27/09   CXJ  CNC0488  COUNT OF STARTS CHECKS BASED ON CREW PRF
020000*                         & DEADHEADS
020100*11/11/09   JES  CNC0436B #950 TASK FILE SEARCH FOR NOTIFIES FIX.
020200*12/02/09   RXS  C842     DO NOT RETAIN THE OLD USPD TIMES FOR
020300*                         CANCEL FUNCTION (CR/CW).
020400*04/21/10   RXS  C842     CONSIDER ANY HOS EVENTS WIHTIN 4 HRS OFF
020500*                         CURRENT TOUR IN THE MONTHLY CAP.
020600*05/21/09   RXS  CNC0496  HOLD LIMBO UPON ADJ TIE UP WHILE ONDUTY
020700*05/26/09   RXS  CNC0496  STAMP IN HSD START_LOC & START_LO
020800*06/07/10   RXS  C866     POPULATE PS93-AHIST-KEY
020900*12/09/10   JES  #1457    DO NOT DELETE AND UPDATE LVE UNLESS
021000*                         FACILITY= 999
021100*03/01/11   JES  #1527    FIX LOGIC FOR LVE INSERT AND UPDATE
021200*04/13/11   BLD  CNC0504  WRITE WORK HISTORY WHEN ADDING LVE ROW
021300*06/24/11   JES  C912     ASSURE READ FOR UPDATE SUCCESSFUL
021400*                         BEFORE DOING REWRITE.
021500*06/05/12   AXK  C946     CORRECTED LIMBO CALCULATION.
021600*09/28/12   AXK  CNC0520  ADDED CHANGES TO ADD EMPLOYEE'S TERRITO-
021700*                         RIAL QUALIFICATIONS IF ANY
021800*10/25/12   KXD  CNC0526  WHEN AN EMPLOYEE HAS LESS THAN THE
021900*                         STATUTORY REST BETWEEN CALLS THE SECOND
022000*                         TOUR OF DUTY IS NOT COUNTED AS A START.
022100*11/16/12   KXD CNC0526#9 COUNT THE STARTS FOR A 'DEADHAD-TO-AWAY'
022200*                         TRIP IF THE NEW 'CS' FUNCTIONALITY IS IN
022300*                         EFFECT.
022400*10/18/12   RXK  C957   1.ADDED DELETE LOGIC AND INCLUDED NEW
022500*                         QUERY LVEDEL02 TO DELETE OLD RECORD
022600*                         FROM LVE TABLE WHILE EMP GOING TO AFH OR
022700*                         GOING FROM ONE AFH TO OTHER AFH.
022800*                         *****CHANGE TAG = C957-1
022900*                       2.ADDED INSERT LVE FOR NEW AFHT ALSO ADDED
023000*                         HISTORY FOR THE SAME
023100*                         *****CHANGE TAG = C957-2
023200*                       3.ADDED P920-FROM-07B-TO-04L
023300*02/12/13   AXK  C969     UPDATED PARA P1212,P2000 AND P2010
023400*                         TO USE P920-RESPITE-FROM-DATE AND
023500*                         P920-RESPITE-TO-DATE FOR RESPITE CALC.
023600*05/17/13   BXS  C983     REWAMP LVEDEL/LVEINS LOGIC IN P1100.
023700*08/13/13   AXK  CNC0531   == RECOMPILE ONLY ==
023800*                         ADDED YARD CRAFTS Y0-Y9 AND YT
023900*09/03/14   BXS  C1049    TERRITORIAL TRIP CHECK SHOULD BE SKIPPED
024000*                         FOR ANNU EMPLOYEE.
024100*08/05/15   BXS  CNC0562  FOR CROSS SERVICE RELIEF USE WORKING
024200*                         ASSIGNMENT POOL TO UPDATE EMP-HIST
024300*                         DURING CANCEL/RELESE.
024400*08/31/15   BXS  CNC0570  INSERT FRA SHELL FOR EMP DH
024500*09/29/15   MFO  CNC0572  CHECK ADDITIONAL SPECIAL QUALIFICATIONS
024600*12/02/15   BXS  C1091    SAVE TRAKING MTOD FOR LOST-WORK
024700*                         EMPLOYEE.
024800*01/19/16   MFO  A494     UPDATE PAY HELDAWAY(Y/N) FLAG ON WSASGN
024900*03/17/16   MFO  C1119    SEND DETAILS IF PS93 ABEND
025000*12/07/16   MFO  C1176.2  PASS REST CLAIMED TO UPDATE CARRIED TURN
025100*03/29/23   SXP  CNC0600  WRR PHASE 2
025200*04/23/23   RRS  CNLD-192 CONVERT TIMES BEFORE WRITING TO LOG
025210*04/23/23   NXA  CNC0600  CNLD-208 ADD MTOD CHANGE HISTORY
      *04/24/23   RKW  CNC0600  CNLD-208 EXPAND HISTORY ENTRY
      *05/27/23   RJA  CNC0600  CHANGE MARKED WITH 05/27/23
      *05/30/23   RJA  CNC0600  CHANGE MARKED WITH 05/30/23 -
      *                         CHANGE IN SPEC - IF EMP HAS LESS THAN 6
      *                         HRS LEFT ON THEIR S08-7DAY-CLOCK DURING
      *                         TIE-UP, THEY SHOULD BE FORCED INTO E95
      *                         STATUS ON ANY DAY (NOT JUST DAY 5,6OR7)
      *06/01/23   DXC  CNLD-240 CANCEL AFTER WORK ISSUE FIX TO USE EMP
      *                         TERM TO DECIDE AFH UNDER NEW WRR.
      *06/12/23   DXC  CNLD-246 RESTRICT SYS FORCED RESET FOR YARDMASTER
002440*06/26/23   RJA  CNLD-259 E95 DUEBACK IS END OF SECOND UDR;
      *                         IF RESET STARTS AT 0000, IT SHOULD END
      *                         AT 0759 THE NEXT DAY - DURATION IN THIS
      *                         CASE WILL BE 31 HR 59 MIN INSTEAD OF A
      *                         32 HR MINIMUM.
002440*06/30/23   RJA  CNLD-262 DO NOT FORCE EMP INTO E95 IF EMP HAS
002440*                         LESS THAN 6 HRS LEFT ON THEIR
002440*                         S08-7DAY-CLOCK.
      *01/17/24   RJA  CNLD-304 MINIMUM RESET DURATION IS CHANGED FROM
      *                         3200 TO 3159.
      *02/15/24   RJA  CNLD-311 FORCE EMP INTO E95 IF EMP EXCEEDED 60HRS
      *                         IN 7DAYS OR 192HRS IN 28DAYS;
      *                         ADDING BACK THE CODE COMMENTED WITH
      *                         CNLD-262 AND MODIFYING IT.
      *05/29/24   RJA  CNLD-328 FIX - E95 BOOKON TASK CREATED WITH
      *                         INCORRECT EFFECTIVE TIME DUE TO CONTACT.
      *07/22/24   RJA  CNLD-302 IMPOSED REST IS OBSOLETE PER NEW WRR.
      *                         REMOVING RELATED CODE.
009000*08/16/24   RJA  CNLD-309 MTOY AND MTOR ARE OBSOLETE.
025220******************************************************************
025230 ENVIRONMENT DIVISION.
025240 CONFIGURATION SECTION.
025250 SOURCE-COMPUTER. IBM-9370.
025260 OBJECT-COMPUTER. IBM-9370.
025270 DATA DIVISION.
025280 WORKING-STORAGE SECTION.
025290 01  FILLER                          PIC X(010) VALUE 'P920 W/S'.
025300
025400 01  WS-USERID                       PIC X(003) VALUE SPACES.
025500
025600 01  WS-SUBSCRIPTS.
025700     05  I                           PIC 9(002) VALUE ZEROS.
025800*CNC0520-BEG
025900     05  J                           PIC 9(002) VALUE ZEROS.
026000     05  K                           PIC 9(002) VALUE ZEROS.
026100*CNC0520-END
026200     05  SUB1                        PIC 9(002) VALUE ZEROS.
026300     05  SUBA                        PIC 9(002) VALUE ZEROS.
026400     05  QUAL-SUB                    PIC 9(002) VALUE ZEROS.
026500     05  OJT-SUB                     PIC 9(002) VALUE ZEROS.
026600     05  CHEK-SUB                    PIC 9(002) VALUE ZEROS.
026700     05  MAX-ARRAY-QUAL              PIC 9(002) VALUE 20.
026800     05  MAX-ARRAY-OJT               PIC 9(002) VALUE 20.
026900*CNC0520-BEG
027000     05  ARRAY-MAX                   PIC 9(002) VALUE 7.
027100*CNC0520-END
027200     05  TRK-SUB                     PIC 9(003) VALUE ZEROS.
027300
027400 01  WS-FLAGS.
027500     05  WS-DONE-CODE                PIC 9(001) VALUE ZEROS.
027600         88  DONE                               VALUE 1.
027700     05  WS-LAYOFF-HISTORY-CODE      PIC 9(001) VALUE ZEROS.
027800         88  LAYOFF-HISTORY                     VALUE 1.
027900     05  WS-NEW-TO-PLACE-FLAG        PIC 9(001) VALUE ZERO.
028000         88  NOT-NEW-TO-PLACE                   VALUE ZERO.
028100         88  NEW-TO-PLACE                       VALUE 1.
028200     05  WS-AHMISC-DONE              PIC X(001) VALUE SPACES.
028300         88  AHMISC-DONE                        VALUE 'Y'.
028400     05  WS-ASGN-DONE-CODE           PIC X(001) VALUE SPACES.
028500         88  ASGN-DONE                          VALUE 'Y'.
028600     05  WS-POINTR-DONE-CODE         PIC X(001) VALUE SPACES.
028700         88  POINTR-DONE                        VALUE 'Y'.
028800     05  TEMP-ASGN-XB-AUG-FLAG       PIC X(001) VALUE SPACES.
028900         88  TEMP-ASGN-XB-AUG                   VALUE 'Y'.
029000     05  TEMP-ASGN-F-NOT-FLAG        PIC X(001) VALUE SPACES.
029100         88  TEMP-ASGN-F-NOT                    VALUE 'Y'.
029200     05  ON-DUTY-OUT-TOWN-CODE       PIC X(10) VALUE '9999999999'.
029300         88  OUT-TOWN                          VALUE '0000000000'.
029400     05  EMP-DIST-SDIST-CHG-CODE     PIC X(001) VALUE '0'.
029500         88  EMP-DIST-SDIST-CHANGED             VALUE '1'.
029600     05  WS-SEND-EM-DATA             PIC X(001) VALUE '0'.
029700         88  SEND-EM-DATA                       VALUE '1'.
029800     05  WS-PROCESS-QUAL-FLAG        PIC X(001) VALUE SPACES.
029900         88  PROCESS-QUAL                       VALUE '1'.
030000     05  WS-SAVE-ON-DUTY-CODE        PIC X(001) VALUE SPACES.
030100         88  SAVE-ON-DUTY                       VALUE 'Y'.
030200     05  WS-TRIP-QUAL-FLAG           PIC X(001) VALUE SPACES.
030300         88  TRIP-QUALIFIES                     VALUE 'Y'.
030400         88  TRIP-DOES-NOT-QUAL                 VALUE 'N'.
030500     05  IN-ARRAY-FLAG               PIC X(001) VALUE SPACES.
030600         88  IN-ARRAY                           VALUE 'Y'.
030700     05  OJT-CODES-FLAG              PIC X(001) VALUE SPACES.
030800         88  OJT-CODES-FOUND                    VALUE 'Y'.
030900     05  OJT-DONE-FLAG               PIC X(001) VALUE SPACES.
031000         88  OJT-DONE                           VALUE 'Y'.
031100     05  EMP-IS-HOME-FLAG            PIC X(001) VALUE SPACES.
031200         88  EMP-IS-HOME                        VALUE 'Y'.
031300*    05  WS-SHIFT-CALL-TIE           PIC X(001) VALUE SPACES.
031400*        88  WS-SHIFT-CALL-YES                  VALUE 'C'.
031500*        88  WS-SHIFT-TIE-YES                   VALUE 'T'.
031600*        88  WS-SHIFT-CALL-TIE-YES              VALUE 'B'.
031700     05  WS-ALT-REST-PLACEMENT       PIC X(001) VALUE SPACES.
031800         88  WS-ALT-REST                        VALUE 'Y'.
031900     05  HOLD-ASGN-DH-F-NOTICE-FLAG  PIC X(001) VALUE SPACES.
032000         88  HOLD-ASGN-DH-F-NOTICE              VALUE 'Y'.
032100     05  RELEASED-FROM-TV-FLAG       PIC X(001) VALUE 'N'.
032200         88  NOT-RELEASED-FROM-TV               VALUE 'N'.
032300         88  RELEASED-FROM-TV                   VALUE 'Y'.
032400     05  DEADHEAD-FOUND-FLAG        PIC  X(001) VALUE 'N'.
032500         88  DEADHEAD-FOUND                     VALUE 'Y'.
032600         88  NO-DEADHEAD-FOUND                  VALUE 'N'.
032700     05  POINTER-DONE-FLAG          PIC  X(001) VALUE 'N'.
032800         88  POINTER-DONE                       VALUE 'Y'.
032900         88  POINTER-NOT-DONE                   VALUE 'N'.
033000     05  WS-ETRK-DONE-CODE          PIC  9      VALUE ZERO.
033100         88  ETRK-DONE                          VALUE 1.
033200         88  ETRK-NOT-DONE                      VALUE 0.
033300     05  WS-ADJ-OD-PASSED-FLAG      PIC  X      VALUE SPACE.
033400         88  WS-ADJ-OD-PASSED                   VALUE '1'.
033500         88  WS-ADJ-OD-USED                     VALUE '2'.
033600     05  WS-APPLY-PREV-HOURS-FLAG   PIC  X      VALUE 'Y'.
033700         88  WS-APPLY-PREV-HOURS-YES            VALUE 'Y'.
033800         88  WS-APPLY-PREV-HOURS-NO             VALUE 'N'.
033900     05  WS-APPLY-OVERTIME-FLAG     PIC  X      VALUE SPACE.
034000         88  WS-APPLY-OVERTIME-YES              VALUE 'Y'.
034100     05  FACILITY-999-DELETED-FL    PIC  X(01)  VALUE ' '.
034200         88  FACILITY-999-DELETED               VALUE 'Y'.
034300     05  LVE-RECORD-EXISTS-FL       PIC  X(01)  VALUE ' '.
034400         88  LVE-RECORD-EXISTS                  VALUE 'Y'.
034500     05  NTFY-CNTL-FOUND-FL         PIC  X(01)  VALUE 'N'.
034600         88  NTFY-CNTL-NOT-FOUND                VALUE 'N'.
034700         88  NTFY-CNTL-FOUND                    VALUE 'Y'.
034800     05  REG-NTFY-FOUND-FL          PIC X(001)  VALUE 'N'.
034900         88  REG-NTFY-FOUND                     VALUE 'Y'.
035000     05  AWARD-NTFY-FOUND-FL        PIC X(001)  VALUE 'N'.
035100         88  AWARD-NTFY-FOUND                   VALUE 'Y'.
035200     05  TASK-DONE-FL               PIC X(001)  VALUE SPACE.
035300         88  TASK-DONE                          VALUE 'Y'.
035400     05  WS-AFHT-LODGE-FL           PIC X(001)  VALUE SPACE.
035500         88  WS-AFHT-LODGE-NEW                  VALUE 'Y'.
035600     05  WS-COUNT-AS-START-FL       PIC X(001)  VALUE 'Y'.
035700         88  WS-COUNT-AS-START-YES              VALUE 'Y'.
035800         88  WS-COUNT-AS-START-NO               VALUE 'N'.
035900*C912
036000     05  TELE-RESPONSE              PIC X(001)  VALUE SPACE.
036100         88  TELE-SUCCESS                       VALUE 'Y'.
036200*CNC0526 - BEG
036300     05  US-DOMICILED-FLAG          PIC X(001)  VALUE ' '.
036400         88  US-DOMICILED                       VALUE 'Y'.
036500     05  NON-SERVICE-ACT-FOUND-FL   PIC X(001)  VALUE ' '.
036600         88  NON-SERVICE-ACT-FOUND              VALUE 'Y'.
036700*CNC0526 - END
036800*CNC0520-BEG
036900     05  AHM-DONE-CODE              PIC X       VALUE '0'.
037000         88  AHM-DONE                           VALUE '1'.
037100     05  CALL-P931-FLAG             PIC X       VALUE '0'.
037200         88  DO-NOT-CALL-P931                   VALUE '1'.
037300         88  CALL-P931                          VALUE '0'.
037400*CNC0520-END
037500*CNC0570-BEG
037600     05  WS-FRA-FLAG                 PIC X(01)  VALUE 'N'.
037700         88 ADD-DH-FRA                          VALUE 'Y'.
037800         88 DO-NOT-ADD-DH-FRA                   VALUE 'N'.
037900*CNC0570-END
038000*C1176.2 - BEG
038100     05  WS-ADD-REST                 PIC X(001) VALUE SPACES.
038200         88  WS-ADD-REST-YES                    VALUE 'Y'.
038300*C1176.2 - END
038400*CNC0600 - RJA - B
038500     05  WS-CAN-WRR-FLAG             PIC X(001) VALUE SPACES.
038600         88  WS-CAN-WRR-NEW                     VALUE 'N'.
038700     05  WS-RESET-BREAK-ELIGIBLE-FL  PIC X(001) VALUE SPACES.
038800         88  RESET-BREAK-ELIGIBLE               VALUE 'Y'.
039100     05  WS-RESET-VOID-FL            PIC X(001) VALUE SPACES.
039200         88  RESET-VOID                         VALUE 'Y'.
039300*CNC0600 - RJA - E
701400*CNLD-311-B
038900     05  WS-CHECK-HRS-FL             PIC X(001) VALUE SPACES.
039000         88  EXCEEDED-HRS                       VALUE 'Y'.
701400*CNLD-311-E
039400
039500 01  WS-MISC.
039600     05  WS-HOLD-EFF-DATE-TIME       PIC X(010) VALUE SPACES.
039700     05  WS-EMP-REST-STATUS          PIC X(001) VALUE SPACES.
039800     05  WS-EMP-PREV-OD-DATE-TIME.
039900         10  WS-EMP-PREV-OD-DATE     PIC X(006) VALUE SPACES.
040000         10  WS-EMP-PREV-OD-TIME     PIC X(004) VALUE SPACES.
040100     05  WS-AHM-CRAFT-SEQ            PIC X(002) VALUE SPACES.
040200     05  WS-EMP-OD-ASSIGN            PIC X(012) VALUE SPACES.
040300     05  DAY1                        PIC 9(002) VALUE ZEROS.
040400     05  WS-ASGN-COUNT               PIC 9(002) VALUE ZEROS.
040500     05  WS-EMP-NBR                  PIC X(009) VALUE SPACES.
040600     05  WS-EMP-NUM REDEFINES
040700         WS-EMP-NBR                  PIC 9(009).
040800     05  WS-AVAILABLE                PIC X(001) VALUE 'A'.
040900     05  WS-FURLOUGHED               PIC X(001) VALUE 'F'.
041000*                                                              PLS
041100     05  WS-AHMKEY.
041200         10  WS-AHMKEY-AHIST         PIC X(026) VALUE SPACES.
041300         10  WS-AHMKEY-REC           PIC X(002) VALUE SPACES.
041400         10  WS-AHMKEY-VAR           PIC X(015) VALUE SPACES.
041500     05  WS-HOLD-QUAL-FILE           PIC X(032) VALUE SPACES.
041600     05  WS-HOLD-CNTL-FILE           PIC X(256) VALUE SPACES.
041700     05  WS-HOLD-AHMISC-FILE         PIC X(256) VALUE SPACES.
041800     05  WS-QUAL-DATE                PIC X(006) VALUE SPACES.
041900     05  WS-QUAL-ON-DUTY-DATE-TIME.
042000         10  WS-QUAL-ON-DUTY-DATE    PIC X(006) VALUE SPACES.
042100         10  WS-QUAL-ON-DUTY-TIME    PIC X(004) VALUE SPACES.
042200     05  DISPLACED-ASGN-DATE-TIME.
042300         10  DISPLACED-ASGN-DATE     PIC X(006) VALUE SPACES.
042400         10  DISPLACED-ASGN-TIME     PIC X(004) VALUE SPACES.
042500     05  WS-HOLD-CC                  PIC X(002) VALUE SPACES.
042600     05  WORK-TRAIN-DB.
042700         10  WORK-TRAIN-DB-2         PIC X(002) VALUE SPACES.
042800         10  WORK-TRAIN-DB-8         PIC X(008) VALUE SPACES.
042900     05  WS-COMPANY-CODE             PIC X(001) VALUE SPACES.
043000     05  WORK-ASGN-HIST-KEY.
043100         10  WORK-AH-DIST            PIC X(002) VALUE SPACES.
043200         10  WORK-AH-SUB-DIST        PIC X(002) VALUE SPACES.
043300         10  WORK-AH-POOL            PIC X(002) VALUE SPACES.
043400         10  WORK-AH-EFF-DATE        PIC X(006) VALUE SPACES.
043500         10  WORK-AH-EFF-TIME        PIC X(004) VALUE SPACES.
043600         10  WORK-AH-TRAIN-NO        PIC X(010) VALUE SPACES.
043700     05  WORK-AH-AJ-JOB-CC           PIC X(002) VALUE SPACES.
043800*CNC0570-BEG
043900     05  WS-DH-AHM-EMP-KEY.
044000         10  FILLER                  PIC X(002) VALUE SPACES.
044100         10  WS-DH-AHM-ON-DUTY-DTTM  PIC X(010) VALUE SPACES.
044200         10  FILLER                  PIC X(003) VALUE SPACES.
044300     05  WS-DH-AHIST-KEY.
044400         10  WS-DH-AHIST-DIST        PIC X(02)  VALUE SPACES.
044500         10  WS-DH-AHIST-SUB-DIST    PIC X(02)  VALUE SPACES.
044600         10  FILLER                  PIC X(02)  VALUE 'DH'.
044700         10  WS-DH-AHIST-CALL-DTTM   PIC X(10)  VALUE SPACES.
044800         10  FILLER                  PIC X(10)  VALUE 'DH'.
044900*CNC0570-END
045000     05  WS-RESPITE-FROM-DTTM.
045100         10  WS-RESPITE-FROM-DATE-CENT.
045200             15  WS-RESPITE-FROM-CC     PIC X(002) VALUE SPACES.
045300             15  WS-RESPITE-FROM-DATE.
045400                 20  WS-RESPITE-FROM-YY PIC X(002) VALUE SPACES.
045500                 20  WS-RESPITE-FROM-MM PIC X(002) VALUE SPACES.
045600                 20  WS-RESPITE-FROM-DD PIC X(002) VALUE SPACES.
045700         10  WS-RESPITE-FROM-TIME.
045800             15  WS-RESPITE-FROM-HR     PIC X(002) VALUE SPACES.
045900             15  WS-RESPITE-FROM-MN     PIC X(002) VALUE SPACES.
046000     05  WS-RESPITE-TO-DTTM.
046100         10  WS-RESPITE-TO-DATE-CENT.
046200             15  WS-RESPITE-TO-CC       PIC X(002) VALUE SPACES.
046300             15  WS-RESPITE-TO-DATE.
046400                 20  WS-RESPITE-TO-YY   PIC X(002) VALUE SPACES.
046500                 20  WS-RESPITE-TO-MM   PIC X(002) VALUE SPACES.
046600                 20  WS-RESPITE-TO-DD   PIC X(002) VALUE SPACES.
046700         10  WS-RESPITE-TO-TIME.
046800             15  WS-RESPITE-TO-HR       PIC X(002) VALUE SPACES.
046900             15  WS-RESPITE-TO-MN       PIC X(002) VALUE SPACES.
047000     05  WS-POINT-EFF-DATE-TIME.
047100         10  WS-POINT-EFF-DATE          PIC X(008) VALUE SPACES.
047200         10  WS-POINT-EFF-TIME          PIC X(004) VALUE SPACES.
047300     05  WS-FINAL-STATION               PIC X(005) VALUE SPACES.
047400     05  WS-PROCESS-CRAFT               PIC X(002) VALUE SPACES.
047500     05  WS-DELETED-STATION             PIC X(005).
047600     05  WS-HRMN.
047700         10 WS-HR                    PIC 9(2) VALUE ZERO.
047800         10 WS-MN                    PIC 9(2) VALUE ZERO.
047900     05  WS-DUR-MN.
048000         10 WS-ACTUAL-MN             PIC S9(8) COMP VALUE ZEROES.
048100         10 WS-TOTAL-MN              PIC S9(8) COMP VALUE ZEROES.
048200         10 WS-LIMBO-MN              PIC S9(8) COMP VALUE ZEROES.
048300     05  WS-PS93-START-DTTM.
048400         10  WS-PS93-START-DATE.
048500             15  WS-PS93-START-YY     PIC X(002) VALUE SPACES.
048600             15  WS-PS93-START-MM     PIC X(002) VALUE SPACES.
048700             15  WS-PS93-START-DD     PIC X(002) VALUE SPACES.
048800         10  WS-PS93-START-TIME.
048900             15  WS-PS93-START-HR     PIC X(002) VALUE SPACES.
049000             15  WS-PS93-START-MN     PIC X(002) VALUE SPACES.
049100     05  WS-PS93-END-DTTM.
049200         10  WS-PS93-END-DATE.
049300             15  WS-PS93-END-YY       PIC X(002) VALUE SPACES.
049400             15  WS-PS93-END-MM       PIC X(002) VALUE SPACES.
049500             15  WS-PS93-END-DD       PIC X(002) VALUE SPACES.
049600         10  WS-PS93-END-TIME.
049700             15  WS-PS93-END-HR       PIC X(002) VALUE SPACES.
049800             15  WS-PS93-END-MN       PIC X(002) VALUE SPACES.
049900     05  WS-PS93-START-DTTM-HSD.
050000         10  WS-PS93-START-DATE-HSD.
050100             15  WS-PS93-START-YY-HSD PIC X(002) VALUE SPACES.
050200             15  WS-PS93-START-MM-HSD PIC X(002) VALUE SPACES.
050300             15  WS-PS93-START-DD-HSD PIC X(002) VALUE SPACES.
050400         10  WS-PS93-START-TIME-HSD.
050500             15  WS-PS93-START-HR-HSD PIC X(002) VALUE SPACES.
050600             15  WS-PS93-START-MN-HSD PIC X(002) VALUE SPACES.
050700     05  WS-US-PREV-TOT-DUTY          PIC X(004) VALUE SPACES.
050800     05  WS-IVR-NTFY-CNTL-KEY         PIC X(020) VALUE SPACES.
050900     05  WS-SAVE-ASGN-CC              PIC X(002) VALUE SPACES.
051000     05  WS-SAVE-MASTER-CC            PIC X(002) VALUE SPACES.
051100*C946
051200     05  WORK-TIME1                   PIC 9(004) VALUE ZEROES.
051300     05  WORK-TIME2                   PIC 9(004) VALUE ZEROES.
051400     05  WORK-TIME3                   PIC 9(004) VALUE ZEROES.
051500     05  WORK-TIME4                   PIC 9(004) VALUE ZEROES.
051600*CNC0526-BEG
051700     05  WS-TTOD-CURR-EVENT-MN        PIC 9(004) VALUE ZEROES.
051800     05  WS-HOLD-MSTR-US-RSTD         PIC 9(10)  VALUE ZEROES.
051900     05  WS-TYPE-7-HOS-TM           PIC S9(9) USAGE COMP VALUE +0.
052000     05  WS-NEW-HOS-FLAG              PIC X      VALUE 'N'.
052100         88  WS-NEW-HOS-START                    VALUE 'Y'.
052200         88  WS-OLD-HOS-START                    VALUE 'N'.
052300*CNC0526-END
052400*CNC0520-BEG
052500     05  WS-SAVE-KEY                  PIC X(26)  VALUE SPACES.
052600     05  WS-SAVE-AHM-KEY              PIC X(43)  VALUE SPACES.
052700     05  WS-EMP-NO-ARRAY-AREA.
052800         10 WS-EMP-NO-ARRAY OCCURS 7 TIMES.
052900             15  WS-EMP-NO            PIC X(09)  VALUE SPACES.
053000             15  WS-CRAFT-CODE        PIC X(02)  VALUE SPACES.
053100             15  WS-EMP-TIED-UP-FLAG  PIC X(01)  VALUE SPACES.
053200                 88 WS-EMP-TIED-UP               VALUE 'Y'.
053300             15  WS-EMP-OD-DTTM.
053400                 20 WS-EMP-OD-DATE    PIC X(06)  VALUE SPACES.
053500                 20 WS-EMP-OD-TIME    PIC X(04)  VALUE SPACES.
053600*C1049-BEG
053700             15  WS-OD-FUNCTION       PIC X(04)  VALUE SPACES.
053800                 88  WS-EMP-WAS-ANNULLED         VALUE 'ANNU',
053900                                                       'SCAN'.
054000*C1049-END
054100     05  WS-SAVE-ROUTE-DSGN           PIC X(05)  VALUE SPACES.
054200*CNC0520-END
054300*C1176.2 - BEG
054400     05  BOOK-REST-THRESHOLD         PIC X(004) VALUE SPACES.
054500     05  TURN-TIEING-UP-TIME.
054600         10  TURN-TIEING-UP-DATE     PIC X(006) VALUE SPACES.
054700         10  TURN-TIEING-UP-HRMN     PIC X(004) VALUE SPACES.
054800*C1176.2 - END
054900
055000*CNC0600 - RJA - B
055100 01  WS-PS08-FIELDS.
055200     02  WS-PS08-DIST                PIC X(002) VALUE SPACES.
055300     02  WS-PS08-SDIST               PIC X(002) VALUE SPACES.
055400     02  WS-PS08-TRAIN-ASGN          PIC X(010) VALUE SPACES.
055500     02  WS-PS08-CRAFT               PIC X(002) VALUE SPACES.
055600     02  WS-PS08-EMP-REST-STATUS     PIC X(001) VALUE SPACES.
055700 01  WS-7DAY-END-FIELDS.
055800     02  WS-VOIDED-7DAY-END          PIC X(010) VALUE SPACES.
055900     02  WS-RESTORED-7DAY-END        PIC X(010) VALUE SPACES.
056000 01  WS-RESET-BREAK-FIELDS.
056100     02  WS-PROJ-RESET-BEGIN.
056200         04  WS-PROJ-RESET-BEGIN-DT  PIC X(006) VALUE SPACES.
056300         04  WS-PROJ-RESET-BEGIN-TM  PIC X(004) VALUE SPACES.
056400     02  WS-DAY1-DATE-TIME.
056500         04  WS-DAY1-DATE            PIC X(006) VALUE SPACES.
056600         04  WS-DAY1-TIME            PIC X(004) VALUE SPACES.
056700     02  WS-DAY2-DATE                PIC X(006) VALUE SPACES.
056800     02  WS-DAY3-DATE                PIC X(006) VALUE SPACES.
056900     02  WS-UPD-PROJ-RESET-BRK-CH.
057000         04 WS-UPD-PROJ-RESET-DATE   PIC X(006) VALUE SPACES.
057100         04 WS-UPD-PROJ-RESET-TIME   PIC X(004) VALUE SPACES.
057200     02  WS-UPD-PROJ-UD1-FROM.
057300         04 WS-UPD-PROJ-UD1-FROM-DATE PIC X(006) VALUE SPACES.
057400         04 WS-UPD-PROJ-UD1-FROM-TIME PIC X(004) VALUE SPACES.
057500     02  WS-UPD-PROJ-UD1-TO.
057600         04 WS-UPD-PROJ-UD1-TO-DATE   PIC X(006) VALUE SPACES.
057700         04 WS-UPD-PROJ-UD1-TO-TIME   PIC X(004) VALUE SPACES.
057800     02  WS-UPD-PROJ-UD2-FROM.
057900         04 WS-UPD-PROJ-UD2-FROM-DATE PIC X(006) VALUE SPACES.
058000         04 WS-UPD-PROJ-UD2-FROM-TIME PIC X(004) VALUE SPACES.
058100     02  WS-UPD-PROJ-UD2-TO.
058200         04 WS-UPD-PROJ-UD2-TO-DATE   PIC X(006) VALUE SPACES.
058300         04 WS-UPD-PROJ-UD2-TO-TIME   PIC X(004) VALUE SPACES.
058400*CNC0600 - RJA - E
      *CNLD-240-DXC-B
       01  WS-TRCN-KEY1.
           02 FILLER                       PIC X(005).
           02 WS-ORIGIN-STATION-TRCN       PIC X(005).
           02 WS-ASSIGNMENT-TRCN           PIC X(006).
           02 WS-ASGN-CRAFT-TRCN           PIC X(002).
      *CNLD-240-DXC-E
058500
058600 01  NORMAL-ASGNMT-FLAG              PIC X(001) VALUE SPACES.
058700     88  NORM-ASGN-UFP                          VALUE 'U'.
058800     88  NORM-ASGN-XB                           VALUE 'X'.
058900     88  NORM-ASGN-AJ                           VALUE 'A'.
059000 01  NORMAL-ASGNMT                              VALUE SPACES.
059100     05  NA-DIST                     PIC X(002).
059200     05  NA-SUB-DIST                 PIC X(002).
059300     05  NA-AREA.
059400         10  NA-1                    PIC X(006).
059500         10  NA-2 REDEFINES NA-1.
059600             15  NA-POOL             PIC X(002).
059700             15  NA-TURN             PIC X(004).
059800         10  NA-3 REDEFINES NA-1.
059900             15  NA-FILLER           PIC X(002).
060000             15  NA-XB-TURN          PIC X(004).
060100         10  NA-CC                   PIC X(002).
060200             88 NORM-ASGN-BRAKEMAN   VALUES 'BK', 'B1' THRU 'B2'.
060300
060400 01  TEMPORARY-ASGNMT-FLAG           PIC X(001) VALUE SPACES.
060500     88  TEMP-ASGN-UFP                          VALUE 'U'.
060600     88  TEMP-ASGN-XB                           VALUE 'X'.
060700     88  TEMP-ASGN-AJ                           VALUE 'A'.
060800 01  TEMPORARY-ASGNMT                           VALUE SPACES.
060900     05  TA-DIST                     PIC X(002).
061000     05  TA-SUB-DIST                 PIC X(002).
061100     05  TA-AREA.
061200         10  TA-1                    PIC X(006).
061300         10  TA-2 REDEFINES TA-1.
061400             15  TA-POOL             PIC X(002).
061500             15  TA-TURN             PIC X(004).
061600         10  TA-3 REDEFINES TA-1.
061700             15  TA-FILLER           PIC X(002).
061800             15  TA-XB-TURN          PIC X(004).
061900         10  TA-CC                   PIC X(002).
062000
062100 01  ON-DUTY-ASGNMT-FLAG             PIC X(001) VALUE SPACES.
062200     88  ON-DUTY-UFP                            VALUE 'U'.
062300     88  ON-DUTY-AJ                             VALUE 'A'.
062400 01  ON-DUTY-ASGNMT                             VALUE SPACES.
062500     05  OD-DIST                     PIC X(002).
062600     05  OD-SUB-DIST                 PIC X(002).
062700     05  OD-AREA.
062800         10  OD-1                    PIC X(006).
062900         10  OD-2 REDEFINES OD-1.
063000             15  OD-POOL             PIC X(002).
063100             15  OD-TURN             PIC X(004).
063200         10  OD-CC                   PIC X(002).
063300
063400 01  SAVE-TEMP-ASGN-KEY              PIC X(024) VALUE SPACES.
063500 01  SAVE-NORM-ASGN-KEY              PIC X(024) VALUE SPACES.
063600 01  SAVE-TEMPORARY-ASGNMT-FLAG      PIC X(001) VALUE SPACES.
063700 01  SAVE-TEMPORARY-ASGNMT           PIC X(012) VALUE SPACES.
063800 01  TEMP-ASGN-DATE                  PIC X(006) VALUE SPACES.
063900
064000 01  XXXX-ASGNKEY1.
064100     05  XX-ASGN-JOB-TYPE            PIC X(001) VALUE SPACES.
064200     05  XX-ASGN-DIST                PIC X(002) VALUE SPACES.
064300     05  XX-ASGN-SUB-DIST            PIC X(002) VALUE SPACES.
064400     05  XX-ASGN-JOB                 PIC X(008) VALUE SPACES.
064500     05  XX-ASGN-REC-TYPE            PIC X(001) VALUE SPACES.
064600     05  XX-ASGN-DATE-TIME           PIC 9(010) VALUE ZEROS.
064700
064800 01  WORK-P943-TIMEX.
064900     05  WORK-P943-TIME              PIC 9(012) VALUE ZEROS.
065000     05  WORK-P943-TIME-TIE          PIC 9(002) VALUE ZEROS.
065100
065200 01  RELEASE-DATE-TIME.
065300     05  RELEASE-DATE                PIC 9(006) VALUE ZEROS.
065400     05  RELEASE-TIME                PIC 9(004) VALUE ZEROS.
065500
065600 01  WS-SCHED-END-DATE-TIME.
065700     05  WS-SCHED-END-DATE           PIC X(006) VALUE SPACES.
065800     05  WS-SCHED-END-TIME           PIC X(004) VALUE SPACES.
065900
066000 01  WS-AHM-EFF-DATE-TIME.
066100     05  WS-AHM-EFF-DATE.
066200         06  WS-AHM-EFF-YR           PIC X(002).
066300         06  WS-AHM-EFF-MO           PIC X(002).
066400         06  WS-AHM-EFF-DY           PIC X(002).
066500     05  WS-AHM-EFF-TIME.
066600         06  WS-AHM-EFF-HR           PIC X(002).
066700         06  WS-AHM-EFF-MN           PIC X(002).
066800
066900 01  WS-OD-DATE-TIME.
067000     05  WS-OD-DATE                  PIC X(006).
067100     05  WS-OD-TIME                  PIC X(004).
067200
067300 01  WORK-TIME.
067400     10  WORK-HR                     PIC  9(002) VALUE ZEROS.
067500     10  WORK-MN                     PIC  9(002) VALUE ZEROS.
067600 01  WORK-TIME-NUM REDEFINES
067700     WORK-TIME                       PIC  9(004).
067800
067900 01  WS-EMP-TIME-ZONE                PIC X(001) VALUE SPACES.
068000 01  WS-ASG-TIME-ZONE                PIC X(001) VALUE SPACES.
068100 01  WS-EMP-TIME-ZONE-AHM3           PIC X(001) VALUE SPACES.
068200 01  WS-ASG-TIME-ZONE-AHM3           PIC X(001) VALUE SPACES.
068300
068400 01  WORK-CNTLKEY                               VALUE SPACES.
068500     05  WK-CNTL-REC-TYPE                PIC X(002).
068600     05  WK-CNTL-QUAL.
068700         10  WK-CNTL-DIST                PIC X(002).
068800         10  WK-CNTL-SUB-DIST            PIC X(002).
068900     05  WK-CNTL-ASSIGN.
069000         10  WK-CNTL-AJ-JOB-NO.
069100             15  WK-CNTL-AJ-1-4          PIC X(004).
069200             15  WK-CNTL-AJ-5-6          PIC X(002).
069300         10  FILLER                      PIC X(003).
069400     05  WK-CNTL-XB REDEFINES
069500         WK-CNTL-ASSIGN.
069600         10  WK-CNTL-XB-CODE             PIC X(002).
069700         10  FILLER                      PIC X(007).
069800     05  WK-CNTL-UFP REDEFINES
069900         WK-CNTL-ASSIGN.
070000         10  WK-CNTL-POOL                PIC X(002).
070100         10  WK-CNTL-POOL-TYPE           PIC X(001).
070200         10  FILLER                      PIC X(006).
070300     05  WK-CNTL-ASSIGN-QUAL
070400         REDEFINES WK-CNTL-ASSIGN.
070500         10  WK-CNTL-ASGN-QUAL-TYPE      PIC X(001).
070600         10  WK-CNTL-ASGN-QUAL.
070700             15  WK-CNTL-ASGN-QUAL-1-2   PIC X(002).
070800             15  WK-CNTL-ASGN-QUAL-3-4   PIC X(002).
070900             15  WK-CNTL-ASGN-QUAL-5-6   PIC X(002).
071000             15  WK-CNTL-ASGN-QUAL-7-8   PIC X(002).
071100     05  FILLER                          PIC X(005).
071200
071300 01  WORK-ASGNKEY1.
071400     05  WK-ASGN-JOB-TYPE            PIC X(001) VALUE SPACES.
071500     05  WK-ASGN-ASSIGNMENT                     VALUE SPACES.
071600         10  WK-ASGN-DIST            PIC X(002).
071700         10  WK-ASGN-SUB-DIST        PIC X(002).
071800         10  WK-ASGN-ASSIGN.
071900             15  WK-ASGN-POOL        PIC X(002).
072000             15  WK-ASGN-TURN        PIC X(004).
072100             15  WK-ASGN-CC          PIC X(002).
072200     05  WK-ASGN-REC-TYPE            PIC X(001) VALUE '1'.
072300     05  WK-ASGN-DATE-TIME           PIC 9(010) VALUE ZEROS.
072400
072500 01  WORK-AH-KEY-1                              VALUE SPACES.
072600     05  WK-AHK1-DIST                PIC X(002).
072700     05  WK-AHK1-SUB-DIST            PIC X(002).
072800     05  WK-AHK1-POOL                PIC X(002).
072900     05  WK-AHK1-EFF-DATE-TIME       PIC X(010).
073000     05  WK-AHK1-TRAIN               PIC X(010).
073100
073200 01  WORK-ASGNKEY2.
073300     05  WK-ASGN-EMP-NO              PIC 9(009) VALUE ZEROS.
073400     05  WK-ASGN-EMP-REC-TYPE        PIC X(001) VALUE SPACES.
073500     05  WK-ASGN-EMP-DATE-TIME       PIC 9(010) VALUE ZEROS.
073600
073700 01  WS-SAVE-ASGN-FILE               PIC X(128) VALUE SPACES.
073800 01  WS-HOLD-ASGN-FILE               PIC X(128) VALUE SPACES.
073900 01  WS-HOLD-MSTR-FILE               PIC X(384) VALUE SPACES.
074000 01  WS-HOLD-EMP-NBR                            VALUE SPACES.
074100     05  WS-HOLD-EMP-123             PIC X(003).
074200     05  WS-HOLD-EMP-456789          PIC X(006).
074300 01  CALL-COUNT                      PIC 9(002) VALUE ZEROES.
074400 01  TU-COUNT                        PIC 9(002) VALUE ZEROES.
074500
074600 01  DUMMY-FILLER  PIC X(20) VALUE '**** QUAL ARRAY ****'.
074700 01  WS-QUALIFICATION-ARRAY                     VALUE SPACES.
074800     05  WS-QUAL-ARRAY                          OCCURS 20 TIMES.
074900         10  WS-QUAL                 PIC X(004).
075000         10  WS-QUAL-RENEW-DAYS      PIC X(003).
075100         10  WS-QUAL-RENEW-DAYS-NUM REDEFINES WS-QUAL-RENEW-DAYS
075200                                     PIC 9(003).
075300         10  WS-QUAL-TRIP-CNTR       PIC 9(004).
075400         10  FILLER REDEFINES WS-QUAL-TRIP-CNTR.
075500             15  FILLER              PIC X(002).
075600             15  WS-QUAL-TRIP-CNTR-2 PIC X(002).
075700         10  WS-QUAL-ENG-OJT-TRNR    PIC X(001).
075800             88  WS-QUAL-ENGINEER-OJT           VALUE 'Y'.
075900         10  WS-QUAL-OJT-CODE        PIC X(004).
076000 01  WS-SAVE-OJT-ARRAY                          VALUE SPACES.
076100     05  WS-SAVE-OJT                 PIC X(004) OCCURS 20 TIMES.
076200
076300 01  WS-LIST-IDENTIFIERS.
076400     05  WS-LIST-ID                  PIC X(002) VALUE SPACES.
076500         88 SYSTEM-LIST-ID                      VALUE '#L'.
076600     05  WS-SCHEDULE-LIST-ID         PIC X(002) VALUE '#S'.
076700 01  WS-US-STEP-RATE-TABLE.
076800     05  WS-US-STEP-RATE-ENTRY OCCURS 7 TIMES
076900             INDEXED BY US-NDX.
077000         10  WS-US-QUALIFICATION PIC X(4).
077100         10  WS-US-QUAL-DATE     PIC X(6).
077200*C1176.2 - BEG
077300 01 PREV-ASGN.
077400    05  PREV-ASGNMT-FLAG                PIC  X(001) VALUE SPACES.
077500    05  PREV-ASGNMT.
077600        10  PREV-DIST                   PIC  X(002).
077700        10  PREV-SUB-DIST               PIC  X(002).
077800        10  PREV-AREA                   PIC  X(006).
077900        10  PREV-AREA-2 REDEFINES PREV-AREA.
078000            15  PREV-AREA-POOL          PIC  X(002).
078100            15  PREV-AREA-TURN          PIC  X(004).
078200        10  PREV-CC                     PIC  X(002).
078300*C1176.2 - END
078400*****************************************************************
078500***                 I/O STATUS CHECK FIELDS
078600*****************************************************************
078700 01  WS-RESPONSE                     PIC S9(008) COMP VALUE ZEROS.
078800 01  FILE-STATUS                     PIC  9(004) VALUE ZEROS.
078900     EXEC SQL INCLUDE IOCODES END-EXEC.
079000 01  DISPLAY-FILE-STATUS           PIC S9(8) VALUE ZERO.
079100     EXEC SQL INCLUDE WSCOMMON END-EXEC.
079200*****************************************************************
079300***                   COMMAREA COPYBOOKS
079400*****************************************************************
079500     EXEC SQL INCLUDE P920COMM END-EXEC.
079600*****************************************************************
079700***                  CALLED ROUTINES COPYBOOKS.
079800*****************************************************************
079900     EXEC SQL INCLUDE P901COMM END-EXEC.
080000     EXEC SQL INCLUDE P903COMM END-EXEC.
080100     EXEC SQL INCLUDE P912COMM END-EXEC.
080200     EXEC SQL INCLUDE P913COMM END-EXEC.
080300     EXEC SQL INCLUDE P914COMM END-EXEC.
080400*CNC0600 - RJA - B
080500     EXEC SQL INCLUDE P917COMM END-EXEC.
080600*CNC0600 - RJA - E
080700     EXEC SQL INCLUDE P918COMM END-EXEC.
080800     EXEC SQL INCLUDE P925COMM END-EXEC.
080900     EXEC SQL INCLUDE P926COMM END-EXEC.
081000     EXEC SQL INCLUDE P927COMM END-EXEC.
081100     EXEC SQL INCLUDE P928COMM END-EXEC.
081200     EXEC SQL INCLUDE P929COMM END-EXEC.
081300     EXEC SQL INCLUDE P931COMM END-EXEC.
081400     EXEC SQL INCLUDE P936COMM END-EXEC.
081500     EXEC SQL INCLUDE P937COMM END-EXEC.
081600     EXEC SQL INCLUDE P938COMM END-EXEC.
081700     EXEC SQL INCLUDE P943COMM END-EXEC.
081800     EXEC SQL INCLUDE P963COMM END-EXEC.
081900     EXEC SQL INCLUDE P970COMM END-EXEC.
082000     EXEC SQL INCLUDE PS08COMM END-EXEC.
082100     EXEC SQL INCLUDE PS93COMM END-EXEC.
082200     EXEC SQL INCLUDE PS94COMM END-EXEC.
082300     EXEC SQL INCLUDE PSTERAR  END-EXEC.
082400*****************************************************************
082500***                       FILE COPYBOOKS
082600*****************************************************************
082700     EXEC SQL INCLUDE WSCNTL   END-EXEC.
082800     EXEC SQL INCLUDE WSMSTR   END-EXEC.
082900*CNC0600 - RJA - B
083000     EXEC SQL INCLUDE WSMSTR3  END-EXEC.
083100*CNC0600 - RJA - E
083200     EXEC SQL INCLUDE WSTELE   END-EXEC.
083300     EXEC SQL INCLUDE WSASGN   END-EXEC.
083400     EXEC SQL INCLUDE WSUFP    END-EXEC.
083500     EXEC SQL INCLUDE WSAJ     END-EXEC.
083600     EXEC SQL INCLUDE WSEMPTOD END-EXEC.
083700     EXEC SQL INCLUDE WSSWASGN END-EXEC.
083800     EXEC SQL INCLUDE WSPOINTR END-EXEC.
083900     EXEC SQL INCLUDE WSTKCR   END-EXEC.
084000     EXEC SQL INCLUDE WSTRCN   END-EXEC.
084100     EXEC SQL INCLUDE WSTASK   END-EXEC.
084200     EXEC SQL INCLUDE WSQUAL   END-EXEC.
084300     EXEC SQL INCLUDE WSAHIST  END-EXEC.
084400     EXEC SQL INCLUDE WSAHMISC END-EXEC.
084500     EXEC SQL INCLUDE WSAL     END-EXEC.
084600     EXEC SQL INCLUDE WSLOCODE END-EXEC.
084700     EXEC SQL INCLUDE WSEMPTRK END-EXEC.
084800*C1176.2-BEG
084900     EXEC SQL INCLUDE AALV     END-EXEC.
085000     EXEC SQL INCLUDE AALWS    END-EXEC.
085100*C1176.2-END
085200*****************************************************************
085300***                   DB2 TABLES
085400*****************************************************************
085500     EXEC SQL INCLUDE FRAV     END-EXEC.
085600     EXEC SQL INCLUDE FRAWS    END-EXEC.
085700     EXEC SQL INCLUDE FRDV     END-EXEC.
085800     EXEC SQL INCLUDE FRDWS    END-EXEC.
085900     EXEC SQL INCLUDE TTAV     END-EXEC.
086000     EXEC SQL INCLUDE TTAWS    END-EXEC.
086100     EXEC SQL INCLUDE HSLV     END-EXEC.
086200     EXEC SQL INCLUDE HSLWS    END-EXEC.
086300     EXEC SQL INCLUDE HSDV     END-EXEC.
086400     EXEC SQL INCLUDE HSDWS    END-EXEC.
086500     EXEC SQL INCLUDE LVPV     END-EXEC.
086600     EXEC SQL INCLUDE LVPWS    END-EXEC.
086700     EXEC SQL INCLUDE LVEV     END-EXEC.
086800     EXEC SQL INCLUDE LVEWS    END-EXEC.
086900     EXEC SQL INCLUDE IENV     END-EXEC.
087000     EXEC SQL INCLUDE IENWS    END-EXEC.
087100*****************************************************************
087200***                       MISC COPYBOOKS
087300*****************************************************************
087400     EXEC SQL INCLUDE PSTCCRFT END-EXEC.
087500     EXEC SQL INCLUDE WSAJDEFN END-EXEC.
087600     EXEC SQL INCLUDE WSOFFSET END-EXEC.
087700     EXEC SQL INCLUDE WSSYDTTM END-EXEC.
087800     EXEC SQL INCLUDE WSEDDATE END-EXEC.
087900     EXEC SQL INCLUDE WSZONE   END-EXEC.
088000     EXEC SQL INCLUDE WSMSG    END-EXEC.
088100     EXEC SQL INCLUDE WSDAYSVC END-EXEC.
088200
088300     EXEC SQL INCLUDE SQLCA    END-EXEC.
088400
088500 LINKAGE SECTION.
088600 01  DFHCOMMAREA.
088700     05  FILLER            PIC X(400).
088800
088900 PROCEDURE DIVISION.
089000******************************************************************
089100 P0000-MAINLINE.
089200******************************************************************
089300*
089400     EXEC CICS IGNORE CONDITION ERROR END-EXEC
089500     EXEC CICS HANDLE ABEND LABEL(P9999-GOT-PROBLEM) END-EXEC
089600
089700     EXEC SQL INCLUDE ABSTIME                        END-EXEC
089800     IF EIBCALEN = ZERO
089900        PERFORM P9999-GOT-PROBLEM
090000     END-IF
090100     EXEC CICS ASKTIME
090200               ABSTIME(WS-ABSTIME)
090300     END-EXEC
090400     ADD WS-ABSTIME-OFFSET       TO WS-ABSTIME
090500     EXEC CICS FORMATTIME
090600               ABSTIME(WS-ABSTIME)
090700               YYYYMMDD(WS-SYSTEM-DATE-CENT)
090800               TIME(WS-SYSTEM-TIME-AREA)
090900     END-EXEC
091000*-----------------------------------------------------------------
091100*    INSTALL APPLICATION DATE/TIME
091200*-----------------------------------------------------------------
091300     PERFORM P9800-GET-TIME-OFFSET
091400     IF WS-DATE-TIME-OFFSET > SPACES
091500        MOVE ZEROS          TO DATE-CONVERSION-PARMS
091600        MOVE WS-SYSTEM-DATE TO PARM-PRI-DATE-GREG
091700        MOVE WS-SYSTEM-TIME TO PARM-PRI-HRMN
091800        PERFORM P9810-PROCESS-OFFSET
091900        MOVE PARM-RES-GREG-CENT TO WS-SYSTEM-CENT
092000        MOVE PARM-RES-DATE-GREG TO WS-SYSTEM-DATE
092100        MOVE PARM-RES-HRMN      TO WS-SYSTEM-TIME
092200     END-IF
092300*
092400     MOVE WS-SYSTEM-DATE-TIME TO WORK-P943-TIME
092500     MOVE ZEROS TO WORK-P943-TIME-TIE
092600     MOVE DFHCOMMAREA TO P920-COMMAREA-PARMS
092700     PERFORM P1000-PROCESS
092800     PERFORM P9000-RETURN.
092900*
093000******************************************************************
093100 P1000-PROCESS.
093200******************************************************************
093300     IF P920-ASGN-PARM > SPACES
093400        IF  P920-DEADHEAD-FUNCTION
093500        AND NOT P920-DEADHEAD-HOME
093600           SET NO-RECORD-FND TO TRUE
093700           IF P920-ASGN-UFP
093800              MOVE P920-ASGN-PARM TO UFPTURN
093900              PERFORM P8600-READ-UFPTURN
094000           END-IF
094100           IF P920-ASGN-AJ
094200              MOVE P920-ASGN-PARM TO AJJOBKEY
094300              PERFORM P8610-READ-AJJOBKEY
094400           END-IF
094500           IF NOT SUCCESS
094600              MOVE 'P1000-1' TO ERR-PARAGRAPH
094700              MOVE P920-ASGN-PARM TO ERR-KEY
094800              PERFORM P9999-GOT-PROBLEM
094900           END-IF
095000        END-IF
095100     ELSE
095200        MOVE 'P1000-2'   TO ERR-PARAGRAPH
095300        PERFORM P9999-GOT-PROBLEM
095400     END-IF
095500*
095600     MOVE SPACES                        TO WS-MSTR
095700     IF NOT P920-DEADHEAD-FUNCTION
095800        IF NOT P920-HAVE-ON-DUTY-EMP
095900           MOVE 'P1000-3'               TO ERR-PARAGRAPH
096000           PERFORM P9999-GOT-PROBLEM
096100        END-IF
096200        MOVE P920-ASGN-ON-DUTY-EMP      TO MSTRNBRK
096300        PERFORM P8500-READ-MASTER
096400        IF  NOT WORKING
096500        AND NOT P920-ADJ-TIE-UP-FUNCTION
096600           MOVE 'P1000-4'               TO ERR-PARAGRAPH
096700           MOVE MSTRNBRK                TO ERR-KEY
096800           STRING 'EMP STATUS = ' LAYOFF-CODE
096900                   DELIMITED BY SIZE  INTO ERR-SENTENCE
097000           PERFORM P9999-GOT-PROBLEM
097100        END-IF
097200     ELSE
097300        MOVE P920-DHD-EMP-NO            TO MSTRNBRK
097400        PERFORM P8500-READ-MASTER
097500     END-IF
097600*CNC0526 - BEG
097700     MOVE EMP-US-RSTD                   TO WS-HOLD-MSTR-US-RSTD
097800*CNC0526 - END
097900
098000     PERFORM P9820-SNAPSHOT-XB
098100*
098200*    READ THE 'SUB DISTRICT' CONTROL RECORD
098300*
098400     MOVE SPACES              TO WORK-CNTLKEY
098500     MOVE '02'                TO WK-CNTL-REC-TYPE
098600     MOVE DIST OF WS-MSTR     TO WK-CNTL-DIST
098700     MOVE SUB-DIST OF WS-MSTR TO WK-CNTL-SUB-DIST
098800     PERFORM P8640-READ-CNTLFILE
098900     IF NOT SUCCESS
099000        MOVE 'P1000-5' TO ERR-PARAGRAPH
099100        MOVE CNTLKEY TO ERR-KEY
099200        PERFORM P9999-GOT-PROBLEM
099300     END-IF
099400     MOVE CNTL-TIME-ZONE       TO WS-EMP-TIME-ZONE
099500*CNC0526 - BEG
099600     MOVE CNTL-US-DOM          TO US-DOMICILED-FLAG
099700*CNC0526 - END
099800*CNC0600-B
099900     MOVE CNTL-CAN-WRR-FLAG    TO WS-CAN-WRR-FLAG
100000*CNC0600-E
100100*CNC0570-BEG
100200     IF  CNTL-US-DOMICILED
100300     AND CNTL-FRA-ALLOWED-NEW
100400     AND P920-DEADHEAD-FUNCTION
100500        SET ADD-DH-FRA         TO TRUE
100600     END-IF
100700*CNC0570-END
100800     MOVE SPACES               TO CNTLKEY-AREA
100900     MOVE '2A'                 TO CNTL-REC-TYPE
101000     MOVE DIST OF WS-MSTR      TO CNTL-DIST
101100     MOVE SUB-DIST OF WS-MSTR  TO CNTL-SUB-DIST
101200     MOVE CNTLKEY-AREA         TO CNTLKEY
101300     EXEC CICS READ
101400               DATASET(CNTL-FILE-VIA-CNTLKEY)
101500               INTO(WS-CNTL-FILE)
101600               LENGTH(CNTLFILE-RLGTH)
101700               RIDFLD(CNTLKEY)
101800               KEYLENGTH(CNTLFILE-KLGTH)
101900               RESP(WS-RESPONSE)
102000     END-EXEC
102100     MOVE WS-RESPONSE TO FILE-STATUS
102200     IF NOT SUCCESS
102300        MOVE 'P1000-6'  TO ERR-PARAGRAPH
102400        MOVE CNTLKEY    TO ERR-KEY
102500        MOVE 'SUB-DIST 2A CNTL REC NOT FOUND'
102600                                     TO ERR-SENTENCE
102700        PERFORM P9999-GOT-PROBLEM
102800     END-IF
102900     MOVE CNTL-ALT-REST-PLACEMENT TO WS-ALT-REST-PLACEMENT
103000*
103100*    GET COMPANY CODE
103200*
103300     MOVE SPACES               TO CNTLKEY-AREA
103400     SET DIST-TYPE-REC         TO TRUE
103500     MOVE DIST OF WS-MSTR      TO CNTL-DIST
103600     MOVE CNTLKEY-AREA         TO CNTLKEY
103700     EXEC CICS READ
103800               DATASET(CNTL-FILE-VIA-CNTLKEY)
103900               INTO(WS-CNTL-FILE)
104000               LENGTH(CNTLFILE-RLGTH)
104100               RIDFLD(CNTLKEY)
104200               KEYLENGTH(CNTLFILE-KLGTH)
104300               RESP(WS-RESPONSE)
104400     END-EXEC
104500     MOVE WS-RESPONSE TO FILE-STATUS
104600     IF NOT SUCCESS
104700        MOVE 'P1000-7'  TO ERR-PARAGRAPH
104800        MOVE CNTLKEY    TO ERR-KEY
104900        MOVE 'DIST 01 CNTL REC NOT FOUND'
105000                                     TO ERR-SENTENCE
105100        PERFORM P9999-GOT-PROBLEM
105200     END-IF
105300     MOVE CNTL-COMPANY-CODE        TO WS-COMPANY-CODE
105400*
105500*    GET EMP REST STATUS FROM AHM-EMP2 RECORD
105600*
105700     IF P920-ADJ-TIE-UP-FUNCTION
105800        MOVE P920-ASGN-HIST-KEY       TO WORK-ASGN-HIST-KEY
105900     ELSE
106000        MOVE EMP-TRHIST-KEY           TO WORK-ASGN-HIST-KEY
106100     END-IF
106200
106300     MOVE SPACES                      TO WS-AHIST-MISC
106400     MOVE WORK-ASGN-HIST-KEY          TO AHM-AHIST-KEY
106500
106600*C781
106700     IF P920-TIE-UP-CC                 > SPACES
106800        MOVE P920-TIE-UP-CC           TO WS-PROCESS-CRAFT
106900     ELSE
107000        MOVE P920-ASGN-CC             TO WS-PROCESS-CRAFT
107100     END-IF
107200
107300     SET CT-IND                       TO 1
107400     SEARCH CRAFT-CODE-TABLE
107500        VARYING CT-IND
107600        AT END CONTINUE
107700           MOVE '99'                  TO AHM-CRAFT-SEQ
107800*C781   WHEN CT-CRAFT-CODE(CT-IND)     = P920-ASGN-CC
107900        WHEN CT-CRAFT-CODE(CT-IND)     = WS-PROCESS-CRAFT
108000           MOVE CT-CRAFT-SEQ(CT-IND)
108100                                      TO AHM-CRAFT-SEQ
108200     END-SEARCH
108300     MOVE SPACES                      TO WS-EMP-TIME-ZONE-AHM3
108400                                         WS-ASG-TIME-ZONE-AHM3
108500     MOVE AHM-CRAFT-SEQ               TO WS-AHM-CRAFT-SEQ
108600     SET AHM-EMPLOYEE-RECORD          TO TRUE
108700     MOVE AH-MISC-FILE(1)             TO AHM-DATASET
108800     MOVE AHM-KEY                     TO AHMKEY
108900
109000     EXEC CICS READ
109100               DATASET(AHM-DATASET)
109200               INTO(WS-AHIST-MISC)
109300               LENGTH(AHM-RLGTH)
109400               RIDFLD(AHMKEY)
109500               KEYLENGTH(AHM-KLGTH)
109600               GTEQ
109700               RESP(WS-RESPONSE)
109800     END-EXEC
109900     MOVE WS-RESPONSE                 TO FILE-STATUS
110000     IF SUCCESS
110100        AND AHM-EMPLOYEE-RECORD
110200        AND AHM-AHIST-KEY = WORK-ASGN-HIST-KEY
110300        AND AHM-CRAFT-SEQ = WS-AHM-CRAFT-SEQ
110400        MOVE AHM-OD-ASSIGN            TO WS-EMP-OD-ASSIGN
110500*
110600        SET AHM-EMPLOYEE-RECORD-2     TO TRUE
110700        MOVE AHM-KEY                  TO AHMKEY
110800        EXEC CICS READ
110900                  DATASET(AHM-DATASET)
111000                  INTO(WS-AHIST-MISC)
111100                  LENGTH(AHM-RLGTH)
111200                  RIDFLD(AHMKEY)
111300                  KEYLENGTH(AHM-KLGTH)
111400                  RESP(WS-RESPONSE)
111500        END-EXEC
111600        MOVE WS-RESPONSE              TO FILE-STATUS
111700        IF SUCCESS
111800           MOVE AHM-EMP2-EMP-REST-STATUS TO WS-EMP-REST-STATUS
111900           MOVE AHM-EMP2-ADJ-OD-DATE  TO WS-EMP-PREV-OD-DATE
112000           MOVE AHM-EMP2-ADJ-OD-TIME  TO WS-EMP-PREV-OD-TIME
112100        END-IF
112200*
112300*** 331E ADD READ OF AHM EMPLOYEE 3 TO GET TIME ZONES
112400        MOVE WS-AHIST-MISC            TO WS-HOLD-AHMISC-FILE
112500        SET AHM-EMPLOYEE-RECORD-3     TO TRUE
112600        MOVE AHM-KEY                  TO AHMKEY
112700        EXEC CICS READ
112800                  DATASET(AHM-DATASET)
112900                  INTO(WS-AHIST-MISC)
113000                  LENGTH(AHM-RLGTH)
113100                  RIDFLD(AHMKEY)
113200                  KEYLENGTH(AHM-KLGTH)
113300                  RESP(WS-RESPONSE)
113400        END-EXEC
113500        MOVE WS-RESPONSE              TO FILE-STATUS
113600        IF SUCCESS
113700           MOVE AHM-EMP-TIME-ZONE     TO WS-EMP-TIME-ZONE-AHM3
113800           MOVE AHM-ASG-TIME-ZONE     TO WS-ASG-TIME-ZONE-AHM3
113900        END-IF
114000        MOVE WS-HOLD-AHMISC-FILE      TO WS-AHIST-MISC
114100        MOVE AHM-KEY                  TO AHMKEY
114200     ELSE
114300        MOVE '*'                      TO WS-EMP-REST-STATUS
114400     END-IF
114500*
114600*    PROCESS ACCORDING TO FUNCTION
114700*
114800     EVALUATE TRUE
114900        WHEN P920-TIE-UP-FUNCTION
115000           PERFORM P1100-TIE-UP-FUNCTION
115100        WHEN P920-ADJ-TIE-UP-FUNCTION
115200           PERFORM P1100-TIE-UP-FUNCTION
115300        WHEN P920-CANCEL-FUNCTION
115400           PERFORM P1100-TIE-UP-FUNCTION
115500        WHEN P920-DEADHEAD-FUNCTION
115600           PERFORM P1200-DEADHEAD-FUNCTION
115700        WHEN OTHER
115800           MOVE 'P1000-7' TO ERR-PARAGRAPH
115900           MOVE 'BADFUNC' TO ERR-KEY
116000           PERFORM P9999-GOT-PROBLEM
116100     END-EVALUATE.
116200*
116300******************************************************************
116400 P1100-TIE-UP-FUNCTION.
116500******************************************************************
116600     MOVE SPACES                           TO P925-COMMAREA-PARMS
116700     MOVE P920-TIME-ZONE                   TO P925-TIME-ZONE
116800     EVALUATE TRUE
116900        WHEN P920-ADJ-TIE-AFTER-ON-DUTY
117000           PERFORM P1108-ADJ-TIE-UP-AFTER-OD
117100        WHEN P920-TIE-UP-FUNCTION OR
117200             P920-ADJ-TIE-UP-FUNCTION
117300           PERFORM P1102-TIE-OR-ADJ-TIE
117400        WHEN P920-CANCEL-FUNCTION AND
117500             (P920-CANCEL-AFTER-WORK OR P920-CANCEL-AFTER-REPORT)
117600           PERFORM P1104-CANCEL-AFTER-WORK
117700        WHEN OTHER
117800           PERFORM P1106-CANCEL-NO-WORK
117900     END-EVALUATE
118000*
118100*    UPDATE THE ASSIGNMENT HISTORY FOR THIS TURN/EMPLOYEE
118200*
118300     MOVE SPACES                    TO P926-COMMAREA-PARMS
118400*** 331E - LET P926 KNOW IF ADJ-OD USED FOR HOS CALCULATION
118500***      - PASS EMPLOYEE TIME ZONE
118600     IF WS-ADJ-OD-USED
118700        SET P926-USED-ADJ-OD-FOR-HOS TO TRUE
118800     END-IF
118900     IF P920-ADJ-TIE-UP-FUNCTION
119000        MOVE P920-ASGN-HIST-KEY     TO P926-ASGN-HIST-KEY
119100     ELSE
119200        MOVE EMP-TRHIST-KEY         TO P926-ASGN-HIST-KEY
119300     END-IF
119400     MOVE P925-OD-DATE-TIME         TO P926-ADJ-OD-DATE-TIME
119500     MOVE P920-TIME-ZONE            TO P926-TIME-ZONE
119600     MOVE P920-CLEAR-QUICK-TIE-FLAG TO P926-CLEAR-QUICK-TIE-FLAG
119700     IF  P920-TIE-UP-FUNCTION
119800     OR  P920-ADJ-TIE-UP-FUNCTION
119900        IF P920-TIE-UP-SHIFT-CALL
120000           SET P926-TIE-UP-SHIFT-CALL      TO TRUE
120100           IF P920-QUICK-TIE-SHFT-CALL
120200              SET P926-QUICK-TIE-SHFT-CALL TO TRUE
120300           END-IF
120400        ELSE
120500           IF P920-QUICK-TIE-UP
120600              SET P926-QUICK-TIE-UP        TO TRUE
120700           ELSE
120800              IF P920-TIE-UP-FUNCTION
120900                 SET P926-TIE-UP-FUNCTION     TO TRUE
121000              ELSE
121100                 SET P926-ADJ-TIE-UP-FUNCTION TO TRUE
121200              END-IF
121300           END-IF
121400           IF P920-TU-EMP-NBR           > SPACES
121500              MOVE P920-TU-EMP-NBR     TO P926-TU-EMP-NBR
121600           END-IF
121700        END-IF
121800*------------------------------------------------------------*
121900*           CONVERT EMP TIME  TO P920-TIME-ZONE              *
122000*------------------------------------------------------------*
122100*       MOVE SPACES                  TO TZ-PARAMETERS
122200*       MOVE WS-EMP-TIME-ZONE        TO TZ-IN-ZONE
122300*       MOVE LAST-ON-DUTY-TIME       TO TZ-IN-DATE-TIME
122400*       MOVE P920-TIME-ZONE          TO TZ-OUT-ZONE
122500*       PERFORM P8996-TIMEZONE
122600*       IF TZ-INVALID-PARAMETERS
122700*          MOVE 'B1100TZ'            TO ERR-PARAGRAPH
122800*          PERFORM P8996-TZERROR
122900*       END-IF
123000*       MOVE TZ-OUT-DATE-TIME        TO P926-TU-OD-DATE-TIME
123100*                                       WS-QUAL-ON-DUTY-DATE-TIME
123200        MOVE P920-TU-OD-DATE-TIME    TO P926-TU-OD-DATE-TIME
123300                                        WS-QUAL-ON-DUTY-DATE-TIME
123400*
123500        MOVE P920-DEP-DATE-TIME        TO P926-DEP-DATE-TIME
123600        MOVE P920-ARR-DATE-TIME        TO P926-ARR-DATE-TIME
123700        MOVE P920-FINAL-STATION        TO P926-FINAL-STATION
123800        MOVE P920-INT-STATION          TO P926-INT-STATION
123900        MOVE P920-TRAIN-LENGTH         TO P926-TRAIN-LENGTH
124000        MOVE P920-HELD-OUT-DATE-TIME   TO P926-HELD-OUT-DATE-TIME
124100        MOVE P920-YARD-DATE-TIME       TO P926-YARD-DATE-TIME
124200        MOVE P920-TRAIN-ARR-DATE-TIME  TO P926-TRAIN-ARR-DATE-TIME
124300        MOVE P920-WORK-BEGAN-DATE-TIME
124400                                      TO P926-WORK-BEGAN-DATE-TIME
124500        MOVE P920-RELV-RESP-DATE-TIME  TO P926-RELV-RESP-DATE-TIME
124600        MOVE P920-JOB-TYPE             TO P926-JOB-TYPE
124700        MOVE P920-CHANGED-JOB-TYPE     TO P926-CHANGED-JOB-TYPE
124800        MOVE P920-ACTUAL-MILES         TO P926-ACTUAL-MILES
124900        MOVE P920-WORKING-UNITS        TO P926-WORKING-UNITS
125000        MOVE P920-RETURN-TRAIN         TO P926-RETURN-TRAIN
125100        MOVE P920-EMP-OFFD-DATE-TIME   TO P926-EMP-OFFD-DATE-TIME
125200        MOVE P920-EMP-PERS-REST-CLMD   TO P926-EMP-PERS-REST-CLMD
125300        MOVE P920-EMP-HOME-ONLY        TO P926-EMP-HOME-ONLY
125400        MOVE P920-EMP-ST-CLMD          TO P926-EMP-ST-CLMD
125500        MOVE P920-US-MLS-HRS-CLMD      TO P926-US-MLS-HRS-CLMD
125600        MOVE P920-EMP-MILES-CLMD       TO P926-EMP-MILES-CLMD
125700        MOVE P920-US-MLS-HRS-CLMD      TO P926-US-MLS-HRS-CLMD
125800        MOVE P920-OT-FLAG              TO P926-OT-FLAG
125900        MOVE P920-TU-EARLY-CODE        TO P926-TU-EARLY-CODE
126000        MOVE P920-EMP-ROOM-NBR         TO P926-EMP-ROOM-NBR
126100        MOVE P920-WORK-ORDER           TO P926-WORK-ORDER
126200        MOVE P920-TIE-UP-TO-DIST       TO P926-TIE-UP-TO-DIST
126300        MOVE P920-TIE-UP-TO-SUB-DIST   TO P926-TIE-UP-TO-SUB-DIST
126400        IF P920-ASGN-AJ
126500           MOVE P920-ASGN-ASGN           TO JOB-DEF-CHECK
126600*CNC0562 - BEG
126700           IF JOB-DEF-RELIEF-ASGN
126800              MOVE P926-AH-POOL          TO P926-TIE-UP-TO-POOL
126900           ELSE
127000*CNC0562 - END
127100              IF  JOB-DEF-LOCAL-ASGN
127200              OR (JOB-DEF-CHECK(1:2) = 'EX'
127300              AND P920-FINAL-STATION > SPACES)
127400                 MOVE JOB-DEF-LOCAL-POOL TO P926-TIE-UP-TO-POOL
127500              ELSE
127600                 MOVE JOB-DEF-YARD-POOL  TO P926-TIE-UP-TO-POOL
127700              END-IF
127800           END-IF
127900        ELSE
128000           MOVE P920-TIE-UP-TO-POOL    TO P926-TIE-UP-TO-POOL
128100        END-IF
128200        MOVE P920-TIE-UP-TO-TERM       TO P926-TIE-UP-TO-TERM
128300        MOVE P920-TIE-UP-CC            TO P926-TIE-UP-CC
199800*CNLD-302 B COMMENTING
128400*-----------------------------------------------------------------
128500*       PASS EXTENDED IMPOSED REST TO AH                CNC0361C
128600*-----------------------------------------------------------------
128700*** 331E - ADDED CHECK TO MAKE SURE MTOD IS > ZERO TO AVOID 4038
128800***        ABEND IN P903:
128900*       IF P920-IMPOSED-REST
129000*          AND P925-MTOD-DATE-TIME      > ZEROS
129100*          MOVE ZEROS                  TO DATE-CONVERSION-PARMS
129200*          SET PARM-DIFF               TO TRUE
129300*          MOVE P920-EMP-OFFD-DATE     TO PARM-PRI-DATE-GREG
129400*          MOVE P920-EMP-OFFD-TIME     TO PARM-PRI-HRMN
129500*          MOVE P925-MTOD-DATE         TO PARM-SEC-DATE-GREG
129600*          MOVE P925-MTOD-TIME         TO PARM-SEC-HRMN
129700*          EXEC CICS LINK
129800*                    PROGRAM(P903-PGM)
129900*                    COMMAREA(DATE-CONVERSION-PARMS)
130000*                    LENGTH(P903-LGTH)
130100*                    RESP(WS-RESPONSE)
130200*          END-EXEC
130300*          MOVE WS-RESPONSE            TO FILE-STATUS
130400*          IF NOT SUCCESS
130500*             MOVE 'P1100-14'          TO ERR-PARAGRAPH
130600*             MOVE 'P903'              TO ERR-KEY
130700*             PERFORM P9999-GOT-PROBLEM
130800*          END-IF
130900*          MULTIPLY PARM-RES-TOT-DAYS BY 24 GIVING WORK-HR
131000*          ADD  PARM-RES-HR            TO WORK-HR
131100*          MOVE PARM-RES-MN            TO WORK-MN
131200*          MOVE WORK-TIME              TO P926-EMP-MAN-REST
131300*       END-IF
199800*CNLD-302 E
131400*-----------------------------------------------------------------
131500*       SET UP TIE-UP REQUIREMENT FLAG
131600*--------------------------------------------------------------PLS
131700        MOVE P920-WORK-TRAIN-FLAG      TO P926-WORK-TRAIN-FLAG
131800        MOVE P920-CABOOSE-IND          TO P926-CABOOSE-IND
131900        MOVE P920-ROUTE-DESIGNATION    TO P926-ROUTE-DESIGNATION
132000        MOVE P920-NUMBER-CARS          TO P926-NUMBER-CARS
132100        MOVE P920-ARTICULATED-CARS     TO P926-ARTICULATED-CARS
132200        MOVE P920-RESPITE-FROM-TIME    TO P926-RESPITE-FROM-TIME
132300        MOVE P920-RESPITE-TO-TIME      TO P926-RESPITE-TO-TIME
132400        MOVE P920-DCAN-TO-INFO         TO P926-DCAN-TO-INFO
132500        MOVE P920-TU-ORIG-TURN-NBR     TO P926-TU-ORIG-TURN-NBR
132600        MOVE P920-AFHT-FACILITY-CD     TO P926-AFHT-FACILITY-CD
132700     ELSE
132800        MOVE P920-TIME-ZONE            TO P926-TIME-ZONE
132900        SET  P926-CANCEL-FUNCTION      TO TRUE
133000        MOVE P920-CANCEL-TYPE          TO P926-CANCEL-TYPE
133100        MOVE P920-CAN-DATE-TIME        TO P926-CANCEL-DATE-TIME
133200        MOVE P920-ASGN-CAN-DATE-TIME   TO P926-ASGN-CAN-DATE-TIME
133300*------------------------------------------------------------*
133400*           CONVERT EMP TIME  TO P920-TIME-ZONE              *
133500*------------------------------------------------------------*
133600*       MOVE SPACES                    TO TZ-PARAMETERS
133700*       MOVE WS-EMP-TIME-ZONE          TO TZ-IN-ZONE
133800*       MOVE LAST-ON-DUTY-TIME         TO TZ-IN-DATE-TIME
133900*       MOVE P920-TIME-ZONE            TO TZ-OUT-ZONE
134000*       PERFORM P8996-TIMEZONE
134100*       IF TZ-INVALID-PARAMETERS
134200*          MOVE 'C1100TZ'              TO ERR-PARAGRAPH
134300*          PERFORM P8996-TZERROR
134400*       END-IF
134500*       MOVE TZ-OUT-DATE-TIME          TO P926-CAN-OD-DATE-TIME
134600        MOVE P920-CAN-OD-DATE-TIME     TO P926-CAN-OD-DATE-TIME
134700        MOVE P920-CAN-CC               TO P926-CANCEL-CC
134800        MOVE P920-CAN-REST-CLMD        TO P926-CAN-REST-CLMD
134900        MOVE P920-CAN-ORIG-TURN-NBR    TO P926-CAN-ORIG-TURN-NBR
135000        MOVE P920-IVR-CANCEL-FL        TO P926-IVR-CANCEL-FL
135100        MOVE P920-IVR-CMC-CALL-FL      TO P926-IVR-CMC-CALL-FL
135200     END-IF
135300
135400     IF P920-EXPRESS-PAY-REQ
135500        SET P926-EXPRESS-PAY-REQ    TO TRUE
135600     ELSE
135700        SET P926-EXPRESS-PAY-REQ-NO TO TRUE
135800     END-IF
135900     IF P920-FRA-COMPLETION
136000        SET P926-FRA-COMPLETION     TO TRUE
136100     END-IF
136200
136300     EXEC CICS LINK
136400               PROGRAM (P926-PGM)
136500               COMMAREA(P926-COMMAREA-PARMS)
136600               LENGTH  (P926-LGTH)
136700               RESP    (WS-RESPONSE)
136800     END-EXEC
136900     MOVE WS-RESPONSE TO FILE-STATUS
137000     IF NOT SUCCESS
137100        MOVE 'P1100-15' TO ERR-PARAGRAPH
137200        PERFORM P9999-GOT-PROBLEM
137300     END-IF
137400*-----------------------------------------------------------------
137500*    SAVE THE AHMISC-KEY FOR LATER PROCESSING.
137600*--------------------------------------------------------------PLS
137700     IF P920-TIE-UP-FUNCTION
137800        MOVE P926-ASGN-HIST-KEY  TO WS-AHMKEY-AHIST
137900        MOVE '01'                TO WS-AHMKEY-REC
138000        MOVE P926-TU-RETURN-AHMKEY-VAR
138100                                 TO WS-AHMKEY-VAR
138200     END-IF
138300*-----------------------------------------------------------------
138400*    DELETE/OR UPDATE THE EMPLOYEES ON DUTY RECORD
138500*--------------------------------------------------------------PLS
138600     IF P920-ADJ-TIE-UP-FUNCTION
138700        AND NOT P920-ADJ-TIE-AFTER-ON-DUTY
138800        MOVE P920-ASGN-TYPE        TO ASGN-JOB-TYPE
138900        MOVE P920-ASGN-PARM        TO ASGN-ASSIGNMENT
139000        SET ASGN-ON-DUTY-REC       TO TRUE
139100        MOVE ZEROS                 TO ASGN-DATE-TIME
139200        MOVE ASGNKEY1              TO ASGNJOB
139300        EXEC CICS READ
139400                  DATASET(ASGN-VIA-ASGNJOB)
139500                  INTO(ASGN-AREA)
139600                  LENGTH(ASGNJOB-RLGTH)
139700                  RIDFLD(ASGNJOB)
139800                  KEYLENGTH(ASGNJOB-KLGTH)
139900                  RESP(WS-RESPONSE)
140000        END-EXEC
140100        MOVE WS-RESPONSE TO FILE-STATUS
140200        IF  SUCCESS
140300        AND ASGN-EMP-NO = EMP-NBR OF WS-MSTR
140400           IF P920-SAVE-ON-DUTY = 'Y'
140500              SET SAVE-ON-DUTY     TO TRUE
140600           ELSE
140700              MOVE SPACES          TO WS-SAVE-ON-DUTY-CODE
140800              IF ASGN-SAVE-ON-DUTY = 'Y'
140900              AND P920-ASGN-IS-HOME
141000                 EXEC CICS DELETE
141100                           DATASET(ASGN-VIA-ASGNJOB)
141200                           RIDFLD(ASGNJOB)
141300                           RESP(WS-RESPONSE)
141400                 END-EXEC
141500                 MOVE WS-RESPONSE  TO FILE-STATUS
141600                 IF NOT SUCCESS
141700                    MOVE 'P1100-16' TO ERR-PARAGRAPH
141800                    MOVE ASGNJOB   TO ERR-KEY
141900                    PERFORM P9999-GOT-PROBLEM
142000                 END-IF
142100              END-IF
142200           END-IF
142300        END-IF
142400     END-IF
142500
142600     IF  P920-CANCEL-FUNCTION
142700     AND P920-CANCEL-BUST
142800     AND P920-ASGN-PARM  > SPACES
142900     AND P920-ASGN-UFP
143000     AND ASGN-HOME-BOARD > SPACES
143100        MOVE P920-ASGN-PARM TO UFPTURN
143200        PERFORM P8600-READ-UFPTURN
143300        IF SUCCESS
143400           IF  DIST      OF WS-UFP = ASGN-HOME-BOARD-DIST
143500           AND SUB-DIST  OF WS-UFP = ASGN-HOME-BOARD-SDIST
143600           AND POOL-NAME OF WS-UFP = ASGN-HOME-BOARD-POOL
143700           AND IN-OUT-TERMINAL     = ASGN-HOME-BOARD-TERM
143800              SET EMP-IS-HOME TO TRUE
143900           END-IF
144000        END-IF
144100     END-IF
144200*
144300     IF TEMPORARY-ASGNMT > SPACES
144400        AND TEMPORARY-ASGNMT = ON-DUTY-ASGNMT
144500        AND TEMP-ASGN-F-NOT
144600        SET HOLD-ASGN-DH-F-NOTICE  TO TRUE
144700     ELSE
144800        MOVE SPACES                TO HOLD-ASGN-DH-F-NOTICE-FLAG
144900     END-IF
145000
145100     IF NOT P920-ADJ-TIE-UP-FUNCTION
145200        PERFORM P1110-UPDATE-ON-DUTY-REC
145300     END-IF
145400*
145500*    UPDATE REQUIRED FIELDS IN THE EMPLOYEE MASTER RECORD
145600*    IF NOT CANCELING AN "ANNUL" JOB
145700*
145800*    NOTE: ANY FIELDS RETURNED FROM P925 SHOULD ALREADY BE
145900*          CONVERTED TO THE EMPLOYEES TIME ZONE
146000*
146100     IF  P920-ADJ-TIE-AFTER-ON-DUTY
146200     AND P925-RECALC-CAN-HRS-SVC
146300        PERFORM P8520-READ-MASTER-UPDATE
146400*** 331E - UPDATE EMP-MSTR ONLY IF TU COUNT = CALL COUNT
146500*       MOVE P925-MTOD                TO EMP-PREV-DUTY-MTOD
146600*       MOVE P925-MTOD-DATE-TIME      TO EMP-MTOD
146700*                                        EMP-TRACK-MTOD-DATE-TIME
146800*       SET  MSTR-MTOD-CAN-ADJUST     TO TRUE
146900*       MOVE P925-MTOD-AMT            TO EMP-LAST-MTOD-AMT
147000        IF CALL-COUNT = TU-COUNT
147100           MOVE P920-EMP-OFFD-DATE-TIME TO SAVE-PREV-TU-TIME
147200        ELSE
147300           MOVE P925-MTOD             TO EMP-PREV-DUTY-MTOD
199800*CNLD-302 B COMMENTING
147400**** 331E - IF CHANGING MTOD AND ADJ TU,  GET RID OF OLD RECORD
147500*           IF EMP-MTOD              > P925-MTOD-DATE-TIME AND
147600*                                    > P920-EMP-OFFD-DATE-TIME
147700*              PERFORM P1150-CHECK-FOR-IMPOSED-REST
147800*           END-IF
199800*CNLD-302 E
147900           MOVE P925-MTOD-DATE-TIME   TO EMP-MTOD
148000                                         EMP-TRACK-MTOD-DATE-TIME
148100           SET  MSTR-MTOD-CAN-ADJUST  TO TRUE
148200           MOVE P925-MTOD-AMT         TO EMP-LAST-MTOD-AMT
148300           MOVE P920-EMP-OFFD-DATE-TIME TO LAST-TIE-UP-TIME
148400                                           LAST-ARRIVAL-TIME
148500        END-IF
148600*CNC0600 - RJA - B  PERFORM P2030 FOR P920-ADJ-TIE-AFTER-ON-DUTY
148700        IF WS-CAN-WRR-NEW
148800           MOVE EMP-NBR OF WS-MSTR    TO MSTR3NBRK
148900           PERFORM P8565-READ-UPDATE-MSTR3
149000           IF NOT SUCCESS
149100              MOVE 'P1100-10' TO ERR-PARAGRAPH
149200              MOVE MSTR3NBRK TO ERR-KEY
149300              PERFORM P9999-GOT-PROBLEM
149400           END-IF
149500           PERFORM P2030-COMPUTE-RESET-BREAK
149600           PERFORM P8570-REWRITE-MSTR3
149700           IF NOT SUCCESS
149800              MOVE 'P1100-11' TO ERR-PARAGRAPH
149900              MOVE MSTR3NBRK TO ERR-KEY
150000              PERFORM P9999-GOT-PROBLEM
150100           END-IF
150200        END-IF
150300*CNC0600 - RJA - E
150400        PERFORM P8550-REWRITE-MASTER
150500     END-IF
150600     SET NOT-NEW-TO-PLACE       TO TRUE
150700     MOVE ZERO                  TO WS-LAYOFF-HISTORY-CODE
150800     MOVE P920-ASGN-ON-DUTY-EMP TO MSTRNBRK
150900     IF  (P920-CANCEL-FUNCTION
151000           AND P920-CAN-ANNULL-JOB) OR
151100          P920-ADJ-TIE-AFTER-ON-DUTY
151200        PERFORM P8500-READ-MASTER
151300*CNC0600 - RJA - SHOULD WE VERIFY  "PROJ RESET VOID" LOGIC THAT WE
151400*CNC0600 - RJA - DO FOR CC/RL FOR ANNULL AS WELL??
151500     ELSE
151600        PERFORM P8520-READ-MASTER-UPDATE
151700        IF NOT SUCCESS
151800           MOVE 'P1100-17' TO ERR-PARAGRAPH
151900           MOVE MSTRNBRK TO ERR-KEY
152000           PERFORM P9999-GOT-PROBLEM
152100        END-IF
152200        MOVE SPACE TO WS-PROCESS-QUAL-FLAG
152300        IF NOT P920-ADJ-TIE-UP-FUNCTION
152400           IF  NORMAL-ASGNMT    NOT > SPACE
152500           AND TEMPORARY-ASGNMT NOT > SPACE
152600           AND P920-ASGN-IS-HOME
152700              IF UNAVAILABLE-LAST-FLAG > SPACES
152800                 AND NOT HOLD-ASGN-DH-F-NOTICE
152900                 MOVE UNAVAILABLE-LAST-FLAG   TO LAYOFF-CODE-1
153000                 MOVE MSTR-LAST-STATUS-REASON TO LAYOFF-EM-CODE
153100                 MOVE SPACES            TO UNAVAILABLE-LAST-FLAG
153200                                           MSTR-LAST-STATUS-REASON
153300                 SET PROCESS-QUAL        TO TRUE
153400                 SET LAYOFF-HISTORY      TO TRUE
153500                 IF FURLOUGHED OF LAYOFF-CODE-1
153600*                     '- EMP IS FURLOUGHED'
153700                    MOVE 'E092'          TO MSGLOG-CODE
153800                 ELSE
153900                    IF TO-PLACE OF LAYOFF-CODE-1
154000                       SET NEW-TO-PLACE     TO TRUE
154100                       MOVE WS-PRESENT-TIME TO LAYOFF-TIME
154200*                      '- EMPLOYEE TO-PLACE'
154300                       MOVE 'E093'       TO MSGLOG-CODE
154400                    ELSE
154500*                      '- EMP RETURNED TO AN UNAVAILABLE STATUS'
154600                       MOVE 'E140'       TO MSGLOG-CODE
154700                    END-IF
154800                 END-IF
154900              ELSE
155000                 IF NOT HOLD-ASGN-DH-F-NOTICE
155100                    SET NEW-TO-PLACE     TO TRUE
155200                    SET TO-PLACE OF LAYOFF-CODE-1 TO TRUE
155300                    MOVE WS-PRESENT-TIME TO LAYOFF-TIME
155400*                        '- EMPLOYEE TO-PLACE'
155500                    MOVE 'E093'          TO MSGLOG-CODE
155600                 END-IF
155700              END-IF
155800           ELSE
155900              IF P920-ASGN-IS-HOME
156000                 IF UNAVAILABLE-LAST-FLAG > SPACES
156100                    AND NOT HOLD-ASGN-DH-F-NOTICE
156200                    MOVE UNAVAILABLE-LAST-FLAG
156300                                            TO LAYOFF-CODE-1
156400                    MOVE MSTR-LAST-STATUS-REASON TO LAYOFF-EM-CODE
156500                    MOVE SPACES         TO UNAVAILABLE-LAST-FLAG
156600                                           MSTR-LAST-STATUS-REASON
156700                    SET LAYOFF-HISTORY   TO TRUE
156800                    SET PROCESS-QUAL     TO TRUE
156900                    IF FURLOUGHED OF LAYOFF-CODE-1
157000*                        '- EMP IS FURLOUGHED'
157100                       MOVE 'E092'       TO MSGLOG-CODE
157200                    ELSE
157300                       IF TO-PLACE OF LAYOFF-CODE-1
157400                          SET NEW-TO-PLACE   TO TRUE
157500                          MOVE WS-PRESENT-TIME TO LAYOFF-TIME
157600*                         '- EMPLOYEE TO-PLACE'
157700                          MOVE 'E093'    TO MSGLOG-CODE
157800                       ELSE
157900*                        '- EMP RETURNED TO AN UNAVAILABLE STATUS'
158000                          MOVE 'E140'    TO MSGLOG-CODE
158100                       END-IF
158200                    END-IF
158300                 END-IF
158400              END-IF
158500              IF WORKING OF LAYOFF-CODE-1
158600*
158700*                PUT EMPLOYEE IN TO-PLACE STATUS IF HIS TEMP ASGN
158800*                WAS CUT WHILE HE WAS ON-DUTY AND HE IS TIEING UP
158900*                AT HOME.
159000*
159100                 IF P920-ASGN-IS-HOME
159200                    AND NOT-NOTIFIED
159300                    AND NORMAL-ASGNMT > SPACE
159400                    SET TO-PLACE OF LAYOFF-CODE-1  TO TRUE
159500                    SET NEW-TO-PLACE               TO TRUE
159600                    MOVE WS-PRESENT-TIME           TO LAYOFF-TIME
159700*                       '- EMPLOYEE TO-PLACE'
159800                    MOVE 'E093'                    TO MSGLOG-CODE
159900                 ELSE
160000                    SET AVAILABLE OF LAYOFF-CODE-1 TO TRUE
160100                 END-IF
160200              END-IF
160300           END-IF
160400        END-IF
160500        IF P920-ASGN-IS-HOME AND NOT SAVE-ON-DUTY
160600           MOVE SPACES                 TO EMP-EXTENDED-RUN-INFO
160700        ELSE
160800           IF NOT P920-CANCEL-FUNCTION
160900              SET EMP-ON-EXTENDED-RUN  TO TRUE
161000           END-IF
161100        END-IF
161200        IF P925-CALC-PERS-REST
161300           MOVE P925-PERS-REST-DATE-TIME TO EMP-PERS-REST
161400        ELSE
161500           IF (P920-CANCEL-FUNCTION AND P920-CANCEL-BUST)
161600              CONTINUE
161700           ELSE
161800              MOVE '0000000000'       TO EMP-PERS-REST
161900           END-IF
162000        END-IF
162100        IF P920-CANCEL-FUNCTION AND
162200          (P920-CANCEL-AFTER-WORK OR P920-CANCEL-AFTER-REPORT)
162300           MOVE SPACES                TO TZ-PARAMETERS
162400           MOVE P920-CAN-DATE-TIME    TO TZ-IN-DATE-TIME
162500           MOVE P920-TIME-ZONE        TO TZ-IN-ZONE
162600           MOVE WS-EMP-TIME-ZONE      TO TZ-OUT-ZONE
162700           PERFORM P8996-TIMEZONE
162800           IF TZ-INVALID-PARAMETERS
162900              MOVE 'E1100TZ'          TO ERR-PARAGRAPH
163000              PERFORM P8996-TZERROR
163100           END-IF
163200           MOVE LAST-TIE-UP-TIME      TO SAVE-PREV-TU-TIME
163300           MOVE TZ-OUT-DATE-TIME      TO LAST-TIE-UP-TIME
163400           MOVE SPACES                TO EMP-ALT-TIE-UP-TIME
163500                                         EMP-ALT-REST-REQUEST
163600           IF P925-CALC-US-HRS-SVC
163700              MOVE P925-US-PREV-DUTY  TO EMP-PREV-DUTY
163800              MOVE P925-US-REST-DATE-TIME TO EMP-US-RSTD
163900                                EMP-TRACK-US-RSTD-DATE-TIME
164000           END-IF
164100           IF P925-CALC-CAN-HRS-SVC
164200              MOVE EMP-PREV-DUTY-MTOD TO PREV-MTOD-1
164300              MOVE P925-MTOD          TO EMP-PREV-DUTY-MTOD
164400              MOVE P925-MTOD-DATE-TIME
164500                                      TO EMP-MTOD
164600                                         EMP-TRACK-MTOD-DATE-TIME
164700*CNLD-309 B  COMMENTING
164700*             MOVE P925-MTOY-DATE-TIME
164800*                                     TO EMP-MTOY
164900*             MOVE P925-MTOR-DATE-TIME
165000*                                     TO EMP-MTOR
164700*CNLD-309 E
165100              MOVE P925-MTOD-AMT      TO EMP-LAST-MTOD-AMT
165200           END-IF
165300        END-IF
165400*
165500*CNC0436E JES
165600*
165700        MOVE SPACES                   TO WORK-CNTLKEY
165800        MOVE '2B'                     TO WK-CNTL-REC-TYPE
165900        MOVE DIST OF WS-MSTR          TO WK-CNTL-DIST
166000        MOVE SUB-DIST OF WS-MSTR      TO WK-CNTL-SUB-DIST
166100        PERFORM P8640-READ-CNTLFILE
166200        IF NOT SUCCESS
166300           MOVE 'P1100-1'             TO ERR-PARAGRAPH
166400           MOVE CNTLKEY               TO ERR-KEY
166500           PERFORM P9999-GOT-PROBLEM
166600        END-IF
166700        MOVE CNTL-2B-AFHT-LODGE-PROC-FL TO WS-AFHT-LODGE-FL
166800*
166900*CNC0436B JES
167000*
167100        IF WS-AFHT-LODGE-NEW
167200           MOVE SPACES                TO FACILITY-999-DELETED-FL
167300                                         LVE-RECORD-EXISTS-FL
167400                                         WS-DELETED-STATION
167500           INITIALIZE WS-LVE-TABLE
167600           MOVE EMP-NBR OF WS-MSTR    TO LVE-EMP-NBR
167700           PERFORM PSQL-LVESEL01
167800           IF SQL-SUCCESS
167900              SET LVE-RECORD-EXISTS   TO TRUE
168000           ELSE
168100              MOVE SPACES             TO LVE-EMP-NBR
168200                                         LVE-FCLTY-CD
168300                                         LVE-LDG-STN
168400           END-IF
168500        END-IF
168600        IF P920-TIE-UP-FUNCTION OR
168700           P920-ADJ-TIE-UP-FUNCTION
168800*CNC0436B JES  CHANGE PAGER-NO(ROOM NBR) FROM WSMSTR TO LVE-TABLE
168900           MOVE P920-EMP-ROOM-NBR     TO PAGER-NO
169000*          IF WS-AFHT-LODGE-NEW
169100*             IF LVE-RECORD-EXISTS
169200*                IF P920-EMP-ROOM-NBR > SPACES
169300*                   MOVE P920-EMP-ROOM-NBR TO LVE-ROOM-NBR
169400*                   PERFORM PSQL-LVEUPD01
169500*                END-IF
169600*             ELSE
169700*                MOVE EMP-NBR OF WS-MSTR TO LVE-EMP-NBR
169800*                MOVE '000'           TO LVE-FCLTY-CD
169900*                MOVE '99999'         TO LVE-LDG-STN
170000*                MOVE P920-EMP-ROOM-NBR TO LVE-ROOM-NBR
170100*                PERFORM PSQL-LVEINS01
170200*             END-IF
170300*          END-IF
170400*------------------------------------------------------------*
170500*           CONVERT FROM P920-TIME-ZONE TO EMP-TIMEZONE      *
170600*------------------------------------------------------------*
170700           MOVE SPACES                TO TZ-PARAMETERS
170800           MOVE P920-ARR-DATE-TIME    TO TZ-IN-DATE-TIME
170900           MOVE P920-TIME-ZONE        TO TZ-IN-ZONE
171000           MOVE WS-EMP-TIME-ZONE      TO TZ-OUT-ZONE
171100           PERFORM P8996-TIMEZONE
171200           IF TZ-INVALID-PARAMETERS
171300              MOVE 'D1100TZ'          TO ERR-PARAGRAPH
171400              PERFORM P8996-TZERROR
171500           END-IF
171600           MOVE TZ-OUT-DATE-TIME      TO LAST-ARRIVAL-TIME
171700*
171800           MOVE SPACES                TO TZ-PARAMETERS
171900           MOVE P920-EMP-OFFD-DATE-TIME TO TZ-IN-DATE-TIME
172000           MOVE P920-TIME-ZONE        TO TZ-IN-ZONE
172100           MOVE WS-EMP-TIME-ZONE      TO TZ-OUT-ZONE
172200           PERFORM P8996-TIMEZONE
172300           IF TZ-INVALID-PARAMETERS
172400              MOVE 'E1100TZ'          TO ERR-PARAGRAPH
172500              PERFORM P8996-TZERROR
172600           END-IF
172700           MOVE LAST-TIE-UP-TIME      TO SAVE-PREV-TU-TIME
172800           MOVE TZ-OUT-DATE-TIME      TO LAST-TIE-UP-TIME
172900*
173000*          WS-SCHED-END-DATE-TIME IS THE NORMALLY SCHEDULED END
173100*          TIME FOR A YARD OR COMMUTER JOB IN A SUB-DIST THAT
173200*          USES ALT REST/BOARD PLACEMENT.
173300*
173400           IF WS-SCHED-END-DATE-TIME > SPACES
173500              MOVE SPACES                  TO TZ-PARAMETERS
173600              MOVE WS-SCHED-END-DATE-TIME  TO TZ-IN-DATE-TIME
173700              MOVE P920-TIME-ZONE          TO TZ-IN-ZONE
173800              MOVE WS-EMP-TIME-ZONE        TO TZ-OUT-ZONE
173900              PERFORM P8996-TIMEZONE
174000              IF TZ-INVALID-PARAMETERS
174100                 MOVE 'E1100TZ'            TO ERR-PARAGRAPH
174200                 PERFORM P8996-TZERROR
174300              END-IF
174400              MOVE TZ-OUT-DATE-TIME        TO EMP-ALT-TU-DATE-TIME
174500              MOVE EMP-ALT-TU-DATE         TO DE-YYMMDD
174600              SET DE-YYMMDD-FORMAT         TO TRUE
174700              SET DE-REFORMAT-ONLY         TO TRUE
174800              MOVE SPACE                   TO DE-STATUS-FLAG
174900              PERFORM P8998-DATEEDIT
175000              MOVE DE-YYMMDD-CE            TO EMP-ALT-TU-CE
175100              IF P920-EMP-PERS-REST-CLMD > '0000'
175200                 MOVE P920-EMP-PERS-REST-CLMD
175300                                       TO EMP-ALT-REST-REQUEST
175400              ELSE
175500                 MOVE SPACES           TO EMP-ALT-REST-REQUEST
175600              END-IF
175700           ELSE
175800              MOVE SPACES              TO EMP-ALT-TIE-UP-TIME
175900                                          EMP-ALT-REST-REQUEST
176000           END-IF
176100*
176200           IF P925-CALC-US-HRS-SVC
176300              MOVE P925-US-PREV-DUTY  TO EMP-PREV-DUTY
176400              MOVE P925-US-PREV-TOT-DUTY  TO WS-US-PREV-TOT-DUTY
176500              MOVE P925-US-REST-DATE-TIME TO EMP-US-RSTD
176600                                EMP-TRACK-US-RSTD-DATE-TIME
176700           END-IF
176800           IF P925-CALC-CAN-HRS-SVC
176900              MOVE EMP-PREV-DUTY-MTOD TO PREV-MTOD-1
177000              MOVE P925-MTOD          TO EMP-PREV-DUTY-MTOD
199800*CNLD-302 B COMMENTING
177100**** 331E - IF CHANGING MTOD AND ADJ TU,  GET RID OF OLD RECORD
177200****        (CHANGED ">" CONDITION TO "NOT =" - THE ASSUMPTION
177300****         IS THAT WE'RE ADJUSTING THE CURRENT MTOD AND WANT
177400****         TO TRIGGER P1150 IF WE ARE).
177500*              IF P920-ADJ-TIE-UP-FUNCTION AND
177600**                EMP-MTOD             > P925-MTOD-DATE-TIME AND
177700**                                     > P920-EMP-OFFD-DATE-TIME
177800*                 EMP-MTOD          NOT = P925-MTOD-DATE-TIME
177900*                 PERFORM P1150-CHECK-FOR-IMPOSED-REST
178000*              END-IF
199800*CNLD-302 E
178100              MOVE P925-MTOD-DATE-TIME
178200                                      TO EMP-MTOD
178300                                         EMP-TRACK-MTOD-DATE-TIME
178400*C1091-BEG
178500                                         P920-SAVE-EMP-MTOD
178600*C1091-END
178700              SET MSTR-MTOD-CAN-ADJUST TO TRUE
164700*CNLD-309 B  COMMENTING
178800*             MOVE P925-MTOY-DATE-TIME
178900*                                     TO EMP-MTOY
179000*             MOVE P925-MTOR-DATE-TIME
179100*                                     TO EMP-MTOR
164700*CNLD-309 E
179200              MOVE P925-MTOD-AMT      TO EMP-LAST-MTOD-AMT
179300           END-IF
179400           MOVE P920-EMP-HOME-ONLY    TO EMP-HOME-ONLY-FLAG
179500           IF P920-TIE-UP-FUNCTION
179600              MOVE P926-ASGN-HIST-KEY TO AH1KEY
179700              PERFORM P8700-READ-AHIST
179800              IF SUCCESS
179900                 MOVE P926-TIE-UP-CC  TO WS-CRAFT-CODE-CHECK
180000                 MOVE ' '             TO EMP-LAST-TOUR-FLAG
180100                 IF ENGINE-CRAFT
180200                    IF AH-EN-REST-REQ NOT = 'N'
180300                       SET EMP-LAST-TOUR-OUT-OF-BOX
180400                                          TO TRUE
180500                    END-IF
180600                 ELSE
180700                    IF AH-TR-REST-REQ NOT = 'N'
180800                       SET EMP-LAST-TOUR-OUT-OF-BOX
180900                                          TO TRUE
181000                    END-IF
181100                 END-IF
181200              ELSE
181300                 MOVE 'P1100-18'      TO ERR-PARAGRAPH
181400                 MOVE AH1KEY          TO ERR-KEY
181500                 PERFORM P9999-GOT-PROBLEM
181600              END-IF
181700           END-IF
181800        ELSE
181900           IF SAVE-PREV-ODT IS NUMERIC
182000              MOVE SAVE-PREV-ODT      TO LAST-ON-DUTY-TIME
182100*C842         DO NOT UPDATE THE EMP-PREV-DUTY WITH SAVE-PREV-DUTY
182200*             SINCE THE LATEST VALUE IS ALREADY POPULATED FROM
182300*             FROM P925 IN THE TOP PART OF THIS PARAGRAPH
182400              IF P920-CANCEL-FUNCTION AND
182500                (P920-CANCEL-AFTER-WORK OR
182600                 P920-CANCEL-AFTER-REPORT)
182700                CONTINUE
182800              ELSE
182900                MOVE SAVE-PREV-DUTY     TO EMP-PREV-DUTY
183000              END-IF
183100           END-IF
183200        END-IF
183300*
183400*CNC0436B JES
183500*
183600        IF WS-AFHT-LODGE-NEW
183700           MOVE EMP-NBR OF WS-MSTR    TO TELE-EMP-NBR
183800                                            TELENBRK
183900           MOVE SPACE                 TO TELE-RESPONSE
184000           PERFORM P8200-READ-TELE-UPDATE
184100*C912
184200           IF SUCCESS
184300              SET TELE-SUCCESS        TO TRUE
184400           END-IF
184500*C983-BEG  MOVED EXISTING LOGIC TO P1300 AND MODIFIED FOR C983
184600           PERFORM P1300-UPDATE-LVE
184700*C983-END
184800           IF TELE-SUCCESS
184900              PERFORM P8210-REWRITE-TELE
185000           END-IF
185100           IF FACILITY-999-DELETED
185200              MOVE WS-DELETED-STATION TO LVE-LDG-STN
185300              MOVE '999'           TO LVE-FCLTY-CD
185400              PERFORM PSQL-LVECNT01
185500              IF NOT SQL-SUCCESS
185600                 MOVE WS-DELETED-STATION TO LVP-LDG-STN
185700                 MOVE '999'        TO LVP-FCLTY-CD
185800                 PERFORM PSQL-LVPDEL
185900              END-IF
186000           END-IF
186100        END-IF
186200        IF NOT P920-CANCEL-FUNCTION
186300           AND P920-ASGN-IS-HOME
186400           MOVE SPACES             TO PAGER-NO
186500        END-IF
186600*
186700*       RESET CONSECUTIVE MISSED CALL COUNTER
186800*
186900        IF P920-TIE-UP-FUNCTION
187000           MOVE ZEROS                 TO MSTR-CONS-MISSED-CALLS
187100        END-IF
187200        IF  P920-CANCEL-FUNCTION
187300        AND P920-CANCEL-BUST
187400           CONTINUE
187500        ELSE
187600           MOVE P920-ASGN-ASGN        TO JOB-DEF-CHECK
187700           IF P920-ASGN-UFP
187800              SET EMP-LAST-SVC-ROAD   TO TRUE
187900           ELSE
188000*CNC0562 - BEG
188100              IF JOB-DEF-RELIEF-ASGN
188200                 IF WORK-AH-POOL       = JOB-DEF-LOCAL-POOL
188300                    SET EMP-LAST-SVC-ROAD TO TRUE
188400                 ELSE
188500                    SET EMP-LAST-SVC-YARD TO TRUE
188600                 END-IF
188700              ELSE
188800*CNC0562 - END
188900                 IF  JOB-DEF-LOCAL-ASGN
189000                 OR (JOB-DEF-CHECK(1:2) = 'EX'
189100                 AND P920-FINAL-STATION > SPACES)
189200                    SET EMP-LAST-SVC-ROAD TO TRUE
189300                 ELSE
189400                    SET EMP-LAST-SVC-YARD TO TRUE
189500                 END-IF
189600              END-IF
189700           END-IF
189800        END-IF
189900
190000        IF P920-IVR-CANCEL
190100*          SEE IF EMPLOYEE HAS A NOT-NOTIFIED OR A
190200*          NOT-NOTIFIED-AWARD BEFORE YOU CHANGE LAYOFF-CODE-2
190300*          BACK TO A '0'
190400*
190500           PERFORM P4000-SEEK-TASK-FOR-NOT-NTFY
190600           IF REG-NTFY-FOUND
190700              SET NOT-NOTIFIED           TO TRUE
190800           ELSE
190900              IF AWARD-NTFY-FOUND
191000                 SET NOT-NOTIFIED-AWARD  TO TRUE
191100              ELSE
191200                 SET NORMAL              TO TRUE
191300              END-IF
191400           END-IF
191500        END-IF
191600*CNC0600 - RJA - B
191700        IF WS-CAN-WRR-NEW
191800           EVALUATE TRUE
191900*             WHEN P920-ADJ-TIE-AFTER-ON-DUTY
192000*              **P2030 IS PERFORMED ELSEWHERE FOR THIS CONDITION**
192100              WHEN P920-TIE-UP-FUNCTION OR
192200                   P920-ADJ-TIE-UP-FUNCTION
192300              WHEN P920-CANCEL-FUNCTION AND
192400                   (P920-CANCEL-AFTER-WORK OR
192500                    P920-CANCEL-AFTER-REPORT)
192600*                  UPDATE MSTR3-PROJ VALUES(P2030)
192700                   MOVE EMP-NBR OF WS-MSTR  TO MSTR3NBRK
192800                   PERFORM P8565-READ-UPDATE-MSTR3
192900                   IF NOT SUCCESS
193000                      MOVE 'P1100-12' TO ERR-PARAGRAPH
193100                      MOVE MSTR3NBRK  TO ERR-KEY
193200                      PERFORM P9999-GOT-PROBLEM
193300                   END-IF
193400                   PERFORM P2030-COMPUTE-RESET-BREAK
193500                   PERFORM P8570-REWRITE-MSTR3
193600                   IF NOT SUCCESS
193700                      MOVE 'P1100-13' TO ERR-PARAGRAPH
193800                      MOVE MSTR3NBRK  TO ERR-KEY
193900                      PERFORM P9999-GOT-PROBLEM
194000                   END-IF
194100              WHEN OTHER
194200*                  IF TRAIN IS CANCELED WITH CC/RL:
194300                   MOVE EMP-NBR OF WS-MSTR    TO MSTR3NBRK
194400                   PERFORM P8565-READ-UPDATE-MSTR3
194500                   IF NOT SUCCESS
194600                      MOVE 'P1100-23' TO ERR-PARAGRAPH
194700                      MOVE MSTR3NBRK  TO ERR-KEY
194800                      PERFORM P9999-GOT-PROBLEM
194900                   END-IF
195000                   MOVE SPACES        TO WS-RESET-VOID-FL
195100                   IF MSTR3-PREV-7DAY-END-CH > '0000000000'
195200*
195300* NOTE: 1. MSTR3-PREV-7DAY-END SHOULD BE SPACED ONLY AT TIE-UP
195400*          OR TIE-UP EQUIVALENT ACTIVITY.
195500*       2. ON THE FIRST CALL AFTER A NATURAL RESET BREAK,
195600*          MSTR3-7DAY-END IS MOVED TO MSTR3-PREV-7DAY-END.
195700*          THEN, NEW MSTR3-7DAY-END IS COMPUTED.
195800*       3. MSTR3-PREV-7DAY-END IS USED TO RESTORE MSTR3-7DAY-END
195900*          WHEN THE FIRST CALL AFTER A NATURAL RESET BREAK
196000*          IS CANCELED WITH CC/RL.
196100                      SET RESET-VOID  TO TRUE
196200                      MOVE MSTR3-7DAY-END-PERIOD-CH
196300                                      TO WS-VOIDED-7DAY-END
196400                      MOVE MSTR3-PREV-7DAY-END-CH
196500                                      TO WS-RESTORED-7DAY-END
196600                      IF MSTR3-PREV-7DAY-END-CH = '0000000001'
196700*                        THIS IS TO INDICATE MSTR3-7DAY-END-PERIOD
196800*                        WAS BLANK AT CALL, AND SHOULD NOW BE
196900*                        RESTORED TO SPACES.
197200                         MOVE SPACES  TO WS-RESTORED-7DAY-END
197300                                         MSTR3-PREV-7DAY-END-CH
197400                      END-IF
197500                      MOVE MSTR3-PREV-7DAY-END-CH
197600                                      TO MSTR3-7DAY-END-PERIOD-CH
197700                      MOVE SPACES     TO MSTR3-PREV-7DAY-END-CH
197800                   END-IF
197900                   PERFORM P8570-REWRITE-MSTR3
198000                   IF NOT SUCCESS
198100                      MOVE 'P1100-24' TO ERR-PARAGRAPH
198200                      MOVE MSTR3NBRK  TO ERR-KEY
198300                      PERFORM P9999-GOT-PROBLEM
198400                   END-IF
198500                   IF RESET-VOID
198600*                     DELETE EMPTOD-RESET-BREAK-REC
198700                      IF MSTR3-PROJ-RESET-BRK-CH > '0000000000'
198800                         PERFORM P2040-DEL-RESET-BREAK-ETOD
198900                      END-IF
199000*                     WRITE RESET VOID HISTORY
199100                      PERFORM P2050-WRITE-RESET-VOID-HIST
199200                   END-IF
199300           END-EVALUATE
199400        END-IF
199500*CNC0600 - RJA - E
199600
199700        PERFORM P8550-REWRITE-MASTER
199800*CNLD-302 B COMMENTING
199800*       IF P920-IMPOSED-REST
199900*          PERFORM P2010-UPD-ETOD-IMPOSED-REST
200000*       END-IF
199800*CNLD-302 E
200100     END-IF
200200     IF (P920-CANCEL-FUNCTION
200300        AND P920-CANCEL-BUST) OR
200400        P920-ADJ-TIE-AFTER-ON-DUTY
200500        CONTINUE
200600     ELSE
200700        IF PROCESS-QUAL
200800           AND LAST-TIE-UP-TIME          > '0000000000'
200900           MOVE SPACES                  TO P963-COMMAREA-PARMS
201000           MOVE P920-ASGN-ON-DUTY-EMP   TO P963-EMP-NO
201100           MOVE WS-AVAILABLE            TO P963-FROM-STATUS-CODE
201200*          MOVE WS-FURLOUGHED           TO P963-TO-STATUS-CODE
201300           MOVE LAYOFF-CODE-1           TO P963-TO-STATUS-CODE
201400           MOVE LAST-TIE-UP-TIME        TO P963-EFF-DATE-TIME
201500           SET P963-NOT-US-DOMICILED    TO TRUE
201600           SET P963-DOS-REQUIRED        TO TRUE
201700           EXEC CICS LINK
201800                     PROGRAM(P963-PGM)
201900                     COMMAREA(P963-COMMAREA-PARMS)
202000                     LENGTH(P963-LGTH)
202100                     RESP(WS-RESPONSE)
202200           END-EXEC
202300           MOVE WS-RESPONSE             TO FILE-STATUS
202400           IF NOT SUCCESS
202500              MOVE 'P1100-19'           TO ERR-PARAGRAPH
202600              PERFORM P9999-GOT-PROBLEM
202700           END-IF
202800        END-IF
202900     END-IF
203000     IF EMP-FROM-EM AND SEND-EM-DATA
203100        PERFORM P8990-SEND-TO-EM
203200     END-IF
203300*
203400*
203500*    IF EMPLOYEE IS AT HOME AND ASSIGNED TO A SPAREBOARD
203600*    PLACE THEM BACK ON THE SPAREBOARD
203700*
203800     IF NOT P920-ADJ-TIE-AFTER-ON-DUTY
203900        IF P920-ASGN-IS-HOME
204000        OR EMP-IS-HOME
204100           IF (TEMP-ASGN-XB
204200              OR (NORM-ASGN-XB AND TEMPORARY-ASGNMT NOT > SPACE))
204300              AND AVAILABLE
204400              AND NORMAL
204500              AND NOT SAVE-ON-DUTY
204600              PERFORM P8010-PUT-TURN-ON-XBRD
204700           ELSE
204800              IF TEMP-ASGN-UFP OR
204900                 (NORM-ASGN-UFP AND TEMPORARY-ASGNMT NOT > SPACE)
205000                 PERFORM P1140-UPDATE-CARRIED-TURNS
205100              END-IF
205200           END-IF
205300        END-IF
205400     END-IF
205500*CNC0484
205600     MOVE SPACES                     TO WS-APPLY-OVERTIME-FLAG
205700     IF P920-ADJ-TIE-UP-FUNCTION
205800        PERFORM P1103-CHECK-OFF-DUTY-CHANGE
205900     END-IF
206000*
206100*
206200*    WRITE HSL FOR THE CURRENT TOUR OF DUTY
206300*
206400     IF P920-TIE-UP-FUNCTION OR
206500        WS-APPLY-OVERTIME-YES
206600        MOVE SPACES                  TO WS-FRD-STORAGE
206700        IF WS-RESPITE-FROM-DTTM       > ZEROES
206800           SET WS-APPLY-PREV-HOURS-YES TO TRUE
206900           PERFORM P1101R-BUILD-RESPITE-HSL
207000        ELSE
207100           INITIALIZE                   PS93-COMMAREA-PARMS
207200           SET WS-APPLY-PREV-HOURS-YES TO TRUE
207300           MOVE AHM-EMP-OD-DATE-TIME
207400                                     TO WS-PS93-START-DTTM
207500                                        WS-PS93-START-DTTM-HSD
207600           MOVE P920-EMP-OFFD-DATE-TIME     TO WS-PS93-END-DTTM
207700           MOVE 'Y'                  TO PS93-HOS-FL
207800           MOVE '1'                  TO PS93-EVENT-CD
207900           PERFORM P1101-BUILD-HSL-FOR-CURR-TOUR
208000        END-IF
208100        MOVE EMP-NBR OF WS-MSTR      TO FRD-EMP-NBR
208200        MOVE AHM-EMPLOYEE-KEY        TO FRD-AHM-EMP-KEY
208300        MOVE AHM-AHIST-KEY           TO FRD-AHIST-KEY
208400        MOVE +1                      TO FRD-TRN-SEQ-NBR
208500                                        FRD-SEQ-NBR
208600        PERFORM PSQL-FRDOPN
208700        PERFORM PSQL-FRDFET
208800        PERFORM UNTIL NOT SQL-SUCCESS
208900            IF FRD-ACT-CD = 'OT'
209000               PERFORM P1101B-CERTIFY-FRD
209100            END-IF
209200            PERFORM PSQL-FRDFET
209300        END-PERFORM
209400        PERFORM PSQL-FRDCLO
209500     END-IF
209600*CNC0496
209700     PERFORM P1101E-BUILD-HSD-LOC
209800*
209900*    CERTIFY RECORDS IN CASE OF ADJ TIE UP
210000     IF P920-ADJ-TIE-AFTER-ON-DUTY
210100*       CERTIFY CURRENT TOUR OF DUTY
210200        PERFORM P1101A-CERTIFY-TOD
210300*       CERTIFY OT EVENTS
210400        MOVE EMP-NBR OF WS-MSTR   TO FRD-EMP-NBR
210500        MOVE AHM-EMPLOYEE-KEY     TO FRD-AHM-EMP-KEY
210600        MOVE AHM-AHIST-KEY        TO FRD-AHIST-KEY
210700        MOVE +1                   TO FRD-TRN-SEQ-NBR
210800                                     FRD-SEQ-NBR
210900        PERFORM PSQL-FRDOPN
211000        PERFORM PSQL-FRDFET
211100        PERFORM UNTIL NOT SQL-SUCCESS
211200            IF FRD-ACT-CD = 'OT'
211300               PERFORM P1101B-CERTIFY-FRD
211400            END-IF
211500            PERFORM PSQL-FRDFET
211600        END-PERFORM
211700        PERFORM PSQL-FRDCLO
211800     END-IF
211900*
212000*    WRITE THE EMPLOYEE HISTORY RECORD
212100*
212200     MOVE SPACES                  TO P943-COMMAREA-PARMS
212300     MOVE EMP-NBR OF WS-MSTR      TO P943-EMP-NBR
212400     IF P920-TIE-UP-FUNCTION
212500        SET P943-TIE-UP-FUN       TO TRUE
212600        IF P920-QUICK-TIE-UP OR
212700           P920-QUICK-TIE-SHFT-CALL
212800           SET P943-FUN02-QUICK-TIE  TO TRUE
212900        END-IF
213000     ELSE
213100        IF P920-ADJ-TIE-UP-FUNCTION
213200           SET P943-ADJ-TIE-UP-FUN TO TRUE
213300        ELSE
213400           SET P943-CALL-REL-FUN  TO TRUE
213500        END-IF
213600     END-IF
213700     MOVE CRAFT OF WS-MSTR        TO P943-CRAFT
213800     MOVE LAYOFF-CODE             TO P943-LO
213900     MOVE P920-ASGN-MERG-CLASS    TO P943-ASGN-MERG-CLASS
214000*
214100     IF P920-ASGN-UFP
214200        IF P920-CANCEL-FUNCTION
214300           MOVE P920-ASGN-DIST           TO P943-DIST
214400           MOVE P920-ASGN-SUB-DIST       TO P943-SDIST
214500           MOVE P920-ASGN-POOL           TO P943-POOL-ASG
214600           MOVE '0'                      TO P943-IN-OUT
214700           IF NOT P920-ASGN-IS-HOME
214800              MOVE P920-ASGN-PARM        TO UFPTURN
214900              PERFORM P8600-READ-UFPTURN
215000              IF SUCCESS
215100                 MOVE DIST OF WS-UFP     TO P943-DIST
215200                 MOVE SUB-DIST OF WS-UFP TO P943-SDIST
215300                 MOVE IN-OUT-TERMINAL    TO P943-IN-OUT
215400              END-IF
215500           END-IF
215600        ELSE
215700           MOVE P920-TIE-UP-TO-DIST     TO P943-DIST
215800           MOVE P920-TIE-UP-TO-SUB-DIST TO P943-SDIST
215900           MOVE P920-TIE-UP-TO-POOL     TO P943-POOL-ASG
216000           MOVE P920-TIE-UP-TO-TERM     TO P943-IN-OUT
216100        END-IF
216200     ELSE
216300        MOVE P920-ASGN-PARM             TO AJJOBKEY-AREA
216400        MOVE AJ-JOB-DIST                TO P943-DIST
216500        MOVE AJ-JOB-SUB-DIST            TO P943-SDIST
216600        MOVE AJ-JOB-ASGN-ID             TO JOB-DEF-CHECK
216700*CNC0562-BEG
216800        IF JOB-DEF-RELIEF-ASGN
216900           MOVE WORK-AH-POOL            TO P943-POOL-ASG
217000        ELSE
217100*CNC0562-END
217200           IF  JOB-DEF-LOCAL-ASGN
217300           OR (JOB-DEF-CHECK(1:2) = 'EX'
217400           AND P920-FINAL-STATION > SPACES)
217500              MOVE JOB-DEF-LOCAL-POOL   TO P943-POOL-ASG
217600           ELSE
217700              MOVE JOB-DEF-YARD-POOL    TO P943-POOL-ASG
217800           END-IF
217900*CNC0562-BEG
218000        END-IF
218100*CNC0562-END
218200        MOVE '0'                        TO P943-IN-OUT
218300        IF AJ-SCH-DURATION NUMERIC
218400           AND AJ-SCH-DURATION > '0000'
218500           MOVE AJ-SCH-DURATION   TO P943-FUN02-AJ-SCH-DURATION
218600        ELSE
218700           MOVE '0800'            TO P943-FUN02-AJ-SCH-DURATION
218800        END-IF
218900     END-IF
219000     MOVE P926-AH-TRAIN               TO P943-TEMP-ASGN-TRAIN
219100     IF P920-TIE-UP-FUNCTION OR
219200        P920-ADJ-TIE-UP-FUNCTION
219300*-C472-----------------------------------------------------------*
219400* CONVERT FROM P920-TIMEZONE   TO  TIMEZONE OF JOB.   GER 9/24/03*
219500*----------------------------------------------------------------*
219600        PERFORM P8993-GET-ASGN-TIMEZONE
219700        IF P920-TIME-ZONE NOT = WS-ASG-TIME-ZONE
219800           PERFORM P8994-CONVERT-HIST-TIMEZONE
219900        ELSE
220000           MOVE P920-EMP-OFFD-DATE-TIME  TO P943-EFF-DATE-TIME
220100        END-IF
220200*----------------------------------------------------------------*
220300        MOVE P920-ARR-DATE-TIME       TO P943-FUN02-ARR-DATE-TIME
220400        MOVE P926-ASGN-HIST-KEY       TO P943-FUN02-XREF-KEY
220500        MOVE P920-EMP-MILES-CLMD      TO P943-FUN02-MILES
220600        MOVE P920-EMP-PERS-REST-CLMD  TO P943-FUN02-ADD-REST-HRMN
220700        MOVE P920-TIE-UP-CC           TO P943-TEMP-ASGN-CC
220800        IF P920-ASGN-IS-HOME AND NOT SAVE-ON-DUTY
220900           SET P943-TIED-AT-HOME      TO TRUE
221000        ELSE
221100           SET P943-TIED-AWAY         TO TRUE
221200        END-IF
199800*CNLD-302 B COMMENTING
221300*       IF P920-IMPOSED-REST
221400*          SET P943-ADD-MAN-REST      TO TRUE
221500*       END-IF
199800*CNLD-302 E
221600     ELSE
221700        MOVE P920-CAN-DATE-TIME       TO P943-EFF-DATE-TIME
221800        MOVE P926-ASGN-HIST-KEY       TO P943-FUN04-XREF-KEY
221900        MOVE P920-CANCEL-TYPE         TO P943-FUN04-TYPE
222000        MOVE P920-CAN-REST-CLMD       TO P943-FUN04-ADD-REST-HRMN
222100        MOVE P920-CAN-CC              TO P943-TEMP-ASGN-CC
222200        IF P920-ASGN-IS-HOME
222300           SET P943-FUN04-CAN-AT-HOME TO TRUE
222400        ELSE
222500           SET P943-FUN04-CAN-AWAY    TO TRUE
222600        END-IF
222700     END-IF
222800
222900     IF TEMPORARY-ASGNMT > SPACES
223000        MOVE TEMPORARY-ASGNMT  TO P943-NORM-ASGN
223100     ELSE
223200        MOVE NORMAL-ASGNMT     TO P943-NORM-ASGN
223300     END-IF
223400     IF P943-DIST NOT > SPACES
223500        MOVE P943-NA-DIST      TO P943-DIST
223600        MOVE P943-NA-SUB-DIST  TO P943-SDIST
223700     END-IF
223800     IF P920-HAVE-TEMP-EMP
223900        IF P920-ASGN-TEMP-EMP NOT = P943-EMP-NBR
224000           MOVE P920-ASGN-TEMP-EMP TO P943-EMP-NBR-AFFECTED
224100           SET P943-NOT-REG-EMP TO TRUE
224200        END-IF
224300     ELSE
224400        IF P920-HAVE-OWNER
224500           IF P920-ASGN-OWNER NOT = P943-EMP-NBR
224600              MOVE P920-ASGN-OWNER TO P943-EMP-NBR-AFFECTED
224700              SET P943-NOT-REG-EMP TO TRUE
224800           END-IF
224900        ELSE
225000           MOVE '999999998'   TO P943-EMP-NBR-AFFECTED
225100           SET P943-NOT-REG-EMP TO TRUE
225200        END-IF
225300     END-IF
225400     IF P920-ADJ-TIE-UP-FUNCTION
225500        IF WS-ALT-REST-PLACEMENT > SPACES
225600           MOVE WS-ALT-REST-PLACEMENT TO P943-ALT-REST-PLACEMENT
225700        ELSE
225800           SET P943-NO-ALT-REST-PLACE TO TRUE
225900        END-IF
226000     END-IF
226100
226200     IF P920-IVR-CANCEL AND
226300        P943-CALL-REL-FUN
226400        SET P943-FUN04-CALL-FR-IVR TO TRUE
226500     END-IF
226600
226700     IF P920-CANCEL-FUNCTION
226800        AND P920-IVR-CMC-CALL
226900        CONTINUE
227000     ELSE
227100        PERFORM P8900-WRITE-HISTORY
227200*CNC0600-CNLD-208-B
227300        IF P925-MTOD-DATE > P925-OD-DATE
227400       AND P925-MTOD      > '1600'
227500           PERFORM P1156-WRITE-MTOD-UPD-HIST
227600        END-IF
227700*CNC0600-CNLD-208-E
227800     END-IF
227900
228000     IF LAYOFF-HISTORY
228100        PERFORM P1130-WRITE-LAYOFF-HISTORY
228200     END-IF
228300
228400     IF P920-TIE-UP-FUNCTION
228500        PERFORM P1120-CHECK-QUALIFICATIONS
228600        IF PAY-AS-US
228700           PERFORM P7100-TABLE-US-STEP-RATES
228800           IF WS-US-QUALIFICATION(1) > SPACES
228900              PERFORM P7000-COUNT-US-STEP-RATE-TRIPS
229000           END-IF
229100        END-IF
229200     END-IF
229300*CNC0520-BEG
229400     IF ((P920-TIE-UP-FUNCTION     AND NOT P920-QUICK-TIE-UP)
229500        OR
229600         P920-ADJ-TIE-UP-FUNCTION)
229700        MOVE AHM-KEY            TO WS-SAVE-AHM-KEY
229800        MOVE AHM-AHIST-KEY      TO WS-SAVE-KEY
229900        MOVE SPACES             TO WS-AHIST-MISC
230000        MOVE WS-SAVE-KEY        TO AHM-AHIST-KEY
230100        SET  AHM-PAY-RECORD     TO TRUE
230200        MOVE 01                 TO AHM-PAYROLL-KEY-SEQUENCE
230300        MOVE AHM-KEY            TO AHMKEY
230400        EXEC CICS READ
230500                  GTEQ
230600                  DATASET(AHM-FILE)
230700                  INTO(WS-AHIST-MISC)
230800                  LENGTH(AHM-RLGTH)
230900                  RIDFLD(AHMKEY)
231000                  KEYLENGTH(AHM-KLGTH)
231100                  RESP(WS-RESPONSE)
231200        END-EXEC
231300        MOVE WS-RESPONSE        TO FILE-STATUS
231400        IF SUCCESS
231500           IF AHM-MISC-ROUTE-DESIGNATION > SPACES
231600              MOVE AHM-MISC-ROUTE-DESIGNATION
231700                                TO WS-SAVE-ROUTE-DSGN
231800              IF P920-ADJ-TIE-UP-FUNCTION
231900                 PERFORM P1108-READ-CREW-PROFILE
232000              END-IF
232100              PERFORM P1125-ADD-QUALIFICATIONS
232200           END-IF
232300        END-IF
232400        MOVE WS-SAVE-AHM-KEY    TO AHMKEY
232500        EXEC CICS READ
232600                  DATASET(AHM-DATASET)
232700                  INTO(WS-AHIST-MISC)
232800                  LENGTH(AHM-RLGTH)
232900                  RIDFLD(AHMKEY)
233000                  KEYLENGTH(AHM-KLGTH)
233100                  RESP(WS-RESPONSE)
233200        END-EXEC
233300     END-IF
233400*CNC0520-END
233500
233600     IF P920-TIE-UP-FUNCTION
233700        MOVE P926-ASGN-HIST-KEY     TO AH1KEY
233800        PERFORM P8700-READ-AHIST
233900        IF SUCCESS
234000           IF AH-CALL-TOPC-DB-TRAIN-ID    > SPACES    AND
234100              AH-CALL-TOPC-ROUTE-SEQ-NUMB > SPACES    AND
234200              AH-CALL-TOPC-CREW-ID        > SPACES    AND
234300              NOT BYPASS-TOPC
234400              MOVE SPACES TO P928-COMMAREA-PARMS
234500              SET P928-SEND-FUNCTION TO TRUE
234600              SET P928-CREW-TIE-UP   TO TRUE
234700              MOVE AH-KEY-1          TO P928-AH1KEY
234800              MOVE AH-CALL-TOPC-DB-TRAIN-ID
234900                                     TO P928-DB-TRAIN-ID
235000              MOVE AH-CALL-TOPC-ROUTE-SEQ-NUMB
235100                                     TO P928-ROUTE-SEQ-NUMB
235200              MOVE AH-CALL-TOPC-CREW-ID
235300                                     TO P928-CREW-ID
235400              EXEC CICS LINK
235500                        PROGRAM(P928-PGM)
235600                        COMMAREA(P928-COMMAREA-PARMS)
235700                        LENGTH(P928-LGTH)
235800                        RESP(WS-RESPONSE)
235900              END-EXEC
236000              IF NOT SUCCESS
236100                 MOVE 'P1100-20'          TO ERR-PARAGRAPH
236200                 PERFORM P9999-GOT-PROBLEM
236300              END-IF
236400           ELSE
236500              MOVE SPACES               TO TKCRKEY-AREA
236600              SET STATION-REC           TO TRUE
236700              MOVE AH-ORIGIN-STATION    TO TKCR-STA-NO
236800              MOVE TKCRKEY-AREA         TO TKCRKEY
236900              EXEC CICS READ
237000                   GTEQ
237100                   DATASET(TKCR-FILE-VIA-TKCRKEY)
237200                   INTO(WS-TKCR-FILE)
237300                   LENGTH(TKCRFILE-RLGTH)
237400                   RIDFLD(TKCRKEY)
237500                   KEYLENGTH(TKCRFILE-KLGTH)
237600                   RESP(WS-RESPONSE)
237700              END-EXEC
237800              MOVE WS-RESPONSE          TO FILE-STATUS
237900              IF SUCCESS AND
238000                 STATION-REC AND
238100                 AH-ORIGIN-STATION = TKCR-STA-NO
238200                 MOVE SPACES            TO CNTLKEY-AREA
238300                 MOVE TKCR-DIST         TO CNTL-DIST
238400                 SET DIST-TYPE-REC      TO TRUE
238500                 MOVE CNTLKEY-AREA      TO CNTLKEY
238600                 EXEC CICS READ
238700                           DATASET(CNTL-FILE-VIA-CNTLKEY)
238800                           INTO(WS-CNTL-FILE)
238900                           LENGTH(CNTLFILE-RLGTH)
239000                           RIDFLD(CNTLKEY)
239100                           KEYLENGTH(CNTLFILE-KLGTH)
239200                           RESP(WS-RESPONSE)
239300                 END-EXEC
239400                 IF SUCCESS
239500                    IF CNTL-IC-DIVN
239600                       MOVE SPACES      TO P928-COMMAREA-PARMS
239700                       SET P928-SEND-NAVIGATOR TO TRUE
239800                       SET P928-CREW-TIE-UP TO TRUE
239900                       MOVE AH-KEY-1 TO P928-AH1KEY
240000                       MOVE 'IC'            TO WORK-TRAIN-DB-2
240100                       MOVE AHK1-TRAIN-SYM  TO WORK-TRAIN-DB-8
240200                       MOVE WORK-TRAIN-DB   TO P928-DB-TRAIN-ID
240300                       MOVE AHK1-EFF-DATE-TIME
240400                                            TO P928-ROUTE-SEQ-NUMB
240500                       MOVE 'A'               TO P928-CREW-ID
240600                       EXEC CICS LINK
240700                                 PROGRAM(P928-PGM)
240800                                 COMMAREA(P928-COMMAREA-PARMS)
240900                                 LENGTH(P928-LGTH)
241000                                 RESP(WS-RESPONSE)
241100                       END-EXEC
241200                       IF NOT SUCCESS
241300                          MOVE 'P1100-21' TO ERR-PARAGRAPH
241400                          PERFORM P9999-GOT-PROBLEM
241500                       END-IF
241600                    END-IF
241700                 END-IF
241800              END-IF
241900           END-IF
242000        ELSE
242100           MOVE 'P1100-22'          TO ERR-PARAGRAPH
242200           MOVE AH1KEY              TO ERR-KEY
242300           PERFORM P9999-GOT-PROBLEM
242400        END-IF
242500     END-IF
242600     IF NEW-TO-PLACE
242700        PERFORM P8800-LINK-P937-TO-PLACE
242800     END-IF
242900*CNC0600 - RJA - B
243000     IF WS-CAN-WRR-NEW    AND
243100        P920-ASGN-IS-HOME AND
243200        ((P920-TIE-UP-FUNCTION AND NOT P920-QUICK-TIE-UP)
243300          OR
243400          P920-ADJ-TIE-UP-FUNCTION
243500          OR
243600         (P920-CANCEL-FUNCTION AND
243700          (P920-CANCEL-AFTER-WORK OR P920-CANCEL-AFTER-REPORT)
243800         ))
243900
      *CNLD-246-DXC-B
244200        MOVE CRAFT OF WS-MSTR TO WS-CRAFT-CODE-CHECK
244200
244000        IF RESET-BREAK-ELIGIBLE
244000        AND NOT (YARDMASTER-CRAFT
244000                 OR YARDMASTER-TRAINEE)
      *CNLD-246-DXC-E
244100*          SYSTEM RESET AND NATURAL RESET MSTR3 UPDATE
244200           MOVE EMP-NBR OF WS-MSTR  TO MSTR3NBRK
244300           PERFORM P8565-READ-UPDATE-MSTR3
244400           IF NOT SUCCESS
244500              MOVE 'P1100-26' TO ERR-PARAGRAPH
244600              MOVE MSTR3NBRK  TO ERR-KEY
244700              PERFORM P9999-GOT-PROBLEM
244800           END-IF
244900           PERFORM P2030-COMPUTE-RESET-BREAK
245000*
245100           MOVE WS-UPD-PROJ-RESET-BRK-CH
245200                                     TO MSTR3-PROJ-RESET-BRK-CH
245300                                        MSTR3-SYSTEM-RESET-BRK-CH
245400
245500           MOVE WS-UPD-PROJ-UD1-FROM TO MSTR3-PROJ-UD1-FROM
245600                                        MSTR3-SYSTEM-UD1-FROM
245700
245800           MOVE WS-UPD-PROJ-UD1-TO   TO MSTR3-PROJ-UD1-TO
245900                                        MSTR3-SYSTEM-UD1-TO
246000
246100           MOVE WS-UPD-PROJ-UD2-FROM TO MSTR3-PROJ-UD2-FROM
246200                                        MSTR3-SYSTEM-UD2-FROM
246300
246400           MOVE WS-UPD-PROJ-UD2-TO   TO MSTR3-PROJ-UD2-TO
246500                                        MSTR3-SYSTEM-UD2-TO
246600*
246700           PERFORM P8570-REWRITE-MSTR3
246800           IF NOT SUCCESS
246900              MOVE 'P1100-27' TO ERR-PARAGRAPH
247000              MOVE MSTR3NBRK  TO ERR-KEY
247100              PERFORM P9999-GOT-PROBLEM
247200           END-IF
247300*          SYSTEM FORCED RESET HISTORY
247400           PERFORM P2060-WRITE-RESET-BRK-HIST
247500*          EMPTOD-RESET-BREAK-REC
247600           PERFORM P2070-WRITE-ETOD-RESET-BREAK
247700*          READ MSTR TO GET THE UPDATED LAYOFF-CODE
247800           MOVE EMP-NBR  OF WS-MSTR  TO MSTRNBRK
247900           PERFORM P8515-READ-MASTER
248000           IF NOT SUCCESS
248100              MOVE 'P1100-27' TO ERR-PARAGRAPH
248200              MOVE MSTRNBRK TO ERR-KEY
248300              PERFORM P9999-GOT-PROBLEM
248400           END-IF
248500           IF ((AVAILABLE OF WS-MSTR) OR
248600               (TO-PLACE  OF WS-MSTR))
248700              PERFORM P2080-E95-LAYOFF
248800           END-IF
248900        END-IF
249000     END-IF.
249100*CNC0600 - RJA - E
249200*
249300*=================================================================
249400 P1102-TIE-OR-ADJ-TIE.
249500*=================================================================
249600     IF P920-ADJ-TIE-UP-FUNCTION
249700        SET P925-ADJ-TIE-UP-FUNCTION     TO TRUE
249800     END-IF
249900
250000*    CALCULATE ACTUAL TIME
250100
250200     SET P925-CALC-ACTUAL-TIME           TO TRUE
250300     MOVE EMP-NBR OF WS-MSTR             TO P925-EMP-NO
250400     MOVE P920-ASGN-CC                   TO P925-ASGN-CC
250500     IF P920-ADJ-TIE-UP-FUNCTION
250600        MOVE P920-ASGN-HIST-KEY (7:10)   TO WS-AHM-EFF-DATE-TIME
250700                                            P925-ORDER-DATE-TIME
250800        MOVE P920-ASGN-HIST-KEY          TO WORK-ASGN-HIST-KEY
250900     ELSE
251000        MOVE EMP-TRHIST-KEY (7:10)       TO WS-AHM-EFF-DATE-TIME
251100                                            P925-ORDER-DATE-TIME
251200        MOVE EMP-TRHIST-KEY              TO WORK-ASGN-HIST-KEY
251300     END-IF
251400*-----------------------------------------------------------------
251500*    CONVERT TO P920-TIME-ZONE - CNP925 IS EXPECTING THE OD-DATE
251600*    TO BE IN THE ASSIGNMENT'S TIMEZONE, AND THEN CONVERTS IT TO
251700*    THE EMPLOYEE'S TIME ZONE.
251800*-----------------------------------------------------------------
251900     MOVE SPACES                         TO TZ-PARAMETERS
252000     MOVE WS-EMP-TIME-ZONE               TO TZ-IN-ZONE
252100     MOVE P920-TIME-ZONE                 TO TZ-OUT-ZONE
252200     MOVE ODT-DATE                       TO TZ-IN-DATE
252300     MOVE ODT-TIME-OF-DAY                TO TZ-IN-TIME
252400     PERFORM P8996-TIMEZONE
252500     IF TZ-INVALID-PARAMETERS
252600        MOVE 'Z1100TZ'                   TO ERR-PARAGRAPH
252700        PERFORM P8996-TZERROR
252800     END-IF
252900     MOVE TZ-OUT-DATE-TIME               TO P925-OD-DATE-TIME
253000*** 331E - USE ADJUSTED ONDUTY TIME IN LIEU OF ORIGINAL
253100     IF AHM-EMP2-WRK-OD-DTTM NUMERIC
253200        AND AHM-EMP2-WRK-OD-DTTM > ZERO
253300        AND AHM-EMPLOYEE-RECORD-2
253400*AJK    IF WS-EMP-TIME-ZONE-AHM3       > SPACE AND
253500*          WS-ASG-TIME-ZONE-AHM3       > SPACE AND
253600*          WS-EMP-TIME-ZONE-AHM3   NOT = WS-ASG-TIME-ZONE-AHM3
253700*          MOVE SPACES                   TO TZ-PARAMETERS
253800*          MOVE WS-EMP-TIME-ZONE-AHM3    TO TZ-IN-ZONE
253900*          MOVE WS-ASG-TIME-ZONE-AHM3    TO TZ-OUT-ZONE
254000*          MOVE AHM-EMP2-WRK-OD-DT       TO TZ-IN-DATE
254100*          MOVE AHM-EMP2-WRK-OD-TM       TO TZ-IN-TIME
254200*          PERFORM P8996-TIMEZONE
254300*          IF TZ-INVALID-PARAMETERS
254400*             MOVE 'Z1102TZA'            TO ERR-PARAGRAPH
254500*             PERFORM P8996-TZERROR
254600*          END-IF
254700*          IF TZ-OUT-DATE-TIME       NOT = P925-OD-DATE-TIME
254800*             MOVE TZ-OUT-DATE-TIME      TO P925-OD-DATE-TIME
254900*             SET WS-ADJ-OD-PASSED       TO TRUE
255000*          END-IF
255100*       ELSE
255200           IF AHM-EMP2-WRK-OD-DTTM    NOT = P925-OD-DATE-TIME
255300              MOVE AHM-EMP2-WRK-OD-DTTM  TO P925-OD-DATE-TIME
255400              SET WS-ADJ-OD-PASSED       TO TRUE
255500           END-IF
255600*AJK    END-IF
255700     END-IF
255800     MOVE P920-EMP-OFFD-DATE-TIME        TO P925-OFFD-DATE-TIME
255900     MOVE P920-JOB-TYPE                  TO P925-JOB-TYPE
256000
256100*    GET THE TRCN KEY FROM THE ASSIGNMENT HISTORY FOR USE IN 925.
256200
256300     PERFORM P1107-GET-TRCNKEY1
256400
256500*    SET THE ROAD/YARD AND TERM PARAMETERS FOR 925.  THEY ARE
256600*    USED TO RETRIEVE THE HOS CONTROL TABLE ENTRY.
256700
256800     PERFORM P1109-SET-HOS-PARMS
256900
257000*    THE ON DUTY AND OFF DUTY TIMES ARE ADJUSTED IN 925
257100*    BASED ON THE HOS CONTROL TABLE.  THE OD AND OFFD
257200*    VALUES ARE RETURNED FROM 925 IN THE EMPLOYEE'S TIME
257300*    ZONE.
257400
257500     PERFORM P9200-LINK-TO-925
257600*** 331E - IF THE ADJUSTED OD WAS PASSED AND USED BY P925,
257700***      - SAVE FLAG FOR LATER USE
257800     IF WS-ADJ-OD-PASSED AND
257900        P925-USED-ADJ-OD
258000        SET WS-ADJ-OD-USED               TO TRUE
258100     END-IF
258200
258300     MOVE SPACE                          TO P925-FUNCTION-10
258400     SET P925-CALC-US-HRS-SVC            TO TRUE
258500     SET P925-CALC-CAN-HRS-SVC           TO TRUE
258600
258700*---------------------------------------------------------*
258800*     CONVERT TO P920-TIME-ZONE                           *
258900*---------------------------------------------------------*
259000     MOVE SPACES                         TO TZ-PARAMETERS
259100     MOVE WS-EMP-TIME-ZONE               TO TZ-IN-ZONE
259200     MOVE P920-TIME-ZONE                 TO TZ-OUT-ZONE
259300     MOVE P925-OD-DATE-TIME              TO TZ-IN-DATE-TIME
259400     PERFORM P8996-TIMEZONE
259500     IF TZ-INVALID-PARAMETERS
259600        MOVE 'A1100TZ'                   TO ERR-PARAGRAPH
259700        PERFORM P8996-TZERROR
259800     END-IF
259900     MOVE TZ-OUT-DATE-TIME               TO P925-OD-DATE-TIME
260000
260100     MOVE SPACES                         TO TZ-PARAMETERS
260200     MOVE WS-EMP-TIME-ZONE               TO TZ-IN-ZONE
260300     MOVE P920-TIME-ZONE                 TO TZ-OUT-ZONE
260400     MOVE P925-OFFD-DATE-TIME            TO TZ-IN-DATE-TIME
260500     PERFORM P8996-TIMEZONE
260600     IF TZ-INVALID-PARAMETERS
260700        MOVE 'B1100TZ'                   TO ERR-PARAGRAPH
260800        PERFORM P8996-TZERROR
260900     END-IF
261000     MOVE TZ-OUT-DATE-TIME               TO P925-OFFD-DATE-TIME
261100
261200*BUG C549-S
261300     MOVE SPACES                      TO TZ-PARAMETERS
261400     MOVE WS-EMP-TIME-ZONE            TO TZ-IN-ZONE
261500     MOVE P920-TIME-ZONE              TO TZ-OUT-ZONE
261600     MOVE LAST-ON-DUTY-TIME           TO TZ-IN-DATE-TIME
261700     PERFORM P8996-TIMEZONE
261800     IF TZ-INVALID-PARAMETERS
261900        MOVE 'C1100TZ'                TO ERR-PARAGRAPH
262000        PERFORM P8996-TZERROR
262100     END-IF
262200     MOVE TZ-OUT-DATE-TIME            TO P925-UNADJ-OD-DATE-TIME
262300*BUG C549-E
262400*
262500     MOVE P920-RESPITE-FROM-TIME      TO P925-RESPITE-FROM-TIME
262600     MOVE P920-RESPITE-TO-TIME        TO P925-RESPITE-TO-TIME
262700     MOVE P920-WORK-BEGAN-DATE-TIME   TO P925-WORK-BEGAN-DATE-TIME
262800     MOVE P920-RELV-RESP-DATE-TIME    TO P925-WORK-END-DATE-TIME
262900     IF P920-EMP-PERS-REST-CLMD > '0000'
263000        SET P925-CALC-PERS-REST       TO TRUE
263100        MOVE P920-EMP-PERS-REST-CLMD  TO P925-PERS-REST-CLMD
263200     END-IF
263300     PERFORM P2000-UPD-ETOD
263400*CNC0600-B
263500     IF WS-CAN-WRR-NEW    AND
263600        P920-ASGN-IS-HOME AND
263700        ((P920-TIE-UP-FUNCTION AND (NOT P920-QUICK-TIE-UP))
263800          OR P920-ADJ-TIE-UP-FUNCTION)
263900        PERFORM P2020-7DAY-RESET-BREAK-ELIG
264000     END-IF
264100*CNC0600-E
264200     IF WS-ALT-REST AND P920-ASGN-AJ
264300        MOVE P920-ASGN-ASGN               TO JOB-DEF-CHECK
264400*CNC0562-BEG
264500        IF JOB-DEF-RELIEF-ASGN
264600           IF WORK-AH-POOL            = JOB-DEF-YARD-POOL
264700              SET JOB-DEF-YARD-ASGN  TO TRUE
264800           ELSE
264900              SET JOB-DEF-LOCAL-ASGN TO TRUE
265000           END-IF
265100        END-IF
265200*CNC0562-END
265300        IF JOB-DEF-YARD-ASGN OR JOB-DEF-COMMUTER-ASGN
265400           IF P920-SCHED-END-TIME > P925-OD-TIME
265500              MOVE P925-OD-DATE           TO P925-SCHED-END-DATE
265600           ELSE
265700              MOVE ZEROS                  TO DATE-CONVERSION-PARMS
265800              SET PARM-ADD                TO TRUE
265900              MOVE P925-OD-DATE           TO PARM-PRI-DATE-GREG
266000              MOVE '01'                   TO PARM-SEC-GREG-DAY
266100              EXEC CICS LINK
266200                        PROGRAM(P903-PGM)
266300                        COMMAREA(DATE-CONVERSION-PARMS)
266400                        LENGTH(P903-LGTH)
266500                        RESP(WS-RESPONSE)
266600              END-EXEC
266700              MOVE WS-RESPONSE            TO FILE-STATUS
266800              IF NOT SUCCESS
266900                 MOVE 'P1102-1'           TO ERR-PARAGRAPH
267000                 PERFORM P9999-GOT-PROBLEM
267100              END-IF
267200              MOVE PARM-RES-DATE-GREG     TO P925-SCHED-END-DATE
267300           END-IF
267400           MOVE P920-SCHED-END-TIME       TO P925-SCHED-END-TIME
267500           MOVE P925-SCHED-END-DATE-TIME TO WS-SCHED-END-DATE-TIME
267600        END-IF
267700     END-IF
267800     IF P920-YARD-DATE-TIME > SPACES
267900        MOVE P920-YARD-DATE-TIME          TO P925-YARD-DATE-TIME
268000     END-IF
268100
268200     IF P920-ASGN-IS-HOME
268300        SET P925-TIE-UP-HOME              TO TRUE
268400     END-IF
268500     IF P920-ASGN-AJ
268600        MOVE P920-SCHED-2ND-CODE          TO P925-SCHED-2ND-CODE
268700        MOVE P920-ASGN-ASGN               TO JOB-DEF-CHECK
268800*CNC0562-BEG
268900        IF JOB-DEF-RELIEF-ASGN
269000           IF WORK-AH-POOL            = JOB-DEF-YARD-POOL
269100              SET JOB-DEF-YARD-ASGN  TO TRUE
269200           ELSE
269300              SET JOB-DEF-LOCAL-ASGN TO TRUE
269400           END-IF
269500        END-IF
269600*CNC0562-END
269700        IF JOB-DEF-YARD-ASGN
269800           IF AJ-SCH-DURATION NUMERIC
269900              AND AJ-SCH-DURATION > '0000'
270000              MOVE AJ-SCH-DURATION        TO P925-AJ-ERT
270100           ELSE
270200              MOVE '0800'                 TO P925-AJ-ERT
270300           END-IF
270400        END-IF
270500     END-IF
199800*CNLD-302 B COMMENTING
270600*    IF P920-IMPOSED-REST
270700*       SET P925-CALC-24-IMP-REST         TO TRUE
270800*       MOVE P920-EXTEND-REST-FLAG        TO P925-EXTEND-REST-FLAG
270900*    END-IF
199800*CNLD-302 E
271000
271100     PERFORM P9200-LINK-TO-925.
271200*=================================================================
271300 P1103-CHECK-OFF-DUTY-CHANGE.
271400*=================================================================
271500*    ANY OFF DUTY TIME CHANGES SHOULD BE REFLECTED IN THE HOS LOG
271600     INITIALIZE WS-HSL-STORAGE
271700     MOVE EMP-NBR OF WS-MSTR      TO HSL-EMP-NBR
271800     MOVE AHM-EMP-OD-DATE-TIME    TO HSL-EVENT-START-TS-DTTM
271900     IF P920-TIME-ZONE NOT = TZ-SYSTEM-TIME-ZONE
272000        MOVE SPACES               TO TZ-PARAMETERS
272100        MOVE P920-TIME-ZONE       TO TZ-IN-ZONE
272200        MOVE HSL-EVENT-START-TS-DTTM TO TZ-IN-DATE-TIME
272300        SET TZ-OUT-SYSTEM-ZONE    TO TRUE
272400        PERFORM P8996-TIMEZONE
272500        IF TZ-INVALID-PARAMETERS
272600           MOVE 'P1103-01'        TO ERR-PARAGRAPH
272700           PERFORM P8996-TZERROR
272800        END-IF
272900        MOVE TZ-OUT-DATE-TIME     TO HSL-EVENT-START-TS-DTTM
273000     END-IF
273100     PERFORM PSQL-HSLSEL
273200     IF SQL-SUCCESS
273300        IF P920-TIME-ZONE NOT = TZ-SYSTEM-TIME-ZONE
273400           MOVE SPACES               TO TZ-PARAMETERS
273500           MOVE TZ-SYSTEM-TIME-ZONE  TO TZ-IN-ZONE
273600           MOVE HSL-EVENT-END-TS-DTTM  TO TZ-IN-DATE-TIME
273700           MOVE P920-TIME-ZONE       TO TZ-OUT-ZONE
273800           PERFORM P8996-TIMEZONE
273900           IF TZ-INVALID-PARAMETERS
274000              MOVE 'P1103-02'        TO ERR-PARAGRAPH
274100              PERFORM P8996-TZERROR
274200           END-IF
274300           MOVE TZ-OUT-DATE-TIME     TO HSL-EVENT-END-TS-DTTM
274400        END-IF
274500        IF HSL-EVENT-END-TS-DTTM NOT = P920-EMP-OFFD-DATE-TIME
274600*          DELETE THE EXISTING EVENT AND INSERT NEW
274700           INITIALIZE                   PS93-COMMAREA-PARMS
274800           MOVE EMP-NBR OF WS-MSTR   TO PS93-EMP-NBR
274900           MOVE AHM-EMP-OD-DATE-TIME TO
275000                                       PS93-HSL-EVENT-STRT-TS-DTTM
275100           SET PS93-DELETE-HSL       TO TRUE
275200           MOVE P920-TIME-ZONE       TO PS93-TIME-ZONE
275300           PERFORM P8910-CALL-PS93-PROGRAM
275400           IF PS93-ERROR
275500              MOVE 'P1103-03'        TO ERR-PARAGRAPH
275600*C1119 - BEG
275700              STRING 'PS93 - '
275800              PS93-EMP-NBR ' ' P920-TIME-ZONE
275900                           '/' AHM-EMP-OD-DATE-TIME
276000              DELIMITED BY SIZE    INTO ERR-KEY
276100*C1119 - END
276200              PERFORM P9999-GOT-PROBLEM
276300           END-IF
276400           SET WS-APPLY-OVERTIME-YES TO TRUE
276500        END-IF
276600     END-IF
276700     .
276800*=================================================================
276900 P1104-CANCEL-AFTER-WORK.
277000*=================================================================
277100     SET P925-CALC-ACTUAL-TIME           TO TRUE
277200     MOVE EMP-NBR OF WS-MSTR             TO P925-EMP-NO
277300     MOVE P920-ASGN-CC                   TO P925-ASGN-CC
277400
277500*    CALCULATE ACTUAL TIME
277600
277700     IF P920-ADJ-TIE-UP-FUNCTION
277800        MOVE P920-ASGN-HIST-KEY (7:10)   TO WS-AHM-EFF-DATE-TIME
277900                                            P925-ORDER-DATE-TIME
278000        MOVE P920-ASGN-HIST-KEY          TO WORK-ASGN-HIST-KEY
278100     ELSE
278200        MOVE EMP-TRHIST-KEY (7:10)       TO WS-AHM-EFF-DATE-TIME
278300                                            P925-ORDER-DATE-TIME
278400        MOVE EMP-TRHIST-KEY              TO WORK-ASGN-HIST-KEY
278500     END-IF
278600     MOVE SPACES                         TO TZ-PARAMETERS
278700     MOVE WS-EMP-TIME-ZONE               TO TZ-IN-ZONE
278800     MOVE P920-TIME-ZONE                 TO TZ-OUT-ZONE
278900     MOVE ODT-DATE                       TO TZ-IN-DATE
279000     MOVE ODT-TIME-OF-DAY                TO TZ-IN-TIME
279100     PERFORM P8996-TIMEZONE
279200     IF TZ-INVALID-PARAMETERS
279300        MOVE 'A1104TZ'                   TO ERR-PARAGRAPH
279400        PERFORM P8996-TZERROR
279500     END-IF
279600     MOVE TZ-OUT-DATE-TIME               TO P925-OD-DATE-TIME
279700*** 331E - USE ADJUSTED ONDUTY TIME IN LIEU OF ORIGINAL
279800     IF AHM-EMP2-WRK-OD-DTTM NUMERIC
279900        AND AHM-EMP2-WRK-OD-DTTM > ZERO
280000        AND AHM-EMPLOYEE-RECORD-2
280100*AJK    IF WS-EMP-TIME-ZONE-AHM3       > SPACE AND
280200*          WS-ASG-TIME-ZONE-AHM3       > SPACE AND
280300*          WS-EMP-TIME-ZONE-AHM3   NOT = WS-ASG-TIME-ZONE-AHM3
280400*          MOVE SPACES                   TO TZ-PARAMETERS
280500*          MOVE WS-EMP-TIME-ZONE-AHM3    TO TZ-IN-ZONE
280600*          MOVE WS-ASG-TIME-ZONE-AHM3    TO TZ-OUT-ZONE
280700*          MOVE AHM-EMP2-WRK-OD-DT       TO TZ-IN-DATE
280800*          MOVE AHM-EMP2-WRK-OD-TM       TO TZ-IN-TIME
280900*          PERFORM P8996-TIMEZONE
281000*          IF TZ-INVALID-PARAMETERS
281100*             MOVE 'Z1102TZA'            TO ERR-PARAGRAPH
281200*             PERFORM P8996-TZERROR
281300*          END-IF
281400*          IF TZ-OUT-DATE-TIME       NOT = P925-OD-DATE-TIME
281500*             MOVE TZ-OUT-DATE-TIME      TO P925-OD-DATE-TIME
281600*             SET WS-ADJ-OD-PASSED       TO TRUE
281700*          END-IF
281800*       ELSE
281900           IF AHM-EMP2-WRK-OD-DTTM    NOT = P925-OD-DATE-TIME
282000              MOVE AHM-EMP2-WRK-OD-DTTM  TO P925-OD-DATE-TIME
282100              SET WS-ADJ-OD-PASSED       TO TRUE
282200           END-IF
282300*AJK    END-IF
282400     END-IF
282500     MOVE P920-CAN-DATE-TIME             TO P925-OFFD-DATE-TIME
282600     MOVE SPACES                         TO P925-JOB-TYPE
282700
282800*    GET THE TRCN KEY FROM THE ASSIGNMENT HISTORY FOR USE IN 925.
282900
283000     PERFORM P1107-GET-TRCNKEY1
283100
283200*    SET THE ROAD/YARD AND TERM PARAMETERS FOR 925.  THEY ARE
283300*    USED TO RETRIEVE THE HOS CONTROL TABLE ENTRY.
283400
283500     PERFORM P1109-SET-HOS-PARMS
283600
283700*    THE ON DUTY AND OFF DUTY TIMES ARE ADJUSTED IN 925
283800*    BASED ON THE HOS CONTROL TABLE.  THE OD AND OFFD
283900*    VALUES ARE RETURNED FROM 925 IN THE EMPLOYEE'S TIME
284000*    ZONE.
284100
284200     PERFORM P9200-LINK-TO-925
284300*** 331E - IF THE ADJUSTED OD WAS PASSED AND USED BY P925,
284400***      - SAVE FLAG FOR LATER USE
284500     IF WS-ADJ-OD-PASSED AND
284600        P925-USED-ADJ-OD
284700        SET WS-ADJ-OD-USED               TO TRUE
284800     END-IF
284900*---------------------------------------------------------*
285000*              CONVERT TO P920-TIME-ZONE                  *
285100*---------------------------------------------------------*
285200     MOVE SPACES                        TO TZ-PARAMETERS
285300     MOVE WS-EMP-TIME-ZONE              TO TZ-IN-ZONE
285400     MOVE P920-TIME-ZONE                TO TZ-OUT-ZONE
285500     MOVE P925-OD-DATE-TIME             TO TZ-IN-DATE-TIME
285600     PERFORM P8996-TIMEZONE
285700     IF TZ-INVALID-PARAMETERS
285800        MOVE 'D1100TZ'                  TO ERR-PARAGRAPH
285900        PERFORM P8996-TZERROR
286000     END-IF
286100     MOVE TZ-OUT-DATE-TIME              TO P925-OD-DATE-TIME
286200
286300     MOVE SPACES                        TO TZ-PARAMETERS
286400     MOVE WS-EMP-TIME-ZONE              TO TZ-IN-ZONE
286500     MOVE P920-TIME-ZONE                TO TZ-OUT-ZONE
286600     MOVE P925-OFFD-DATE-TIME           TO TZ-IN-DATE-TIME
286700     PERFORM P8996-TIMEZONE
286800     IF TZ-INVALID-PARAMETERS
286900        MOVE 'E1100TZ'                  TO ERR-PARAGRAPH
287000        PERFORM P8996-TZERROR
287100     END-IF
287200     MOVE TZ-OUT-DATE-TIME              TO P925-OFFD-DATE-TIME
287300*BUG C549-S
287400     MOVE SPACES                        TO TZ-PARAMETERS
287500     MOVE WS-EMP-TIME-ZONE              TO TZ-IN-ZONE
287600     MOVE P920-TIME-ZONE                TO TZ-OUT-ZONE
287700     MOVE LAST-ON-DUTY-TIME             TO TZ-IN-DATE-TIME
287800     PERFORM P8996-TIMEZONE
287900     IF TZ-INVALID-PARAMETERS
288000        MOVE 'F1100TZ'                  TO ERR-PARAGRAPH
288100        PERFORM P8996-TZERROR
288200     END-IF
288300     MOVE TZ-OUT-DATE-TIME              TO P925-UNADJ-OD-DATE-TIME
288400*BUG C549-E
288500
288600     MOVE SPACE                         TO P925-FUNCTION-10
288700     SET P925-CALC-US-HRS-SVC           TO TRUE
288800     SET P925-CALC-CAN-HRS-SVC          TO TRUE
288900     IF P920-CAN-REST-CLMD > '0000'
289000        SET P925-CALC-PERS-REST         TO TRUE
289100        MOVE P920-CAN-REST-CLMD         TO P925-PERS-REST-CLMD
289200     END-IF
289300     PERFORM P2000-UPD-ETOD
289400*CNC0600-B
289500     IF WS-CAN-WRR-NEW AND
289600        P920-ASGN-IS-HOME
289700        PERFORM P2020-7DAY-RESET-BREAK-ELIG
289800     END-IF
289900*CNC0600-E
290000     IF P920-ASGN-IS-HOME
290100        SET P925-TIE-UP-HOME            TO TRUE
290200     END-IF
290300     IF P920-ASGN-AJ
290400        MOVE P920-ASGN-ASGN             TO JOB-DEF-CHECK
290500*CNC0562-BEG
290600        IF JOB-DEF-RELIEF-ASGN
290700           IF WORK-AH-POOL            = JOB-DEF-YARD-POOL
290800              SET JOB-DEF-YARD-ASGN  TO TRUE
290900           ELSE
291000              SET JOB-DEF-LOCAL-ASGN TO TRUE
291100           END-IF
291200        END-IF
291300*CNC0562-END
291400        IF JOB-DEF-YARD-ASGN
291500           IF AJ-SCH-DURATION NUMERIC
291600              AND AJ-SCH-DURATION > '0000'
291700              MOVE AJ-SCH-DURATION      TO P925-AJ-ERT
291800           ELSE
291900              MOVE '0800'               TO P925-AJ-ERT
292000           END-IF
292100        END-IF
292200     END-IF
292300
292400     PERFORM P9200-LINK-TO-925.
292500*=================================================================
292600 P1106-CANCEL-NO-WORK.
292700*=================================================================
292800     IF P920-CAN-REST-CLMD                  > '0000'
292900        SET P925-CALC-PERS-REST            TO TRUE
293000        MOVE EMP-NBR OF WS-MSTR            TO P925-EMP-NO
293100        MOVE SPACES                        TO TZ-PARAMETERS
293200        MOVE WS-EMP-TIME-ZONE              TO TZ-IN-ZONE
293300        MOVE P920-TIME-ZONE                TO TZ-OUT-ZONE
293400        MOVE LAST-ON-DUTY-TIME             TO TZ-IN-DATE-TIME
293500        PERFORM P8996-TIMEZONE
293600        IF TZ-INVALID-PARAMETERS
293700           MOVE 'G1100TZ'                  TO ERR-PARAGRAPH
293800           PERFORM P8996-TZERROR
293900        END-IF
294000        MOVE TZ-OUT-DATE-TIME              TO P925-OD-DATE-TIME
294100        MOVE P920-CAN-DATE-TIME            TO P925-OFFD-DATE-TIME
294200        MOVE P920-CAN-REST-CLMD            TO P925-PERS-REST-CLMD
294300
294400        PERFORM P9200-LINK-TO-925
294500     END-IF.
294600*=================================================================
294700 P1107-GET-TRCNKEY1.
294800*=================================================================
294900     MOVE WORK-ASGN-HIST-KEY           TO AH1KEY
295000     PERFORM P8700-READ-AHIST
295100     IF SUCCESS
295200        MOVE AH-CALL-ASGN-PROFILE-KEY  TO P925-TRCNKEY1
295300     END-IF.
295400*=================================================================
295500 P1108-ADJ-TIE-UP-AFTER-OD.
295600*=================================================================
295700     SET P925-CALC-ACTUAL-TIME          TO TRUE
295800     MOVE EMP-NBR OF WS-MSTR            TO P925-EMP-NO
295900     MOVE P920-ASGN-CC                   TO P925-ASGN-CC
296000
296100*    CALCULATE ACTUAL TIME
296200
296300     MOVE P920-ASGN-HIST-KEY (7:10)     TO WS-AHM-EFF-DATE-TIME
296400                                           P925-ORDER-DATE-TIME
296500     MOVE P920-ASGN-HIST-KEY            TO WORK-ASGN-HIST-KEY
296600     MOVE P920-TU-OD-DATE-TIME          TO P925-OD-DATE-TIME
296700*** 331E - USE ADJUSTED ONDUTY TIME IN LIEU OF ORIGINAL
296800     IF AHM-EMP2-WRK-OD-DTTM NUMERIC
296900        AND AHM-EMP2-WRK-OD-DTTM > ZERO
297000        AND AHM-EMPLOYEE-RECORD-2
297100*AJK    IF WS-EMP-TIME-ZONE-AHM3       > SPACE AND
297200*          WS-ASG-TIME-ZONE-AHM3       > SPACE AND
297300*          WS-EMP-TIME-ZONE-AHM3   NOT = WS-ASG-TIME-ZONE-AHM3
297400*          MOVE SPACES                   TO TZ-PARAMETERS
297500*          MOVE WS-EMP-TIME-ZONE-AHM3    TO TZ-IN-ZONE
297600*          MOVE WS-ASG-TIME-ZONE-AHM3    TO TZ-OUT-ZONE
297700*          MOVE AHM-EMP2-WRK-OD-DT       TO TZ-IN-DATE
297800*          MOVE AHM-EMP2-WRK-OD-TM       TO TZ-IN-TIME
297900*          PERFORM P8996-TIMEZONE
298000*          IF TZ-INVALID-PARAMETERS
298100*             MOVE 'Z1102TZA'            TO ERR-PARAGRAPH
298200*             PERFORM P8996-TZERROR
298300*          END-IF
298400*          IF TZ-OUT-DATE-TIME       NOT = P925-OD-DATE-TIME
298500*             MOVE TZ-OUT-DATE-TIME      TO P925-OD-DATE-TIME
298600*             SET WS-ADJ-OD-PASSED       TO TRUE
298700*          END-IF
298800*       ELSE
298900           IF AHM-EMP2-WRK-OD-DTTM    NOT = P925-OD-DATE-TIME
299000              MOVE AHM-EMP2-WRK-OD-DTTM  TO P925-OD-DATE-TIME
299100              SET WS-ADJ-OD-PASSED       TO TRUE
299200           END-IF
299300*AJK    END-IF
299400     END-IF
299500     MOVE P920-EMP-OFFD-DATE-TIME       TO P925-OFFD-DATE-TIME
299600     MOVE P920-JOB-TYPE                 TO P925-JOB-TYPE
299700
299800*    GET THE TRCN KEY FROM THE ASSIGNMENT HISTORY FOR USE IN 925.
299900
300000     PERFORM P1107-GET-TRCNKEY1
300100
300200*    SET THE ROAD/YARD AND TERM PARAMETERS FOR 925.  THEY ARE
300300*    USED TO RETRIEVE THE HOS CONTROL TABLE ENTRY.
300400
300500     PERFORM P1109-SET-HOS-PARMS
300600
300700*    THE ON DUTY AND OFF DUTY TIMES ARE ADJUSTED IN 925
300800*    BASED ON THE HOS CONTROL TABLE.  THE OD AND OFFD
300900*    VALUES ARE RETURNED FROM 925 IN THE EMPLOYEE'S TIME
301000*    ZONE.
301100
301200     PERFORM P9200-LINK-TO-925
301300*** 331E - IF THE ADJUSTED OD WAS PASSED AND USED BY P925,
301400***      - SAVE FLAG FOR LATER USE
301500     IF WS-ADJ-OD-PASSED AND
301600        P925-USED-ADJ-OD
301700        SET WS-ADJ-OD-USED               TO TRUE
301800     END-IF
301900
302000*---------------------------------------------------------*
302100*           CONVERT TO P920-TIME-ZONE                     *
302200*---------------------------------------------------------*
302300     MOVE SPACES                        TO TZ-PARAMETERS
302400     MOVE WS-EMP-TIME-ZONE              TO TZ-IN-ZONE
302500     MOVE P920-TIME-ZONE                TO TZ-OUT-ZONE
302600     MOVE P925-OD-DATE-TIME             TO TZ-IN-DATE-TIME
302700     PERFORM P8996-TIMEZONE
302800     IF TZ-INVALID-PARAMETERS
302900        MOVE 'H1100TZ'                  TO ERR-PARAGRAPH
303000        PERFORM P8996-TZERROR
303100     END-IF
303200     MOVE TZ-OUT-DATE-TIME              TO P925-OD-DATE-TIME
303300                                           WS-OD-DATE-TIME
303400
303500     MOVE SPACES                        TO TZ-PARAMETERS
303600     MOVE WS-EMP-TIME-ZONE              TO TZ-IN-ZONE
303700     MOVE P920-TIME-ZONE                TO TZ-OUT-ZONE
303800     MOVE P925-OFFD-DATE-TIME           TO TZ-IN-DATE-TIME
303900     PERFORM P8996-TIMEZONE
304000     IF TZ-INVALID-PARAMETERS
304100        MOVE 'I1100TZ'                  TO ERR-PARAGRAPH
304200        PERFORM P8996-TZERROR
304300     END-IF
304400     MOVE TZ-OUT-DATE-TIME              TO P925-OFFD-DATE-TIME
304500
304600     PERFORM P2000-UPD-ETOD
304700*CNC0600-B
304800     IF WS-CAN-WRR-NEW AND
304900        P920-ASGN-IS-HOME
305000        PERFORM P2020-7DAY-RESET-BREAK-ELIG
305100     END-IF
305200*CNC0600-E
305300
305400*
305500*    DETERMINE HOW MANY OTHER CALLS HAVE TAKEN PLACE SINCE
305600*    THIS JOB.
305700*
305800     MOVE SPACES                    TO WS-POINTER
305900     MOVE EMP-NBR OF WS-MSTR        TO POINT-EMP-NBR
306000     SET  POINT-GUARANTEE           TO TRUE
306100     MOVE P920-EMP-OFFD-DATE        TO DE-YYMMDD
306200     SET DE-YYMMDD-FORMAT           TO TRUE
306300     SET DE-REFORMAT-ONLY           TO TRUE
306400     MOVE SPACE                     TO DE-STATUS-FLAG
306500     PERFORM P8998-DATEEDIT
306600     MOVE DE-YYMMDD-CE              TO POINT-EFF-CE
306700     MOVE P920-EMP-OFFD-DATE        TO POINT-EFF-DATE
306800     MOVE P920-EMP-OFFD-TIME        TO POINT-EFF-TIME
306900*---------------------------------------------------------*
307000*           CONVERT TO SYSTEM-TIME-ZONE FOR POINTER KEY   *
307100*---------------------------------------------------------*
307200     MOVE SPACES                    TO TZ-PARAMETERS
307300     MOVE P920-TIME-ZONE            TO TZ-IN-ZONE
307400     SET  TZ-OUT-SYSTEM-ZONE        TO TRUE
307500     MOVE POINT-EFF-DATE-TIME       TO TZ-IN-DATE-TIME
307600     PERFORM P8996-TIMEZONE
307700     IF TZ-INVALID-PARAMETERS
307800        MOVE 'J1100TZ'              TO ERR-PARAGRAPH
307900        PERFORM P8996-TZERROR
308000     END-IF
308100     MOVE TZ-OUT-DATE-TIME          TO POINT-EFF-DATE-TIME
308200
308300     MOVE POINT-NBR-KEY             TO POINTKEY
308400     EXEC CICS STARTBR
308500               DATASET(POINT-FILE-VIA-EMP)
308600               RIDFLD(POINTKEY)
308700               GTEQ
308800               RESP(WS-RESPONSE)
308900     END-EXEC
309000     MOVE WS-RESPONSE                   TO FILE-STATUS
309100     IF NOT SUCCESS
309200        MOVE 'P1108-1'                  TO ERR-PARAGRAPH
309300        MOVE POINTKEY                   TO ERR-KEY
309400        PERFORM P9999-GOT-PROBLEM
309500     END-IF
309600     MOVE 'N'                           TO WS-POINTR-DONE-CODE
309700     MOVE ZEROES                        TO CALL-COUNT
309800                                        TU-COUNT
309900     PERFORM UNTIL POINTR-DONE
310000        EXEC CICS READNEXT
310100                  DATASET(POINT-FILE-VIA-EMP)
310200                  INTO(WS-POINTER)
310300                  LENGTH(POINT-RLGTH)
310400                  RIDFLD(POINTKEY)
310500                  KEYLENGTH(POINT-KLGTH)
310600                  RESP(WS-RESPONSE)
310700        END-EXEC
310800        MOVE WS-RESPONSE                TO FILE-STATUS
310900        IF SUCCESS
311000           IF POINT-EMP-NBR = EMP-NBR OF WS-MSTR
311100           AND POINT-GUARANTEE
311200              IF POINT-CALL-FUN
311300                 ADD 1                  TO CALL-COUNT
311400              END-IF
311500              IF POINT-TIE-UP-FUN
311600              AND CALL-COUNT             > ZEROES
311700                 ADD 1                  TO TU-COUNT
311800              END-IF
311900           ELSE
312000              SET POINTR-DONE           TO TRUE
312100           END-IF
312200        ELSE
312300           IF NOT (NO-RECORD-FND OR END-OF-FILE)
312400              MOVE 'P1108-2'            TO ERR-PARAGRAPH
312500              MOVE POINTKEY             TO ERR-KEY
312600              PERFORM P9999-GOT-PROBLEM
312700           ELSE
312800              SET POINTR-DONE           TO TRUE
312900           END-IF
313000        END-IF
313100     END-PERFORM
313200     EXEC CICS ENDBR
313300               DATASET(POINT-FILE-VIA-EMP)
313400               RESP(WS-RESPONSE)
313500     END-EXEC
313600     IF CALL-COUNT < 2
313700        MOVE SPACES                     TO P925-COMMAREA-PARMS
313800        SET P925-RECALC-CAN-HRS-SVC     TO TRUE
313900        MOVE EMP-NBR OF WS-MSTR         TO P925-EMP-NO
314000        MOVE P920-TIME-ZONE             TO P925-TIME-ZONE
314100        IF CALL-COUNT = TU-COUNT
314200           MOVE LAST-ON-DUTY-TIME       TO P925-OD-DATE-TIME
314300           MOVE LAST-TIE-UP-TIME        TO P925-OFFD-DATE-TIME
314400        ELSE
314500           MOVE WS-OD-DATE-TIME         TO P925-OD-DATE-TIME
314600           MOVE P920-EMP-OFFD-DATE-TIME TO P925-OFFD-DATE-TIME
314700        END-IF
314800        PERFORM P1109-SET-HOS-PARMS
314900        PERFORM P9200-LINK-TO-925
315000     END-IF.
315100*=================================================================
315200 P1109-SET-HOS-PARMS.
315300*=================================================================
315400
315500*    SET THE PARAMETERS USED TO RETRIEVE DATA FROM THE HOS
315600*    CONTROL TABLE IN 925.  NOTE, LOCAL JOBS USED TO BE
315700*    CONSIDERED YARD JOBS, THEY ARE NOW ROAD JOBS.
315800
315900     IF P920-ASGN-AJ
316000        MOVE 'H'                         TO P925-TERM
316100        MOVE P920-ASGN-ASGN              TO JOB-DEF-CHECK
316200*CNC0562-BEG
316300        IF JOB-DEF-RELIEF-ASGN
316400           IF WORK-AH-POOL            = JOB-DEF-YARD-POOL
316500              SET JOB-DEF-YARD-ASGN  TO TRUE
316600           ELSE
316700              SET JOB-DEF-LOCAL-ASGN TO TRUE
316800           END-IF
316900        END-IF
317000*CNC0562-END
317100        IF  JOB-DEF-LOCAL-ASGN
317200        OR (JOB-DEF-CHECK(1:2) = 'EX'
317300        AND P920-FINAL-STATION > SPACES)
317400           SET P925-TIE-UP-ROAD          TO TRUE
317500           IF JOB-DEF-COMMUTER-ASGN
317600              SET P925-LOCAL-COMMUTER    TO TRUE
317700           ELSE
317800              SET P925-LOCAL-JOB         TO TRUE
317900           END-IF
318000        ELSE
318100           SET P925-TIE-UP-YARD          TO TRUE
318200        END-IF
318300     ELSE
318400        SET P925-TIE-UP-ROAD             TO TRUE
318500        EVALUATE TRUE
318600           WHEN P920-CANCEL-FUNCTION
318700              IF P920-TIE-UP-TO-TERM = '0' OR SPACE
318800                 MOVE 'H'                TO P925-TERM
318900              ELSE
319000                 MOVE 'A'                TO P925-TERM
319100              END-IF
      *CNLD-240-DXC-B
                    MOVE P925-TRCNKEY1         TO WS-TRCN-KEY1
                    IF WS-CAN-WRR-NEW
                      IF (WS-ORIGIN-STATION-TRCN = EMP-HOME-TERM-CODE)
318800                   MOVE 'H'                TO P925-TERM
318900                ELSE
319000                   MOVE 'A'                TO P925-TERM
319100                END-IF
319100              END-IF
      *CNLD-240-DXC-E
319200           WHEN OTHER
319300*MET 6/30/2006 C596
319400              PERFORM P1111-GET-AHM-RECORD
319500              MOVE 'A'                   TO P925-TERM
319600              MOVE SPACES                TO WORK-CNTLKEY
319700              MOVE '03'                  TO WK-CNTL-REC-TYPE
319800              MOVE AHM-ODA-DIST          TO WK-CNTL-DIST
319900              MOVE AHM-ODA-SUB-DIST      TO WK-CNTL-SUB-DIST
320000              MOVE AHM-ODA-POOL          TO WK-CNTL-POOL
320100              MOVE 'F'                   TO WK-CNTL-POOL-TYPE
320200              PERFORM P8640-READ-CNTLFILE
320300              IF SUCCESS
320400*C772
320500                 IF P920-FINAL-STATION    > SPACES
320600                    MOVE P920-FINAL-STATION
320700                                         TO WS-FINAL-STATION
320800                 ELSE
320900                    MOVE AH-FINAL-STATION
321000                                         TO WS-FINAL-STATION
321100                 END-IF
321200                 IF WS-FINAL-STATION      = CNTL-HOME-TERM-CODE
321300*
321400*                IF EMPLOYEE IS ASSIGNED FURTHER NOTICE TO THE
321500*                ASSIGNMENT TYING UP, AND THEY WERE DEADHEADED
321600*                TO THE JOB, THEY'RE ON AN OUTPOST ASSIGNMENT,
321700*                AND ARE NOT 'AT HOME'.
321800*
321900                    PERFORM P8400-GET-LATEST-TEMP-JOB
322000                    IF ASGN-ASSIGNMENT     > SPACES
322100                       AND ASGN-ASSIGNMENT = AHM-OD-ASSIGN
322200                       AND ASGN-DH-F-NOTICE
322300                       PERFORM P1112-CHECK-FOR-DEADHEAD
322400                       IF NO-DEADHEAD-FOUND
322500                          MOVE 'H'       TO P925-TERM
322600                       END-IF
322700                    ELSE
322800                       MOVE 'H'          TO P925-TERM
322900                    END-IF
323000                 END-IF
323100              ELSE
323200                 MOVE 'P1109-1'          TO ERR-PARAGRAPH
323300                 MOVE CNTLKEY            TO ERR-KEY
323400                 PERFORM P9999-GOT-PROBLEM
323500              END-IF
323600        END-EVALUATE
323700     END-IF.
323800******************************************************************
323900 P1110-UPDATE-ON-DUTY-REC.
324000******************************************************************
324100     MOVE P920-ASGN-TYPE     TO ASGN-JOB-TYPE
324200     MOVE P920-ASGN-PARM     TO ASGN-ASSIGNMENT
324300     SET ASGN-ON-DUTY-REC    TO TRUE
324400     MOVE ZEROS              TO ASGN-DATE-TIME
324500     MOVE ASGNKEY1           TO ASGNJOB
324600     EXEC CICS READ
324700               UPDATE
324800               DATASET(ASGN-VIA-ASGNJOB)
324900               INTO(ASGN-AREA)
325000               LENGTH(ASGNJOB-RLGTH)
325100               RIDFLD(ASGNJOB)
325200               KEYLENGTH(ASGNJOB-KLGTH)
325300               RESP(WS-RESPONSE)
325400     END-EXEC
325500     MOVE WS-RESPONSE TO FILE-STATUS
325600     IF NOT SUCCESS
325700        OR ASGN-EMP-NO NOT = EMP-NBR OF WS-MSTR
325800        MOVE 'P1110-1' TO ERR-PARAGRAPH
325900        MOVE ASGNJOB   TO ERR-KEY
326000        PERFORM P9999-GOT-PROBLEM
326100     END-IF
326200     IF P920-TIE-UP-FUNCTION    AND
326300        P920-SAVE-ON-DUTY = 'Y' AND
326400        ASGN-SAVE-ON-DUTY = 'Y'
326500        SET SAVE-ON-DUTY TO TRUE
326600     ELSE
326700        MOVE SPACES TO WS-SAVE-ON-DUTY-CODE
326800     END-IF
326900     IF (P920-ASGN-IS-HOME AND NOT SAVE-ON-DUTY)
327000     OR (EMP-IS-HOME       AND NOT SAVE-ON-DUTY)
327100        EXEC CICS DELETE
327200                  DATASET(ASGN-VIA-ASGNJOB)
327300                  RESP(WS-RESPONSE)
327400        END-EXEC
327500        MOVE WS-RESPONSE TO FILE-STATUS
327600        IF NOT SUCCESS
327700           MOVE 'P1110-2' TO ERR-PARAGRAPH
327800           MOVE ASGNJOB   TO ERR-KEY
327900           PERFORM P9999-GOT-PROBLEM
328000        END-IF
328100     ELSE
328200*-----------------------------------------------------------------
328300*       SAVE PREVIOUS AHMKEY AND CRAFT CODE FOR USE IN ANY
328400*       HELDAWAY CLAIMS THAT MAY BE GENERATED.  IF THIS IS A
328500*       CANCEL, LEAVE THE RECORD AS IS.
328600*--------------------------------------------------------------PLS
328700        IF NOT P920-CANCEL-FUNCTION
328800           MOVE WS-AHMKEY  TO ASGN-HA-PRIOR-AHMKEY
328900           MOVE P926-TU-RETURN-CRAFT-CODE
329000                           TO ASGN-HA-CRAFT-CODE
329100           MOVE P920-JOB-TYPE
329200                           TO ASGN-ON-DUTY-JOB-TYPE
329300        END-IF
329400        MOVE ZEROS         TO ASGN-ON-DUTY-DATE-TIME
329500        MOVE SPACES        TO ASGN-TRAIN-ID
329600        EXEC CICS REWRITE
329700                  DATASET(ASGN-VIA-ASGNJOB)
329800                  FROM(WS-ASGN-FILE)
329900                  LENGTH(ASGNJOB-RLGTH)
330000                  RESP(WS-RESPONSE)
330100        END-EXEC
330200        MOVE WS-RESPONSE TO FILE-STATUS
330300        IF NOT SUCCESS
330400           MOVE 'P1110-3' TO ERR-PARAGRAPH
330500           MOVE ASGNJOB TO ERR-KEY
330600           PERFORM P9999-GOT-PROBLEM
330700        END-IF
330800     END-IF.
330900******************************************************************
331000 P1101R-BUILD-RESPITE-HSL.
331100******************************************************************
331200     INITIALIZE                       PS93-COMMAREA-PARMS
331300     MOVE SPACES                   TO WS-PS93-START-DTTM
331400                                      WS-PS93-END-DTTM
331500                                      WS-PS93-START-DTTM-HSD
331600     IF WS-RESPITE-FROM-DATE >  AHM-EMP-OD-DATE OR
331700       (WS-RESPITE-FROM-DATE = AHM-EMP-OD-DATE AND
331800        AHM-EMP-OD-TIME NOT = WS-RESPITE-FROM-TIME)
331900        INITIALIZE                    PS93-COMMAREA-PARMS
332000        MOVE '1'                   TO PS93-EVENT-CD
332100        MOVE AHM-EMP-OD-DATE-TIME  TO WS-PS93-START-DTTM
332200                                      WS-PS93-START-DTTM-HSD
332300        MOVE WS-RESPITE-FROM-DATE  TO WS-PS93-END-DATE
332400        MOVE WS-RESPITE-FROM-TIME  TO WS-PS93-END-TIME
332500        MOVE 'Y'                   TO PS93-HOS-FL
332600        PERFORM P1101-BUILD-HSL-FOR-CURR-TOUR
332700        SET WS-APPLY-PREV-HOURS-NO TO TRUE
332800     END-IF
332900*
333000     INITIALIZE                       PS93-COMMAREA-PARMS
333100     MOVE ZEROS                    TO DATE-CONVERSION-PARMS
333200     MOVE SPACES                   TO WS-PS93-START-DTTM
333300                                      WS-PS93-END-DTTM
333400                                      WS-PS93-START-DTTM-HSD
333500     MOVE '4'                      TO PS93-EVENT-CD
333600     MOVE AHM-EMP-OD-DATE-TIME     TO WS-PS93-START-DTTM
333700     MOVE WS-RESPITE-FROM-DATE     TO WS-PS93-START-DATE-HSD
333800                                      PARM-PRI-DATE-GREG
333900     MOVE WS-RESPITE-FROM-TIME     TO WS-PS93-START-TIME-HSD
334000                                      PARM-PRI-HRMN
334100     MOVE WS-RESPITE-TO-DATE       TO WS-PS93-END-DATE
334200                                      PARM-SEC-DATE-GREG
334300     MOVE WS-RESPITE-TO-TIME       TO WS-PS93-END-TIME
334400                                      PARM-SEC-HRMN
334500     SET PARM-DIFF                 TO TRUE
334600     EXEC CICS LINK
334700               PROGRAM(P903-PGM)
334800               COMMAREA(DATE-CONVERSION-PARMS)
334900               LENGTH(P903-LGTH)
335000               RESP(WS-RESPONSE)
335100     END-EXEC
335200     MOVE WS-RESPONSE              TO FILE-STATUS
335300     IF NOT SUCCESS
335400        MOVE 'P1101R-01'           TO ERR-PARAGRAPH
335500        MOVE 'P903'                TO ERR-KEY
335600        PERFORM P9999-GOT-PROBLEM
335700     END-IF
335800     IF PARM-RES-TOT-DAYS > ZERO OR
335900        PARM-RES-HRMN > '0359'
336000        MOVE 'N'                   TO PS93-HOS-FL
336100     ELSE
336200        MOVE 'Y'                   TO PS93-HOS-FL
336300     END-IF
336400     PERFORM P1101-BUILD-HSL-FOR-CURR-TOUR
336500     SET WS-APPLY-PREV-HOURS-NO TO TRUE
336600*
336700     INITIALIZE                       PS93-COMMAREA-PARMS
336800     IF WS-RESPITE-TO-DATE <  P920-EMP-OFFD-DATE OR
336900       (WS-RESPITE-TO-DATE = P920-EMP-OFFD-DATE AND
337000        WS-RESPITE-TO-TIME NOT = P920-EMP-OFFD-TIME)
337100        MOVE SPACES                TO WS-PS93-START-DTTM
337200                                      WS-PS93-END-DTTM
337300                                      WS-PS93-START-DTTM-HSD
337400        INITIALIZE                    PS93-COMMAREA-PARMS
337500        MOVE '1'                   TO PS93-EVENT-CD
337600        MOVE AHM-EMP-OD-DATE-TIME  TO WS-PS93-START-DTTM
337700        MOVE WS-RESPITE-TO-DATE    TO WS-PS93-START-DATE-HSD
337800        MOVE WS-RESPITE-TO-TIME    TO WS-PS93-START-TIME-HSD
337900        MOVE P920-EMP-OFFD-DATE-TIME  TO WS-PS93-END-DTTM
338000        MOVE 'Y'                   TO PS93-HOS-FL
338100        PERFORM P1101-BUILD-HSL-FOR-CURR-TOUR
338200     END-IF
338300     .
338400******************************************************************
338500 P1101-BUILD-HSL-FOR-CURR-TOUR.
338600******************************************************************
338700     PERFORM P1108-READ-CREW-PROFILE
338800     MOVE ZEROES                   TO WS-TOTAL-MN
338900                                      WS-LIMBO-MN
339000     SET PS93-INSERT-HSD           TO TRUE
339100     MOVE EMP-NBR OF WS-MSTR       TO PS93-EMP-NBR
339200     MOVE P920-TIME-ZONE           TO PS93-TIME-ZONE
339300     MOVE WS-PS93-START-DTTM       TO PS93-HSL-EVENT-STRT-TS-DTTM
339400     MOVE WS-PS93-START-DTTM-HSD   TO PS93-HSD-EVENT-STRT-TS-DTTM
339500     MOVE WS-PS93-END-DTTM         TO PS93-EVENT-END-TS-DTTM
339600     MOVE AHK1-TRAIN               TO PS93-TRAIN-SYMBOL
339700     MOVE WS-EMP-OD-ASSIGN         TO PS93-ASGNMT-TXT
339800     MOVE AHM-AHIST-KEY            TO PS93-AHIST-KEY
339900     IF P920-ASGN-IS-HOME AND NOT SAVE-ON-DUTY
340000        MOVE 'N'                   TO PS93-TIE-UP-AWAY-INDR
340100     ELSE
340200        MOVE 'Y'                   TO PS93-TIE-UP-AWAY-INDR
340300     END-IF
340400     IF P920-QUICK-TIE-UP
340500        MOVE 'N'                   TO PS93-CERTIFICATION-INDR
340600     ELSE
340700        MOVE 'Y'                   TO PS93-CERTIFICATION-INDR
340800     END-IF
340900     MOVE 'Y'                      TO PS93-STRT-INDR
341000*CNC0488   DO NOT COUNT AS STARTS IF 1) CREW PROFILE IS SET TO
341100*    REST-REQ AS 'N' 2)IF TRAIN ID FORMAT IS '3', '4', '5' OR
341200*    TRAIN SYMBOL IS DH AND EMP NOT HAVING 6 STARTS
341300     MOVE WS-EMP-OD-ASSIGN(11:2)   TO WS-CRAFT-CODE-CHECK
341400     IF ENGINE-CRAFT
341500        IF (TRCN-EN-REST-REQ > SPACES) AND
341600           (TRCN-EN-REST-REQ = 'N')
341700            MOVE 'N'               TO PS93-STRT-INDR
341800        ELSE
341900           IF (TRCN-TRAIN-ID-FORMAT = '3' OR '4' OR '5') OR
342000              AHK1-TRAIN(1:2) = 'DH'
342100*CNC0526-BEG
342200*             PERFORM P8995-CHECK-24HRS-START
342300*             COUNT AS STARTS IF 'DEADHEAD-TO' TRIP
342400*             IF WS-NEW-HOS-START AND NOT P920-ASGN-IS-HOME
342500*                MOVE 'Y'               TO PS93-STRT-INDR
342600*             ELSE
342700*CNC0526-END
342800                 PERFORM P1113-CHECK-FOR-7TH-START
342900                 IF WS-COUNT-AS-START-NO
343000                    MOVE 'N'            TO PS93-STRT-INDR
343100                 END-IF
343200*             END-IF
343300           END-IF
343400        END-IF
343500     ELSE
343600        IF (TRCN-TR-REST-REQ > SPACES) AND
343700           (TRCN-TR-REST-REQ = 'N')
343800            MOVE 'N'               TO PS93-STRT-INDR
343900        ELSE
344000           IF (TRCN-TRAIN-ID-FORMAT = '3' OR '4' OR '5') OR
344100              AHK1-TRAIN(1:2) = 'DH'
344200*CNC0526-BEG
344300*             PERFORM P8995-CHECK-24HRS-START
344400*             COUNT AS STARTS IF 'DEADHEAD-TO' TRIP
344500*             IF WS-NEW-HOS-START AND NOT P920-ASGN-IS-HOME
344600*                MOVE 'Y'               TO PS93-STRT-INDR
344700*             ELSE
344800*CNC0526-END
344900                 PERFORM P1113-CHECK-FOR-7TH-START
345000                 IF WS-COUNT-AS-START-NO
345100                    MOVE 'N'            TO PS93-STRT-INDR
345200                 END-IF
345300*             END-IF
345400           END-IF
345500        END-IF
345600     END-IF
345700*CNC0526-BEG
345800     IF US-DOMICILED AND P920-TIE-UP-FUNCTION
345900        IF AHM-EMP-OD-DATE-TIME     < WS-HOLD-MSTR-US-RSTD
346000*          DETERMINE IF THE PREVIOUS EVENT SHOULD CARRY THE STARTS
346100*          INDICATOR. IF SO, UPDATE THE STRT-INDR TO 'Y' ON THE
346200*          PREVIOUS EVENT.
346300           MOVE SPACES              TO PS94-COMMAREA-PARMS
346400           MOVE EMP-NBR OF WS-MSTR  TO PS94-EMP-NBR
346500           MOVE TZ-SYSTEM-TIME-ZONE TO PS94-TIME-ZONE
346600           MOVE WS-PS93-START-DTTM  TO PS94-HSL-EVENT-STRT-TS-DTTM
346700           SET  PS94-PREV-HSL       TO TRUE
346800           PERFORM P8920-CALL-PS94-PROGRAM
346900           IF SQL-SUCCESS
347000              MOVE PS94-TABLE-DATA  TO WS-HSL-TABLE
347100              IF (HSL-WORKING
347200              OR  HSL-LAYOFF
347300              OR  HSL-DH
347400              OR  HSL-ADMIN-OTHER
347500              OR  HSL-NON-SERVICE)
347600              AND HSL-STRT-INDR NOT = 'Y'
347700                 MOVE 'Y'          TO HSL-STRT-INDR
347800                 PERFORM PSQL-HSLUPD02
347900              END-IF
348000           END-IF
348100           MOVE 'N'                TO PS93-STRT-INDR
348200        END-IF
348300     END-IF
348400*CNC0526-END
348500*
348600     PERFORM P1101A-CALC-TIMES
348700*
348800     PERFORM P8910-CALL-PS93-PROGRAM
348900     IF PS93-ERROR
349000        MOVE 'P1101-01'            TO ERR-PARAGRAPH
349100*C1119 - BEG
349200        STRING 'PS93 - '
349300               PS93-EMP-NBR ' ' WS-PS93-START-DTTM
349400                            '/' WS-PS93-END-DTTM
349500               DELIMITED BY SIZE INTO ERR-KEY
349600*C1119 - END
349700        PERFORM P9999-GOT-PROBLEM
349800     END-IF
349900     .
350000******************************************************************
350100 P1101A-CALC-TIMES.
350200******************************************************************
350300* CALC TOTAL TIME
350400     MOVE ZEROES                     TO DATE-CONVERSION-PARMS
350500     MOVE PS93-HSD-EVENT-STRT-TS-DT  TO PARM-PRI-DATE-GREG
350600     MOVE PS93-HSD-EVENT-STRT-TS-TM  TO PARM-PRI-HRMN
350700     MOVE PS93-EVENT-END-TS-DT       TO PARM-SEC-DATE-GREG
350800     MOVE PS93-EVENT-END-TS-TM       TO PARM-SEC-HRMN
350900     SET PARM-DIFF                   TO TRUE
351000     EXEC CICS LINK
351100               PROGRAM(P903-PGM)
351200               COMMAREA(DATE-CONVERSION-PARMS)
351300               LENGTH(P903-LGTH)
351400               RESP(WS-RESPONSE)
351500     END-EXEC
351600     MOVE WS-RESPONSE              TO FILE-STATUS
351700     IF NOT SUCCESS
351800        MOVE 'P1101A-01'           TO ERR-PARAGRAPH
351900        MOVE 'P903'                TO ERR-KEY
352000        PERFORM P9999-GOT-PROBLEM
352100     END-IF
352200     COMPUTE WS-TOTAL-MN = (PARM-RES-TOT-DAYS * 1440) +
352300                           (PARM-RES-HR * 60) +
352400                           PARM-RES-MN
352500*
352600     PERFORM P1101C-CHECK-COMMINGLE-SVC
352700*
352800* CALC LIMBO TIME - EMP-PREV-DUTY HAS ALL OF THE CUMULATIVE
352900* TIME FOR THIS CALL
353000*
353100*CNC0484 - USE P925-US-PREV-TOT-DUTY INPLACE OF EMP-PREV-DUTY
353200     IF WS-US-PREV-TOT-DUTY > '1200' AND
353300        WS-APPLY-PREV-HOURS-YES
353400*C946
353500        MOVE WS-US-PREV-TOT-DUTY      TO WORK-TIME1
353600        MOVE P925-ACTUAL-TIME-ON-DUTY TO WORK-TIME2
353700        COMPUTE WORK-TIME3 = WORK-TIME1 - WORK-TIME2
353800        IF WORK-TIME3 > 1200
353900           MOVE WORK-TIME2            TO WS-HRMN
354000           IF WORK-TIME2 > 1200
354100             COMPUTE WS-LIMBO-MN = ((WS-HR * 60) + WS-MN) - 720
354200           ELSE
354300              COMPUTE WS-LIMBO-MN = ((WS-HR * 60) + WS-MN)
354400           END-IF
354500           IF WORK-TIME4 > ZEROES
354600              MOVE WORK-TIME4            TO WS-HRMN
354700              COMPUTE WS-LIMBO-MN = ((WS-HR * 60) + WS-MN) +
354800                                      WS-LIMBO-MN
354900           END-IF
355000        ELSE
355100*CNC0526-4.3-BEG
355200           IF  NON-SERVICE-ACT-FOUND
355300           AND WS-TTOD-CURR-EVENT-MN > 720
355400              COMPUTE WS-LIMBO-MN = WS-TTOD-CURR-EVENT-MN - 720
355500           ELSE
355600              MOVE WS-US-PREV-TOT-DUTY TO WS-HRMN
355700              IF WS-HRMN > 1200
355800                COMPUTE WS-LIMBO-MN = ((WS-HR * 60) + WS-MN) - 720
355900              END-IF
356000           END-IF
356100        END-IF
356200*CNC0526-4.3-END
356300*       MOVE WS-US-PREV-TOT-DUTY   TO WS-HRMN
356400*       COMPUTE WS-LIMBO-MN = ((WS-HR * 60) + WS-MN) - 720
356500     ELSE
356600*CNC0496
356700*CNC0526-4.3-BEG
356800        IF (P920-ADJ-TIE-AFTER-ON-DUTY OR NON-SERVICE-ACT-FOUND)
356900           AND WS-TOTAL-MN > 720
357000           COMPUTE WS-LIMBO-MN = WS-TOTAL-MN - 720
357100           IF NON-SERVICE-ACT-FOUND
357200              MOVE ZEROES            TO DATE-CONVERSION-PARMS
357300              SET PARM-ADD           TO TRUE
357400              MOVE P925-US-REST-DATE TO PARM-PRI-DATE-GREG
357500              MOVE P925-US-REST-TIME TO PARM-PRI-HRMN
357600              DIVIDE WS-LIMBO-MN BY 0060  GIVING PARM-SEC-HR
357700                                     REMAINDER PARM-SEC-MN
357800              EXEC CICS LINK
357900                        PROGRAM(P903-PGM)
358000                        COMMAREA(DATE-CONVERSION-PARMS)
358100                        LENGTH(P903-LGTH)
358200                        RESP(WS-RESPONSE)
358300              END-EXEC
358400              MOVE WS-RESPONSE            TO FILE-STATUS
358500              IF NOT SUCCESS
358600                 MOVE 'P1101A-2'          TO ERR-PARAGRAPH
358700                 PERFORM P9999-GOT-PROBLEM
358800              END-IF
358900              PERFORM P8520-READ-MASTER-UPDATE
359000              MOVE PARM-RES-DATE-GREG     TO EMP-US-RSTD-DATE
359100              MOVE PARM-RES-HRMN          TO EMP-US-RSTD-TIME
359200              PERFORM P8550-REWRITE-MASTER
359300*             SUBTRACT TYPE-7 DURATION FROM TOTAL-MN TO GET
359400*             TOTAL-MN FOR WORKING EVENT ONLY.
359500              COMPUTE WS-TOTAL-MN = WS-TOTAL-MN - WS-TYPE-7-HOS-TM
359600           END-IF
359700*CNC0526-4.3-END
359800        ELSE
359900           MOVE ZERO               TO WS-LIMBO-MN
360000        END-IF
360100     END-IF
360200     MOVE WS-TOTAL-MN              TO PS93-DURATION
360300     MOVE WS-LIMBO-MN              TO PS93-LIMBO-TM.
360400******************************************************************
360500 P1101A-CERTIFY-TOD.
360600******************************************************************
360700     INITIALIZE                       PS93-COMMAREA-PARMS
360800     SET PS93-UPDATE-HSL           TO TRUE
360900     MOVE EMP-NBR OF WS-MSTR       TO PS93-EMP-NBR
361000     MOVE P920-TIME-ZONE           TO PS93-TIME-ZONE
361100     MOVE AHM-EMP-OD-DATE-TIME     TO PS93-HSL-EVENT-STRT-TS-DTTM
361200     MOVE 'Y'                      TO PS93-CERTIFICATION-INDR
361300     PERFORM P8910-CALL-PS93-PROGRAM
361400     IF PS93-ERROR
361500        MOVE 'P1101A-01'           TO ERR-PARAGRAPH
361600*C1119 - BEG
361700        STRING 'PS93 - '
361800               PS93-EMP-NBR ' ' P920-TIME-ZONE
361900                            '/' AHM-EMP-OD-DATE-TIME
362000               DELIMITED BY SIZE INTO ERR-KEY
362100*C1119 - END
362200        PERFORM P9999-GOT-PROBLEM
362300     END-IF
362400     .
362500******************************************************************
362600 P1101B-CERTIFY-FRD.
362700******************************************************************
362800     INITIALIZE                       PS93-COMMAREA-PARMS
362900     SET PS93-UPDATE-HSL           TO TRUE
363000     MOVE FRD-EMP-NBR              TO PS93-EMP-NBR
363100     MOVE P920-TIME-ZONE           TO PS93-TIME-ZONE
363200     MOVE FRD-STRT-TS-DTTM         TO PS93-HSL-EVENT-STRT-TS-DTTM
363300     MOVE 'Y'                      TO PS93-CERTIFICATION-INDR
363400     PERFORM P8910-CALL-PS93-PROGRAM
363500     IF PS93-ERROR
363600        MOVE 'P1101B-01'           TO ERR-PARAGRAPH
363700*C1119 - BEG
363800        STRING 'PS93 - '
363900               PS93-EMP-NBR ' ' P920-TIME-ZONE
364000                            '/' FRD-STRT-TS-DTTM
364100               DELIMITED BY SIZE INTO ERR-KEY
364200*C1119 - END
364300        PERFORM P9999-GOT-PROBLEM
364400     END-IF
364500     .
364600******************************************************************
364700 P1101C-CHECK-COMMINGLE-SVC.
364800******************************************************************
364900*    COMMINGLE EITHER PREVIOUS OFF DUTY OR HSL TIMES WHICHEVER IS
365000*    WITHIN 4 HRS OF CURRENT TOUR OF DUTY
365100     IF WS-APPLY-PREV-HOURS-YES      AND
365200        P920-TIE-UP-FUNCTION
365300        MOVE SPACES                 TO PS94-COMMAREA-PARMS
365400        MOVE EMP-NBR OF WS-MSTR     TO PS94-EMP-NBR
365500        MOVE P920-TIME-ZONE         TO PS94-TIME-ZONE
365600        MOVE WS-PS93-START-DTTM     TO PS94-HSL-EVENT-STRT-TS-DTTM
365700        SET PS94-PREV-HSL           TO TRUE
365800        PERFORM P8920-CALL-PS94-PROGRAM
365900        IF SQL-SUCCESS
366000           MOVE PS94-TABLE-DATA      TO WS-HSL-TABLE
366100           PERFORM PSQL-HSL-FORMAT-DTTM-FROM-DB2
366200           IF HSL-EVENT-END-TS-DT > SAVE-PREV-TU-DATE  OR
366300             (HSL-EVENT-END-TS-DT = SAVE-PREV-TU-DATE AND
366400              HSL-EVENT-END-TS-TM > SAVE-PREV-TU-HRMN)
366500              MOVE ZEROES               TO DATE-CONVERSION-PARMS
366600              MOVE HSL-EVENT-END-TS-DT  TO PARM-PRI-DATE-GREG
366700              MOVE HSL-EVENT-END-TS-TM  TO PARM-PRI-HRMN
366800              MOVE WS-PS93-START-DATE   TO PARM-SEC-DATE-GREG
366900              MOVE WS-PS93-START-TIME   TO PARM-SEC-HRMN
367000              SET PARM-DIFF             TO TRUE
367100              EXEC CICS LINK
367200                      PROGRAM(P903-PGM)
367300                      COMMAREA(DATE-CONVERSION-PARMS)
367400                      LENGTH(P903-LGTH)
367500                      RESP(WS-RESPONSE)
367600              END-EXEC
367700              MOVE WS-RESPONSE              TO FILE-STATUS
367800              IF NOT SUCCESS
367900                 MOVE 'P1101C-01'           TO ERR-PARAGRAPH
368000                 MOVE 'P903'                TO ERR-KEY
368100                 PERFORM P9999-GOT-PROBLEM
368200              END-IF
368300              IF PARM-RES-TOT-DAYS < 1
368400                 IF PARM-RES-HRMN < '0400'
368500                    COMPUTE WS-TOTAL-MN = WS-TOTAL-MN
368600                                          + (PARM-RES-HR * 60)
368700                                          + PARM-RES-MN
368800*                   WS-TTOD-CURR-EVENT-MN IS TTOD OF CURRENT
368900*                   ACTIVITY PLUS DIFFERENCE BETWEEN PREVIOUS
369000*                   ACTIVITY END AND CURRENT ACTIVITY START.
369100                    MOVE  WS-TOTAL-MN     TO WS-TTOD-CURR-EVENT-MN
369200*CNC0526-4.3-BEG
369300*                   ADD TYPE-7 COMMINGLED TIME TO TOTAL-MN
369400                    IF HSL-EVENT-CD = '7'
369500                       MOVE ZEROS          TO WS-TYPE-7-HOS-TM
369600                       SET NON-SERVICE-ACT-FOUND TO TRUE
369700                       COMPUTE WS-TOTAL-MN = WS-TOTAL-MN
369800                                           + HSL-HOS-TM
369900                       MOVE HSL-HOS-TM     TO WS-TYPE-7-HOS-TM
370000                    END-IF
370100*CNC0526-4.3-END
370200                 END-IF
370300              END-IF
370400           ELSE
370500              PERFORM P1101D-CHECK-PREV-OFF-DUTY
370600           END-IF
370700        ELSE
370800           PERFORM P1101D-CHECK-PREV-OFF-DUTY
370900        END-IF
371000     END-IF.
371100******************************************************************
371200 P1101D-CHECK-PREV-OFF-DUTY.
371300******************************************************************
371400     IF SAVE-PREV-TU-DATE > '000000'
371500        MOVE ZEROES                    TO DATE-CONVERSION-PARMS
371600        MOVE SAVE-PREV-TU-DATE         TO PARM-PRI-DATE-GREG
371700        MOVE SAVE-PREV-TU-HRMN         TO PARM-PRI-HRMN
371800        MOVE PS93-HSD-EVENT-STRT-TS-DT TO PARM-SEC-DATE-GREG
371900        MOVE PS93-HSD-EVENT-STRT-TS-TM TO PARM-SEC-HRMN
372000        SET PARM-DIFF                   TO TRUE
372100        EXEC CICS LINK
372200                  PROGRAM(P903-PGM)
372300                  COMMAREA(DATE-CONVERSION-PARMS)
372400                  LENGTH(P903-LGTH)
372500                  RESP(WS-RESPONSE)
372600        END-EXEC
372700        MOVE WS-RESPONSE              TO FILE-STATUS
372800        IF NOT SUCCESS
372900           MOVE 'P1101D-01'           TO ERR-PARAGRAPH
373000           MOVE 'P903'                TO ERR-KEY
373100           PERFORM P9999-GOT-PROBLEM
373200        END-IF
373300*
373400*       IF THE EMPLOYEE WAS OFF DUTY FOR LESS THAN 4 HOURS
373500*       THE TIME BETWEEN THE CALL AND THE LAST TIE-UP IS
373600*       CONSIDERED SERVICE AND NEEDS TO BE INCLUDED IN
373700*       THE DURATION
373800*
373900        IF PARM-RES-TOT-DAYS < 1 AND
374000           PARM-RES-HRMN < '0400'
374100           COMPUTE WS-TOTAL-MN = WS-TOTAL-MN
374200                               + (PARM-RES-HR * 60)
374300                               + PARM-RES-MN
374400*C946
374500           MOVE PARM-RES-HRMN         TO WORK-TIME4
374600        END-IF
374700     END-IF
374800     .
374900******************************************************************
375000 P1101E-BUILD-HSD-LOC.
375100******************************************************************
375200     IF AHM-AHIST-KEY       > SPACES AND
375300        AHM-EMPLOYEE-KEY    > SPACES AND
375400        AHM-EMPLOYEE-NUMBER > SPACES AND
375500        AHM-EMP-OD-DATE-TIME > SPACES
375600        MOVE SPACES                TO WS-FRA-STORAGE
375700        MOVE AHM-AHIST-KEY         TO FRA-AHIST-KEY
375800        MOVE AHM-EMPLOYEE-KEY      TO FRA-AHM-EMP-KEY
375900        MOVE AHM-EMPLOYEE-NUMBER   TO FRA-EMP-NBR
376000        MOVE AHM-EMP-OD-DATE-TIME  TO WS-PS93-START-DTTM
376100        PERFORM PSQL-FRASEL10
376200        IF SQL-SUCCESS AND
376300           FRA-STRT-STN > SPACES AND
376400           FRA-RLSD-STN > SPACES
376500*
376600           IF P920-TIME-ZONE NOT = TZ-SYSTEM-TIME-ZONE
376700              MOVE SPACES               TO TZ-PARAMETERS
376800              MOVE P920-TIME-ZONE       TO TZ-IN-ZONE
376900              MOVE WS-PS93-START-DTTM   TO TZ-IN-DATE-TIME
377000              MOVE TZ-SYSTEM-TIME-ZONE  TO TZ-OUT-ZONE
377100              PERFORM P8996-TIMEZONE
377200              IF TZ-INVALID-PARAMETERS
377300                 MOVE 'P1101E'          TO ERR-PARAGRAPH
377400                 PERFORM P8996-TZERROR
377500              END-IF
377600              MOVE TZ-OUT-DATE-TIME     TO WS-PS93-START-DTTM
377700           END-IF
377800           MOVE AHM-EMPLOYEE-NUMBER TO HSD-EMP-NBR
377900           MOVE WS-PS93-START-DTTM  TO HSD-EVENT-START-TS-DTTM
378000           MOVE FRA-STRT-STN        TO HSD-DTL-EVENT-START-LO
378100           MOVE FRA-RLSD-STN        TO HSD-DTL-EVENT-END-LO
378200           PERFORM PSQL-HSDUPD01
378300        END-IF
378400     END-IF
378500     .
378600******************************************************************
378700 P1108-READ-CREW-PROFILE.
378800******************************************************************
378900     MOVE AH-CALL-ASGN-PROFILE-KEY TO TRCN-KEY1
379000     MOVE TRCN-KEY1                TO TRCNKEY1
379100     EXEC CICS READ
379200               DATASET(TRAIN-CN-VIA-TRCNKEY1)
379300               INTO(WS-TRCN-FILE)
379400               LENGTH(TRAINCN-RLGTH)
379500               RIDFLD(TRCNKEY1)
379600               KEYLENGTH(TRAINCN-KLGTH)
379700               RESP(WS-RESPONSE)
379800     END-EXEC
379900     MOVE WS-RESPONSE              TO FILE-STATUS
380000     IF NOT SUCCESS
380100        MOVE 'P1108-1'         TO ERR-PARAGRAPH
380200        MOVE TRCNKEY1          TO ERR-KEY
380300        PERFORM P9999-GOT-PROBLEM
380400     END-IF
380500     .
380600******************************************************************
380700 P1111-GET-AHM-RECORD.
380800******************************************************************
380900     MOVE SPACES                         TO AHM-KEY
381000     MOVE AH-KEY-1                       TO AHM-AHIST-KEY
381100     SET AHM-EMPLOYEE-RECORD             TO TRUE
381200
381300     PERFORM VARYING I FROM 1 BY 1
381400        UNTIL I > WS-CRAFT-TABLE-MAX
381500           OR CT-CRAFT-CODE(I) = P920-ASGN-CC
381600     END-PERFORM
381700     IF I > WS-CRAFT-TABLE-MAX
381800        MOVE 'P1111-1'                   TO ERR-PARAGRAPH
381900        MOVE P920-ASGN-CC                TO ERR-KEY
382000        PERFORM P9999-GOT-PROBLEM
382100     END-IF
382200     MOVE CT-CRAFT-SEQ(I)                TO AHM-CRAFT-SEQ
382300
382400     PERFORM P8300-READ-GTEQ-AH-MISC
382500     PERFORM UNTIL P920-ASGN-ON-DUTY-EMP = AHM-EMPLOYEE-NUMBER
382600           OR NOT SUCCESS
382700           OR NOT AHM-EMPLOYEE-RECORD
382800           OR AH-KEY-1        NOT = AHM-AHIST-KEY
382900           OR CT-CRAFT-SEQ(I) NOT = AHM-CRAFT-SEQ
383000        MOVE HIGH-VALUE                  TO AHM-KEY(43:1)
383100        PERFORM P8300-READ-GTEQ-AH-MISC
383200     END-PERFORM
383300
383400     IF P920-ASGN-ON-DUTY-EMP NOT = AHM-EMPLOYEE-NUMBER
383500        MOVE 'P1111-2'                   TO ERR-PARAGRAPH
383600        MOVE AHMKEY                      TO ERR-KEY
383700        PERFORM P9999-GOT-PROBLEM
383800     ELSE
383900        MOVE AHM-OD-ASSIGN               TO WS-EMP-OD-ASSIGN
384000     END-IF
384100     .
384200******************************************************************
384300 P1112-CHECK-FOR-DEADHEAD.
384400******************************************************************
384500     SET NO-DEADHEAD-FOUND              TO TRUE
384600     MOVE SPACES                        TO WORK-CNTLKEY
384700     MOVE '02'                          TO WK-CNTL-REC-TYPE
384800     MOVE ASGN-DIST                     TO WK-CNTL-DIST
384900     MOVE ASGN-SUB-DIST                 TO WK-CNTL-SUB-DIST
385000     PERFORM P8640-READ-CNTLFILE
385100     IF NOT SUCCESS
385200        MOVE 'P1112-1'                  TO ERR-PARAGRAPH
385300        MOVE CNTLKEY                    TO ERR-KEY
385400        PERFORM P9999-GOT-PROBLEM
385500     END-IF
385600*
385700*    CONVERT THE ASGN-DATE-TIME TO SYSTEM TIME.  WE'LL USE THE
385800*    RESULTS TO GO AFTER A DEADHEAD RECORD ON THE POINTER FILE.
385900*
386000     MOVE ASGN-DATE-TIME                TO TZ-IN-DATE-TIME
386100     MOVE CNTL-TIME-ZONE                TO TZ-IN-ZONE
386200     SET TZ-OUT-SYSTEM-ZONE             TO TRUE
386300     PERFORM P8996-TIMEZONE
386400     IF TZ-INVALID-PARAMETERS
386500        MOVE 'P1112-2'                  TO ERR-PARAGRAPH
386600        PERFORM P8996-TZERROR
386700     END-IF
386800
386900     MOVE TZ-OUT-DATE-CENT              TO WS-POINT-EFF-DATE
387000     MOVE TZ-OUT-TIME                   TO WS-POINT-EFF-TIME
387100*
387200*    LOOK FOR A DEADHEAD POINTER RECORD WITH THE SAME TIME AS THE
387300*    ASGN-DATE-TIME.  IF ONE EXISTS, IT INDICATES THE EMPLOYEE
387400*    IS ON AN OUTPOST ASSIGNMENT.  IF IT DOESN'T EXIST, IT
387500*    MEANS THE EMPLOYEE WAS ASSIGNED FUTHER NOTICE VIA THE
387600*    VACANCY FILL PROCESS, AND IS NOT ON AN OUTPOST.
387700*
387800     MOVE SPACES                        TO WS-POINTER
387900     MOVE ASGN-EMP-NO                   TO POINT-EMP-NBR
388000     SET POINT-ASGN-CHANGE              TO TRUE
388100     MOVE WS-POINT-EFF-DATE-TIME        TO POINT-EFF-CE-DATE-TIME
388200     MOVE ZERO                          TO POINT-SEQ
388300     SET POINTER-NOT-DONE               TO TRUE
388400     PERFORM UNTIL POINTER-DONE
388500        MOVE POINT-NBR-KEY              TO POINTKEY
388600        EXEC CICS READ
388700                  GTEQ
388800                  DATASET  (POINT-FILE-VIA-EMP)
388900                  INTO     (WS-POINTER)
389000                  LENGTH   (POINT-RLGTH)
389100                  RIDFLD   (POINTKEY)
389200                  KEYLENGTH(POINT-KLGTH)
389300                  RESP     (WS-RESPONSE)
389400        END-EXEC
389500        MOVE WS-RESPONSE                TO FILE-STATUS
389600        IF NOT SUCCESS
389700           IF NOT END-OF-FILE
389800              MOVE 'P1112-3'            TO ERR-PARAGRAPH
389900              MOVE POINTKEY             TO ERR-KEY
390000              PERFORM P9999-GOT-PROBLEM
390100           END-IF
390200           SET POINTER-DONE             TO TRUE
390300        ELSE
390400           IF POINT-EMP-NBR = ASGN-EMP-NO
390500              AND POINT-ASGN-CHANGE
390600              AND POINT-EFF-CE-DATE-TIME = WS-POINT-EFF-DATE-TIME
390700              IF POINT-DEADHEAD-FUN
390800                 SET DEADHEAD-FOUND     TO TRUE
390900                 SET POINTER-DONE       TO TRUE
391000              END-IF
391100           ELSE
391200              SET POINTER-DONE          TO TRUE
391300           END-IF
391400        END-IF
391500        IF POINTER-NOT-DONE
391600           ADD +1                       TO POINT-SEQ
391700        END-IF
391800     END-PERFORM
391900     .
392000*
392100******************************************************************
392200 P1113-CHECK-FOR-7TH-START.
392300******************************************************************
392400     INITIALIZE PS94-COMMAREA-PARMS
392500     SET PS94-SUM-FUNC           TO TRUE
392600     SET WS-COUNT-AS-START-YES   TO TRUE
392700     MOVE EMP-NBR OF WS-MSTR     TO PS94-EMP-NBR
392800     MOVE P920-TIME-ZONE         TO PS94-TIME-ZONE
392900     MOVE WS-PS93-START-DTTM     TO PS94-HSL-EVENT-STRT-TS-DTTM
393000                                    PS94-HSL-EVENT-END-TS-DTTM
393100     PERFORM P8920-CALL-PS94-PROGRAM
393200     IF PS94-CONSECUTIVE-STARTS < 6
393300        SET WS-COUNT-AS-START-NO TO TRUE
393400     END-IF.
393500*
393600******************************************************************
393700 P1120-CHECK-QUALIFICATIONS.
393800******************************************************************
393900     MOVE SPACES                        TO WS-QUALIFICATION-ARRAY
394000     MOVE ZEROS                         TO QUAL-SUB
394100*-----------------------------------------------------------------
394200*    CHECK FOR AUTO RENEW QUALIFICATIONS FOR THE ASSIGNMENT
394300*-----------------------------------------------------------------
394400     MOVE SPACES                        TO WORK-CNTLKEY
394500     MOVE '13'                          TO WK-CNTL-REC-TYPE
394600     IF P920-ASGN-UFP
394700        MOVE P920-ASGN-PARM             TO UFPTURN-AREA
394800        MOVE DIST2                      TO WK-CNTL-DIST
394900        MOVE SUB-DIST2                  TO WK-CNTL-SUB-DIST
395000        MOVE 'P'                        TO WK-CNTL-ASGN-QUAL-TYPE
395100        MOVE UFPTURN-5-12               TO WK-CNTL-ASGN-QUAL
395200        PERFORM P8640-READ-CNTLFILE
395300        IF NOT SUCCESS
395400           MOVE '**'                    TO WK-CNTL-ASGN-QUAL-5-6
395500           PERFORM P8640-READ-CNTLFILE
395600           IF NOT SUCCESS
395700              MOVE '**'                 TO WK-CNTL-ASGN-QUAL-3-4
395800              PERFORM P8640-READ-CNTLFILE
395900           END-IF
396000        END-IF
396100     ELSE
396200        MOVE P920-ASGN-PARM             TO AJJOBKEY-AREA
396300        MOVE AJ-JOB-DIST                TO WK-CNTL-DIST
396400        MOVE AJ-JOB-SUB-DIST            TO WK-CNTL-SUB-DIST
396500        MOVE 'A'                        TO WK-CNTL-ASGN-QUAL-TYPE
396600        MOVE AJ-JOB-ASSIGNMENT          TO WK-CNTL-ASGN-QUAL
396700        PERFORM P8640-READ-CNTLFILE
396800        IF NOT SUCCESS
396900           MOVE '**'                    TO WK-CNTL-ASGN-QUAL-5-6
397000           PERFORM P8640-READ-CNTLFILE
397100        END-IF
397200     END-IF
397300     IF SUCCESS
397400        PERFORM VARYING SUB1 FROM 1 BY 1
397500           UNTIL SUB1 > 5
397600           IF CNTL-QUALIFICATION-TABLE-ENTRY(SUB1) > SPACE
397700              MOVE CNTL-QUALIFICATION-TABLE-ENTRY(SUB1)
397800                 TO QUALIFICATION
397900              PERFORM P1121-GET-QUAL-CNTL
398000           END-IF
398100        END-PERFORM
398200     ELSE
398300        IF NOT (NO-RECORD-FND OR END-OF-FILE)
398400           MOVE 'P1120-1'               TO ERR-PARAGRAPH
398500           MOVE WORK-CNTLKEY            TO ERR-KEY
398600           PERFORM P9999-GOT-PROBLEM
398700        END-IF
398800     END-IF
398900*-----------------------------------------------------------------
399000*    CHECK FOR AUTO RENEW QUALIFICATIONS IN THE PROFILE
399100*-----------------------------------------------------------------
399200     MOVE P926-ASGN-HIST-KEY            TO AH1KEY
399300     PERFORM P8700-READ-AHIST
399400     IF SUCCESS
399500        MOVE AH-CALL-ASGN-PROFILE-KEY   TO TRCNKEY1
399600        EXEC CICS READ
399700                  DATASET(TRAIN-CN-VIA-TRCNKEY1)
399800                  INTO(WS-TRCN-FILE)
399900                  LENGTH(TRAINCN-RLGTH)
400000                  RIDFLD(TRCNKEY1)
400100                  KEYLENGTH(TRAINCN-KLGTH)
400200                  RESP(WS-RESPONSE)
400300        END-EXEC
400400        MOVE WS-RESPONSE                TO FILE-STATUS
400500        IF SUCCESS
400600           MOVE P920-TIE-UP-CC TO WS-HOLD-CC
400700           IF WS-HOLD-CC = 'FI' OR 'SE'
400800              MOVE 'SE'               TO WS-HOLD-CC
400900           END-IF
401000           IF WS-HOLD-CC = 'S1' OR 'S2'
401100              MOVE 'SW'               TO WS-HOLD-CC
401200           END-IF
401300           IF WS-HOLD-CC = ('B1' OR 'B2')
401400              MOVE 'BK'               TO WS-HOLD-CC
401500           END-IF
401600           PERFORM VARYING SUBA FROM 1 BY 1 UNTIL SUBA > 4
401700              IF WS-HOLD-CC = TRCN-SPCL-QUAL-CC(SUBA)
401800                 MOVE TRCN-SPCL-QUAL(SUBA) TO QUALIFICATION
401900                 PERFORM P1121-GET-QUAL-CNTL
402000              END-IF
402100           END-PERFORM
402200*CNC0572 - BEG
402300           PERFORM VARYING SUBA FROM 1 BY 1 UNTIL SUBA > 4
402400              IF WS-HOLD-CC = TRCN-SPCL-QUAL2-CC(SUBA)
402500                 MOVE TRCN-SPCL-QUAL2(SUBA) TO QUALIFICATION
402600                 PERFORM P1121-GET-QUAL-CNTL
402700              END-IF
402800           END-PERFORM
402900*CNC0572 - END
403000        ELSE
403100           IF NOT NO-RECORD-FND
403200              MOVE 'P1120-2'            TO ERR-PARAGRAPH
403300              MOVE TRCNKEY1             TO ERR-KEY
403400              PERFORM P9999-GOT-PROBLEM
403500           END-IF
403600        END-IF
403700     ELSE
403800        MOVE 'P1120-3'                  TO ERR-PARAGRAPH
403900        MOVE AH1KEY                     TO ERR-KEY
404000        PERFORM P9999-GOT-PROBLEM
404100     END-IF
404200*-----------------------------------------------------------------
404300*    CHECK FOR TRAINING QUALIFICATIONS
404400*-----------------------------------------------------------------
404500     MOVE SPACES                        TO WORK-CNTLKEY
404600     MOVE 'Z8'                          TO WK-CNTL-REC-TYPE
404700     PERFORM P8641-STARTBR-CNTLFILE
404800     IF NOT SUCCESS
404900        IF NOT (NO-RECORD-FND OR END-OF-FILE)
405000           MOVE 'P1120-4'               TO ERR-PARAGRAPH
405100           MOVE CNTLKEY                 TO ERR-KEY
405200           MOVE 'STARTBR ERROR'         TO ERR-SENTENCE
405300           PERFORM P9999-GOT-PROBLEM
405400        END-IF
405500     ELSE
405600        MOVE SPACES                     TO OJT-DONE-FLAG
405700        PERFORM UNTIL NOT SUCCESS OR
405800                      OJT-DONE
405900           PERFORM P8642-READNEXT-CNTLFILE
406000           IF SUCCESS
406100              IF QUAL-CODE-OJT-REC
406200                 MOVE SPACES              TO IN-ARRAY-FLAG
406300                 PERFORM VARYING CHEK-SUB FROM 1 BY 1
406400                         UNTIL CHEK-SUB    > QUAL-SUB OR
406500                               IN-ARRAY
406600                    IF CNTL-Z8-QUAL-OJT    = WS-QUAL (CHEK-SUB)
406700                       SET IN-ARRAY       TO TRUE
406800                    END-IF
406900                 END-PERFORM
407000                 IF NOT IN-ARRAY
407100                    ADD 1                   TO OJT-SUB
407200                    IF OJT-SUB NOT > MAX-ARRAY-OJT
407300                       MOVE CNTL-Z8-QUAL-OJT
407400                                         TO WS-SAVE-OJT (OJT-SUB)
407500                       SET OJT-CODES-FOUND  TO TRUE
407600                    ELSE
407700                       MOVE 'P1120-5'       TO ERR-PARAGRAPH
407800                       MOVE OJT-SUB         TO ERR-KEY
407900                       MOVE 'OJT ARRAY OVERFLOW' TO ERR-SENTENCE
408000                       PERFORM P9999-GOT-PROBLEM
408100                    END-IF
408200                 END-IF
408300              ELSE
408400                 SET OJT-DONE               TO TRUE
408500              END-IF
408600           ELSE
408700              SET OJT-DONE               TO TRUE
408800              IF NOT (NO-RECORD-FND OR END-OF-FILE)
408900                 MOVE 'P1120-6'             TO ERR-PARAGRAPH
409000                 MOVE CNTLKEY               TO ERR-KEY
409100                 MOVE 'READNEXT EROR'       TO ERR-SENTENCE
409200                 PERFORM P9999-GOT-PROBLEM
409300              END-IF
409400           END-IF
409500        END-PERFORM
409600        PERFORM P8643-ENDBR-CNTLFILE
409700     END-IF
409800     IF OJT-CODES-FOUND
409900        MOVE SPACES                         TO OJT-DONE-FLAG
410000        PERFORM VARYING OJT-SUB FROM 1 BY 1
410100                UNTIL OJT-DONE OR
410200                OJT-SUB > MAX-ARRAY-OJT
410300           IF WS-SAVE-OJT (OJT-SUB) > SPACES
410400              MOVE WS-SAVE-OJT (OJT-SUB)  TO QUALIFICATION
410500              PERFORM P1121-GET-QUAL-CNTL
410600           ELSE
410700              SET OJT-DONE         TO TRUE
410800           END-IF
410900        END-PERFORM
411000     END-IF
411100*-----------------------------------------------------------------
411200     IF WS-QUALIFICATION-ARRAY > SPACES
411300        PERFORM VARYING QUAL-SUB FROM 1 BY 1
411400           UNTIL QUAL-SUB > 20
411500           IF WS-QUAL(QUAL-SUB) > SPACES
411600              MOVE P920-ASGN-ON-DUTY-EMP
411700                                        TO QUAL-EMP-NO
411800              MOVE WS-QUAL(QUAL-SUB)    TO QUALIFICATION
411900              MOVE QUALEMP-KEY          TO QUALEMP
412000              PERFORM P8100-READ-QUAL
412100              IF SUCCESS
412200                 IF NOT QUAL-IS-NON-EXPIRING
412300*-----------------------------------------------------------------
412400*    NON-EXPIRING QUALIFICATIONS MAY BE ACTIVATED BY MEETING A
412500*    PRESCRIBED NUMBER OF QUALIFIED TRIPS.  ONCE ACTIVATED, THESE
412600*    QUALIFICATIONS REMAIN NON-EXPIRING FOR AS LONG AS THE
412700*    EMPLOYEE HAS THAT QUAL CODE.  AUTO-RENEW QUALIFICATIONS MAY
412800*    HAVE THE ASSOCIATED QUAL DATE 'RENEWED' EACH TIME THAT
412900*    THE NUMBER OF TRIPS ARE TAKEN WITHIN A CERTAIN PERIOD.
413000*--------------------------------------------------------------PLS
413100                    PERFORM P1123-CHECK-TRIPS
413200                    IF TRIP-QUALIFIES
413300                       PERFORM P1129-ADD-TRIP-TO-LOG
413400                       IF P931-TRIP-RET-ACCRUED >=
413500                                     WS-QUAL-TRIP-CNTR(QUAL-SUB)
413600                          IF QUAL-AUTO-RENEWAL
413700                             MOVE ZEROES TO DATE-CONVERSION-PARMS
413800                             SET PARM-ADD  TO TRUE
413900                             MOVE WS-QUAL-ON-DUTY-DATE
414000                                        TO PARM-PRI-DATE-GREG
414100                             ADD WS-QUAL-RENEW-DAYS-NUM(QUAL-SUB)
414200                                TO 1 GIVING PARM-SEC-JULIAN-DAY
414300                             EXEC CICS LINK
414400                                  PROGRAM(P903-PGM)
414500                                  COMMAREA(DATE-CONVERSION-PARMS)
414600                                  LENGTH(P903-LGTH)
414700                                  RESP(WS-RESPONSE)
414800                             END-EXEC
414900                             MOVE WS-RESPONSE      TO FILE-STATUS
415000                             IF NOT SUCCESS
415100                                MOVE 'P1120-6'   TO ERR-PARAGRAPH
415200                                MOVE 'P903LINK'     TO ERR-KEY
415300                                PERFORM P9999-GOT-PROBLEM
415400                             END-IF
415500                             MOVE PARM-RES-DATE-GREG
415600                                                  TO WS-QUAL-DATE
415700                          ELSE
415800                             MOVE '999999'        TO WS-QUAL-DATE
415900                          END-IF
416000                          PERFORM P1122-UPDATE-QUAL-DATE
416100                       END-IF
416200                    END-IF
416300                 END-IF
416400              ELSE
416500                 IF NOT (NO-RECORD-FND OR END-OF-FILE)
416600                    MOVE 'P1120-7'      TO ERR-PARAGRAPH
416700                    MOVE QUALEMP        TO ERR-KEY
416800                    PERFORM P9999-GOT-PROBLEM
416900                 END-IF
417000              END-IF
417100           ELSE
417200              MOVE 20                   TO QUAL-SUB
417300           END-IF
417400        END-PERFORM
417500     END-IF.
417600*
417700******************************************************************
417800 P1121-GET-QUAL-CNTL.
417900******************************************************************
418000*    READ THE QUALIFICATION CONTROL RECORD AND SET UP THE
418100*    QUALIFICATION ARRAY.
418200*--------------------------------------------------------------PLS
418300     MOVE WS-CNTL-FILE          TO WS-HOLD-CNTL-FILE
418400     MOVE SPACES                TO WORK-CNTLKEY
418500     MOVE '12'                  TO WK-CNTL-REC-TYPE
418600     MOVE QUALIFICATION         TO WK-CNTL-QUAL
418700     PERFORM P8640-READ-CNTLFILE
418800     IF NOT SUCCESS
418900        IF NOT NO-RECORD-FND
419000           MOVE 'P1121-1'       TO ERR-PARAGRAPH
419100           MOVE CNTLKEY         TO ERR-KEY
419200           PERFORM P9999-GOT-PROBLEM
419300        END-IF
419400        MOVE SPACES             TO WS-CNTL-FILE
419500     END-IF
419600*-----------------------------------------------------------------
419700*    QUALIFICATIONS WHICH ARE AUTO-RENEW OR WHICH REQUIRE A
419800*    CERTAIN NUMBER OF TRIPS TO BE ACTIVATED ARE LOADED INTO THE
419900*    QUALIFICATION ARRAY, ALONG WITH CONTROL TABLE DATA NEEDED
420000*    FOR FURTHER PROCESSING.
420100*--------------------------------------------------------------PLS
420200     IF QUAL-AUTO-RENEWAL OR
420300        CNTL-QUAL-TRIP-CNTR > ZEROES
420400        ADD 1                         TO QUAL-SUB
420500        IF QUAL-SUB > MAX-ARRAY-QUAL
420600           MOVE 'P1121-2'             TO ERR-PARAGRAPH
420700           MOVE QUAL-SUB              TO ERR-KEY
420800           MOVE 'QUAL ARRAY OVERFLOW' TO ERR-SENTENCE
420900           PERFORM P9999-GOT-PROBLEM
421000        ELSE
421100           MOVE QUALIFICATION  TO WS-QUAL (QUAL-SUB)
421200           IF CNTL-QUAL-RENEW-DAYS > ZEROES
421300              MOVE CNTL-QUAL-RENEW-DAYS
421400                               TO WS-QUAL-RENEW-DAYS (QUAL-SUB)
421500           END-IF
421600           IF CNTL-QUAL-TRIP-CNTR NUMERIC
421700              MOVE ZERO        TO WS-QUAL-TRIP-CNTR(QUAL-SUB)
421800              MOVE CNTL-QUAL-TRIP-CNTR
421900                               TO WS-QUAL-TRIP-CNTR-2(QUAL-SUB)
422000           END-IF
422100           MOVE CNTL-QUAL-ENG-OJT-TRNR
422200                               TO WS-QUAL-ENG-OJT-TRNR (QUAL-SUB)
422300           MOVE CNTL-QUAL-OJT-CODE
422400                               TO WS-QUAL-OJT-CODE (QUAL-SUB)
422500        END-IF
422600     END-IF
422700     MOVE WS-HOLD-CNTL-FILE    TO WS-CNTL-FILE.
422800*
422900******************************************************************
423000 P1122-UPDATE-QUAL-DATE.
423100******************************************************************
423200     MOVE SPACES                 TO QUALEMP-KEY
423300     MOVE P920-ASGN-ON-DUTY-EMP  TO QUAL-EMP-NO
423400     MOVE WS-QUAL (QUAL-SUB)     TO QUALIFICATION
423500     MOVE QUALEMP-KEY            TO QUALEMP
423600     EXEC CICS READ
423700               UPDATE
423800               DATASET(QUAL-FILE-VIA-QUALEMP)
423900               INTO(WS-QUAL-FILE)
424000               LENGTH(QUALEMP-RLGTH)
424100               RIDFLD(QUALEMP)
424200               KEYLENGTH(QUALEMP-KLGTH)
424300               RESP(WS-RESPONSE)
424400     END-EXEC
424500     MOVE WS-RESPONSE            TO FILE-STATUS
424600     IF NOT SUCCESS
424700        MOVE 'P1122-1'           TO ERR-PARAGRAPH
424800        MOVE QUALEMP             TO ERR-KEY
424900        PERFORM P9999-GOT-PROBLEM
425000     END-IF
425100     MOVE WS-QUAL-DATE           TO QUAL-DATE
425200     MOVE WS-QUAL-ON-DUTY-DATE   TO QUAL-LAST-RENEW-DATE
425300     MOVE WS-QUAL-ON-DUTY-TIME   TO QUAL-LAST-RENEW-TIME
425400     IF QUAL-EMP-NO2             <= SPACES
425500        MOVE QUAL-EMP-NO         TO QUAL-EMP-NO2
425600     END-IF
425700     EXEC CICS REWRITE
425800               DATASET(QUAL-FILE-VIA-QUALEMP)
425900               FROM(WS-QUAL-FILE)
426000               LENGTH(QUALEMP-RLGTH)
426100               RESP(WS-RESPONSE)
426200     END-EXEC
426300     MOVE WS-RESPONSE            TO FILE-STATUS
426400     IF NOT SUCCESS
426500        MOVE 'P1122-2'           TO ERR-PARAGRAPH
426600        MOVE QUALEMP             TO ERR-KEY
426700        PERFORM P9999-GOT-PROBLEM
426800     END-IF.
426900*
427000******************************************************************
427100 P1123-CHECK-TRIPS.
427200******************************************************************
427300*    IN ORDER FOR A TRIP TO QUALIFY, A TRAINER ON BOARD MAY BE
427400*    REQUIRED.  VERIFY THE QUALIFICATIONS OF THE ACCOMPANYING
427500*    EMPLOYEES, AGAINS THE REQUIRED TRAINER QUAL CODE.
427600*--------------------------------------------------------------PLS
427700     SET TRIP-DOES-NOT-QUAL          TO TRUE
427800     IF NOT WS-QUAL-ENGINEER-OJT (QUAL-SUB)
427900        SET TRIP-QUALIFIES           TO TRUE
428000     ELSE
428100        IF WS-QUAL-OJT-CODE (QUAL-SUB) > SPACES
428200           PERFORM P1124-CHECK-OUT-CREW
428300         END-IF
428400     END-IF.
428500*
428600******************************************************************
428700 P1124-CHECK-OUT-CREW.
428800******************************************************************
428900*    READ THROUGH THE EMPLOYEE RECORDS ON THE ASSIGNMENT HISTORY
429000*    AND GET THE QUALIFICATIONS FOR EACH EMPLOYEE.  COMPARE TO
429100*    THE OJT CODE NEEDED BY THE 'TRAINEE'.
429200*--------------------------------------------------------------PLS
429300     MOVE WS-QUAL-FILE               TO WS-HOLD-QUAL-FILE
429400     MOVE SPACES                     TO WS-AHIST-MISC
429500     MOVE P926-ASGN-HIST-KEY         TO AHM-AHIST-KEY
429600     SET AHM-EMPLOYEE-RECORD         TO TRUE
429700     MOVE SPACES                     TO AHM-VARIABLE
429800     MOVE AHM-KEY                    TO AHMKEY
429900     EXEC CICS STARTBR
430000               DATASET(AHM-FILE)
430100               RIDFLD(AHMKEY)
430200               GTEQ
430300               RESP(WS-RESPONSE)
430400     END-EXEC
430500     MOVE WS-RESPONSE                TO FILE-STATUS
430600     IF NOT SUCCESS
430700        MOVE 'P1124-1'               TO ERR-PARAGRAPH
430800        MOVE AHMKEY                  TO ERR-KEY
430900        PERFORM P9999-GOT-PROBLEM
431000     END-IF
431100     MOVE 'N'                        TO WS-AHMISC-DONE
431200     PERFORM UNTIL AHMISC-DONE
431300        EXEC CICS READNEXT
431400                  DATASET(AHM-FILE)
431500                  INTO(WS-AHIST-MISC)
431600                  LENGTH(AHM-RLGTH)
431700                  RIDFLD(AHMKEY)
431800                  KEYLENGTH(AHM-KLGTH)
431900                  RESP(WS-RESPONSE)
432000        END-EXEC
432100        MOVE WS-RESPONSE             TO FILE-STATUS
432200        IF NOT SUCCESS
432300           IF NOT (NO-RECORD-FND OR END-OF-FILE)
432400              MOVE 'P1124-2'         TO ERR-PARAGRAPH
432500              MOVE AHMKEY            TO ERR-KEY
432600              PERFORM P9999-GOT-PROBLEM
432700           ELSE
432800              SET AHMISC-DONE        TO TRUE
432900           END-IF
433000        ELSE
433100           IF AHM-AHIST-KEY NOT = P926-ASGN-HIST-KEY
433200              OR NOT AHM-EMPLOYEE-RECORD
433300              SET AHMISC-DONE        TO TRUE
433400           ELSE
433500              IF AHM-EMPLOYEE-NUMBER NOT = P920-ASGN-ON-DUTY-EMP
433600                 AND NOT AHM-VACANT-TURN
433700                 MOVE SPACES                    TO QUALEMP-KEY
433800                 MOVE AHM-EMPLOYEE-NUMBER       TO QUAL-EMP-NO
433900                 MOVE WS-QUAL-OJT-CODE (QUAL-SUB)
434000                                                TO QUALIFICATION
434100                 MOVE QUALEMP-KEY               TO QUALEMP
434200                 EXEC CICS READ
434300                           DATASET(QUAL-FILE-VIA-QUALEMP)
434400                           INTO(WS-QUAL-FILE)
434500                           LENGTH(QUALEMP-RLGTH)
434600                           RIDFLD(QUALEMP)
434700                           KEYLENGTH(QUALEMP-KLGTH)
434800                           RESP(WS-RESPONSE)
434900                 END-EXEC
435000                 MOVE WS-RESPONSE                TO FILE-STATUS
435100                 IF SUCCESS
435200                    SET TRIP-QUALIFIES           TO TRUE
435300                    SET AHMISC-DONE              TO TRUE
435400                 END-IF
435500              END-IF
435600           END-IF
435700        END-IF
435800     END-PERFORM
435900     EXEC CICS ENDBR
436000               DATASET(AHM-FILE)
436100               RESP(WS-RESPONSE)
436200     END-EXEC
436300     MOVE WS-HOLD-QUAL-FILE                      TO WS-QUAL-FILE.
436400*CNC0520-BEG
436500******************************************************************
436600 P1125-ADD-QUALIFICATIONS.
436700******************************************************************
436800     MOVE WS-SAVE-KEY            TO AHM-AHIST-KEY
436900     SET AHM-EMPLOYEE-RECORD     TO TRUE
437000     MOVE SPACES                 TO AHM-EMPLOYEE-KEY
437100     MOVE AHM-KEY                TO AHMKEY
437200     MOVE AH-MISC-FILE(AH-SUB)   TO AHM-DATASET
437300     EXEC CICS STARTBR
437400               DATASET(AHM-DATASET)
437500               RIDFLD(AHMKEY)
437600               GTEQ
437700               RESP(WS-RESPONSE)
437800     END-EXEC
437900     MOVE WS-RESPONSE TO FILE-STATUS
438000     IF SUCCESS
438100        MOVE ZEROES TO J
438200        MOVE SPACES TO WS-EMP-NO-ARRAY-AREA
438300        MOVE '0' TO AHM-DONE-CODE
438400                    CALL-P931-FLAG
438500        PERFORM UNTIL AHM-DONE
438600           EXEC CICS READNEXT
438700                     DATASET(AHM-DATASET)
438800                     INTO(WS-AHIST-MISC)
438900                     LENGTH(AHM-RLGTH)
439000                     RIDFLD(AHMKEY)
439100                     KEYLENGTH(AHM-KLGTH)
439200                     RESP(WS-RESPONSE)
439300           END-EXEC
439400           MOVE WS-RESPONSE TO FILE-STATUS
439500           IF SUCCESS
439600              IF AHM-AHIST-KEY = WS-SAVE-KEY AND
439700                 AHM-EMPLOYEE-RECORD
439800                 ADD 1                         TO J
439900                 MOVE AHM-EMPLOYEE-NUMBER      TO WS-EMP-NO(J)
440000                 MOVE AHM-CRAFT-CODE           TO WS-CRAFT-CODE(J)
440100                 MOVE AHM-EMP-TIE-UP-SET-FLAG  TO
440200                                            WS-EMP-TIED-UP-FLAG(J)
440300                 MOVE AHM-EMP-OD-DATE-TIME     TO
440400                                               WS-EMP-OD-DTTM(J)
440500*C1049-BEG
440600                 MOVE AHM-OD-FUNCTION        TO WS-OD-FUNCTION(J)
440700*C1049-END
440800                 IF WS-EMP-TIED-UP(J) AND
440900                    P920-ASGN-ON-DUTY-EMP NOT = WS-EMP-NO(J)
441000                    SET AHM-DONE               TO TRUE
441100                    SET DO-NOT-CALL-P931       TO TRUE
441200                 END-IF
441300              ELSE
441400                 SET AHM-DONE TO TRUE
441500              END-IF
441600           ELSE
441700              SET AHM-DONE TO TRUE
441800              IF NOT (NO-RECORD-FND OR END-OF-FILE)
441900                 MOVE 'P1125-1' TO ERR-PARAGRAPH
442000                 MOVE AHMKEY    TO ERR-KEY
442100                 PERFORM P9999-GOT-PROBLEM
442200              END-IF
442300           END-IF
442400        END-PERFORM
442500        EXEC CICS ENDBR
442600                  DATASET(AHM-DATASET)
442700                  RESP(WS-RESPONSE)
442800        END-EXEC
442900     ELSE
443000        IF NOT (NO-RECORD-FND OR END-OF-FILE)
443100           MOVE 'P1125-2' TO ERR-PARAGRAPH
443200           MOVE AHMKEY    TO ERR-KEY
443300           PERFORM P9999-GOT-PROBLEM
443400        END-IF
443500     END-IF
443600     IF CALL-P931
443700        PERFORM VARYING K FROM 1 BY 1 UNTIL K > ARRAY-MAX
443800           IF WS-EMP-NO(K) > SPACES
443900*C1049-BEG
444000              IF NOT WS-EMP-WAS-ANNULLED(K)
444100*C1049-END
444200                 MOVE SPACES             TO P931-COMMAREA-PARMS
444300                 SET P931-QUAL-ADD-FUN   TO TRUE
444400                 MOVE WS-EMP-NO(K)       TO P931-QUAL-ADD-EMP-NO
444500                 MOVE WS-CRAFT-CODE(K)   TO WS-CRAFT-CODE-CHECK
444600                 PERFORM PXXXX-GET-MASTER-CRAFT
444700                 IF WS-CRAFT-CODE-CHECK > SPACES
444800                   MOVE WS-CRAFT-CODE-CHECK TO P931-QUAL-ADD-CRAFT
444900                 ELSE
445000                    MOVE WS-CRAFT-CODE(K) TO P931-QUAL-ADD-CRAFT
445100                 END-IF
445200                 MOVE P920-ORG-STATION   TO P931-QUAL-ADD-FROM-LOC
445300                 MOVE P920-FINAL-STATION TO P931-QUAL-ADD-TO-LOC
445400                 MOVE WS-SAVE-ROUTE-DSGN TO P931-QUAL-ADD-ROUTE
445500                 MOVE WS-EMP-OD-DTTM(K) TO P931-QUAL-ADD-CALL-DTTM
445600                 MOVE P920-EMP-OFFD-DATE-TIME TO
445700                                          P931-QUAL-ADD-TIEUP-DTTM
445800                 PERFORM P9100-LINK-TO-931
445900*C1049-BEG
446000              END-IF
446100*C1049-END
446200           ELSE
446300              MOVE ARRAY-MAX             TO K
446400           END-IF
446500        END-PERFORM
446600     END-IF
446700     .
446800*CNC0520-END
446900*
447000******************************************************************
447100 P1129-ADD-TRIP-TO-LOG.
447200******************************************************************
447300     MOVE SPACES                     TO P931-COMMAREA-PARMS
447400     SET P931-TRIP-ADD-FUN           TO TRUE
447500     MOVE P920-ASGN-ON-DUTY-EMP      TO P931-TRIP-ADD-EMP-NO
447600     MOVE WS-QUAL (QUAL-SUB)         TO P931-TRIP-ADD-QUAL-CODE
447700     MOVE WS-QUAL-ON-DUTY-DATE       TO P931-TRIP-ADD-QUAL-DATE
447800     MOVE WS-QUAL-ON-DUTY-TIME       TO P931-TRIP-ADD-QUAL-TIME
447900     MOVE WS-AHMKEY                  TO P931-TRIP-ADD-XREF-KEY
448000     SET P931-TRIP-ADD-XREF-AHM      TO TRUE
448100     PERFORM P9100-LINK-TO-931
448200     .
448300*
448400******************************************************************
448500 P1130-WRITE-LAYOFF-HISTORY.
448600******************************************************************
448700     MOVE P943-EFF-DATE-TIME         TO WS-HOLD-EFF-DATE-TIME
448800     MOVE SPACES                     TO P943-COMMAREA-PARMS
448900     SET P943-LAYOFF-FUN             TO TRUE
449000     MOVE EMP-NBR  OF WS-MSTR        TO P943-EMP-NBR
449100     MOVE DIST     OF WS-MSTR        TO P943-DIST
449200     MOVE SUB-DIST OF WS-MSTR        TO P943-SDIST
449300     MOVE CRAFT    OF WS-MSTR        TO P943-CRAFT
449400     MOVE LAYOFF-CODE                TO P943-LO
449500     MOVE LAYOFF-EM-CODE             TO P943-LAYOFF-EM-CODE
449600                                        P943-ECC-CODE
449700     MOVE WS-HOLD-EFF-DATE-TIME      TO P943-EFF-DATE-TIME
449800     IF NORMAL-ASGNMT > SPACES
449900        MOVE NORMAL-ASGNMT           TO P943-NORM-ASGN
450000     END-IF
450100     IF TEMPORARY-ASGNMT > SPACES
450200        MOVE TEMPORARY-ASGNMT        TO P943-TEMP-ASGNX
450300     END-IF
450400     MOVE 'TIE-UP '                  TO P943-SUPV-AUTH
450500     PERFORM P8900-WRITE-HISTORY.
450600******************************************************************
450700 P1140-UPDATE-CARRIED-TURNS.
450800******************************************************************
450900     MOVE SPACES                     TO P936-COMMAREA-PARMS
451000     IF P920-TIE-UP-FUNCTION
451100        SET P936-TIE-UP-FUNCTION     TO TRUE
451200     ELSE
451300        SET P936-CANCEL-FUNCTION     TO TRUE
451400     END-IF
451500     MOVE '2'                        TO P936-CARRTURNBY-TYPE
451600     MOVE P920-ASGN-ON-DUTY-EMP      TO P936-CARRTURNBY-EMP
451700*C1176.2 - BEG
451800                                        P936-ON-DUTY-EMP
451900*C1176.2 - END
452000     IF P936-TIE-UP-FUNCTION
452100        MOVE '0'                     TO P936-TIEING-UP-BOARD
452200        MOVE LAST-TIE-UP-TIME        TO P936-TIEING-UP-TIME
452300     END-IF
452400*C1176.2 - BEG
452500***  MOVE P920-TIME-ZONE             TO P936-TIME-ZONE
452600     MOVE WS-EMP-TIME-ZONE           TO P936-TIME-ZONE
452700     IF P920-EMP-PERS-REST-CLMD > '0000'
452800        MOVE SPACES                  TO WS-ADD-REST
452900        PERFORM P1160-CHECK-ASGN-AT-CALL
453000        IF WS-ADD-REST-YES
453100*    READ THE CONTROL RECORD FOR THE POOL WE ARE TIEING UP 'TO'
453200           MOVE SPACES               TO WORK-CNTLKEY
453300                                        BOOK-REST-THRESHOLD
453400           MOVE '03'                 TO WK-CNTL-REC-TYPE
453500           MOVE 'F'                  TO WK-CNTL-POOL-TYPE
453600           IF TEMPORARY-ASGNMT > SPACES
453700              MOVE TA-DIST           TO WK-CNTL-DIST
453800              MOVE TA-SUB-DIST       TO WK-CNTL-SUB-DIST
453900              MOVE TA-POOL           TO WK-CNTL-POOL
454000           ELSE
454100              MOVE NA-DIST           TO WK-CNTL-DIST
454200              MOVE NA-SUB-DIST       TO WK-CNTL-SUB-DIST
454300              MOVE NA-POOL           TO WK-CNTL-POOL
454400           END-IF
454500           PERFORM P8640-READ-CNTLFILE
454600           IF SUCCESS
454700              MOVE CNTL-POOL-EXTRA-REST TO BOOK-REST-THRESHOLD
454800              IF P920-EMP-PERS-REST-CLMD > BOOK-REST-THRESHOLD
454900                 MOVE ZEROS               TO DATE-CONVERSION-PARMS
455000                 SET PARM-ADD             TO TRUE
455100                 MOVE TUT-DATE            TO PARM-PRI-DATE-GREG
455200                 MOVE TUT-TIME-OF-DAY     TO PARM-PRI-HRMN
455300                 MOVE P920-EMP-PERS-REST-CLMD TO PARM-SEC-HR-MN
455400                 EXEC CICS LINK
455500                           PROGRAM(P903-PGM)
455600                           COMMAREA(DATE-CONVERSION-PARMS)
455700                           LENGTH(P903-LGTH)
455800                           RESP(WS-RESPONSE)
455900                 END-EXEC
456000                 MOVE WS-RESPONSE         TO FILE-STATUS
456100                 IF NOT SUCCESS
456200                    MOVE 'P1140-1'        TO ERR-PARAGRAPH
456300                    MOVE 'P903LINK'       TO ERR-KEY
456400                    PERFORM P9999-GOT-PROBLEM
456500                 END-IF
456600                 MOVE PARM-RES-DATE-GREG  TO TURN-TIEING-UP-DATE
456700                 MOVE PARM-RES-HRMN       TO TURN-TIEING-UP-HRMN
456800                 MOVE TURN-TIEING-UP-TIME
456900                                       TO P936-EXCESS-REST-TU-TIME
457000              END-IF
457100           ELSE
457200              MOVE 'P1140-2'         TO ERR-PARAGRAPH
457300              MOVE CNTLKEY           TO ERR-KEY
457400              PERFORM P9999-GOT-PROBLEM
457500           END-IF
457600        END-IF
457700     END-IF
457800*C1176.2 - END
457900     EXEC CICS LINK
458000               PROGRAM(P936-PGM)
458100               COMMAREA(P936-COMMAREA-PARMS)
458200               LENGTH(P936-LGTH)
458300               RESP(WS-RESPONSE)
458400     END-EXEC
458500     MOVE WS-RESPONSE                TO FILE-STATUS
458600     IF NOT SUCCESS
458700        MOVE 'P1140-3'               TO ERR-PARAGRAPH
458800        PERFORM P9999-GOT-PROBLEM
458900     END-IF.
199800
199800*CNLD-302 B COMMENTING
199800*
459000******************************************************************
459100* P1150-CHECK-FOR-IMPOSED-REST.
459200******************************************************************
459300*** 331E - IF EMP-MTOD MATCHES EMPTOD RECORD, DELETE IT
459400***        THEN WRITE A HISTORY THAT THE RECORD WAS DELETED
459500***        (ADDITIONAL CHANGE - DELETE IF RECORD FOUND WITH SAME
459600***         DATE - ASSUMPTION IS THAT WE'RE MODIFYING THE EXISTING
459700***         MTOD AND ONLY NEED TO MATCH ON DATE/TIME)
459800*     MOVE SPACES               TO WS-EMP-TOD
459900**
460000*     IF EMP-MTOD                > ZERO
460100*        MOVE P925-EMP-NO        TO EMPTOD-EMP-NBR
460200*        MOVE EMP-MTOD-DATE      TO DE-YYMMDD
460300**
460400*        SET DE-REFORMAT-ONLY    TO TRUE
460500*        SET DE-YYMMDD-FORMAT    TO TRUE
460600**
460700*        PERFORM P8998-DATEEDIT
460800*        MOVE DE-CCYYMMDD        TO EMPTOD-OD-DATE-CENT
460900*        MOVE EMP-MTOD-TIME      TO EMPTOD-OD-TIME
461000*        MOVE EMPTOD-KEY-AREA    TO EMPTOD-EMPKEY
461100*        PERFORM P8070-READ-EMPTOD
461200*        IF SUCCESS
461300***         AND EMPTOD-TRAIN-ASGN = P920-ASGN-ASGN
461400*           PERFORM P8080-DELETE-EMPTOD
461500*        END-IF
461600*     END-IF
461700*     PERFORM P1155-WRITE-MTOD-CHANGE-HIST.
461800******************************************************************
461900* P1155-WRITE-MTOD-CHANGE-HIST.
462000******************************************************************
462100*     MOVE SPACES                    TO P943-COMMAREA-PARMS
462200*     SET P943-MASTER-RC-FUN         TO TRUE
462300*     MOVE EMP-NBR OF WS-MSTR        TO P943-EMP-NBR
462400*     MOVE P925-MTOD-DATE-TIME      TO P943-MSTR-RC-ADD-REST-DTTM
462500*     MOVE 'MTOD      '              TO P943-MSTR-RC-FIELD
462600*     MOVE P920-TIME-ZONE            TO P943-EMP-TIME-ZONE
462700*     MOVE WS-SYSTEM-DATE-TIME(1:14) TO P943-CLOCK-TIME
462800*     MOVE DIST OF WS-MSTR           TO P943-DIST
462900*     MOVE SUB-DIST OF WS-MSTR       TO P943-SDIST
463000*     MOVE CRAFT OF WS-MSTR          TO P943-CRAFT
463100*     MOVE LAYOFF-CODE               TO P943-LO
463200*     MOVE P920-ASGN-PARM            TO P943-TEMP-ASGNX
463300*     MOVE 'ADJ TU'                  TO P943-MSTR-RC-FUNC
463400**
463500*     MOVE P920-EMP-OFFD-DATE-TIME   TO P943-EFF-DATE-TIME
463600**
463700*     PERFORM P8900-WRITE-HISTORY.
199800*
199800*CNLD-302 E
199800
463800*CNC0600-CNLD-208-B
463900*****************************************************************
464000 P1156-WRITE-MTOD-UPD-HIST.
464010******************************************************************
464020     MOVE SPACES                    TO P943-COMMAREA-PARMS
464030     SET P943-MISC-COMMENTS-FUN     TO TRUE
464040     MOVE DIST OF WS-MSTR           TO P943-DIST
464050     MOVE SUB-DIST OF WS-MSTR       TO P943-SDIST
464060     MOVE EMP-NBR OF WS-MSTR        TO P943-EMP-NBR
464070     MOVE LAYOFF-CODE OF WS-MSTR    TO P943-LO
449700     MOVE P920-EMP-OFFD-DATE-TIME   TO P943-EFF-DATE-TIME
464080     MOVE P920-TIME-ZONE            TO P943-EMP-TIME-ZONE
464100     STRING P925-MTOD(1:2) X'7D' P925-MTOD(3:2)
464100            X'7F' ' TOUR OF DUTY,'
464200            ' MTOD = ' P925-MTOD-DATE '-' P925-MTOD-TIME
464301        DELIMITED BY SIZE           INTO P943-FUN58-COMMENTS
464302     PERFORM P8900-WRITE-HISTORY

      *  CHECK TO DETERMINE IF EMPLOYEE'S ADDITIONAL REST DUE TO A
      *  TOUR > 16 HOURS HAS BEEN CUT SHORT BY 0800 RULE OR COINCIDENCE

           IF P925-MTOD-TIME EQUAL '0800'
              MOVE ZEROS               TO DATE-CONVERSION-PARMS
              SET PARM-ADD             TO TRUE
              MOVE P920-EMP-OFFD-DATE  TO PARM-PRI-DATE-GREG
              MOVE P920-EMP-OFFD-TIME  TO PARM-PRI-HRMN
              MOVE P925-MTOD-AMT       TO PARM-SEC-HR-MN
              EXEC CICS LINK
                        PROGRAM(P903-PGM)
                        COMMAREA(DATE-CONVERSION-PARMS)
                        LENGTH(P903-LGTH)
                        RESP(WS-RESPONSE)
              END-EXEC
              MOVE WS-RESPONSE         TO FILE-STATUS
              IF NOT SUCCESS
                 MOVE 'P1156-1'        TO ERR-PARAGRAPH
                 MOVE 'P903LINK'       TO ERR-KEY
                 PERFORM P9999-GOT-PROBLEM
              END-IF
              IF PARM-RES-HRMN NOT = '0800'
                 MOVE SPACES                  TO P943-COMMAREA-PARMS
                 SET P943-MISC-COMMENTS-FUN   TO TRUE
                 MOVE DIST        OF WS-MSTR  TO P943-DIST
                 MOVE SUB-DIST    OF WS-MSTR  TO P943-SDIST
                 MOVE EMP-NBR     OF WS-MSTR  TO P943-EMP-NBR
                 MOVE P920-EMP-OFFD-DATE-TIME TO P943-EFF-DATE-TIME
                 MOVE P920-TIME-ZONE          TO P943-EMP-TIME-ZONE
                 STRING 'REST EXTENSION SHORTENED TO '
                        '08:00'
                    DELIMITED BY SIZE         INTO P943-FUN58-COMMENTS
                 PERFORM P8900-WRITE-HISTORY
              END-IF
           END-IF
           .
464303*CNLD-208-E
464304*C1176.2 - BEG
464305*
464306 P1160-CHECK-ASGN-AT-CALL.
464400*
464500     INITIALIZE WS-AAL-STORAGE
464600     MOVE SPACES                            TO PREV-ASGN
464700     MOVE P920-ASGN-ON-DUTY-EMP             TO AAL-EMP-NBR
464800     PERFORM PSQL-AALSEL02
464900     IF SQL-SUCCESS
465000        MOVE AAL-ASGN-TYP-CD                TO PREV-ASGNMT-FLAG
465100        MOVE AAL-DIST                       TO PREV-DIST
465200        MOVE AAL-SUB-DIST                   TO PREV-SUB-DIST
465300        MOVE AAL-ASGN-ID                    TO PREV-AREA
465400        MOVE AAL-ASGN-CRFT-CD               TO PREV-CC
465500     END-IF
465600     IF PREV-ASGN > SPACES
465700***  IF EN FROM LOCAL/YARD ALLOW EXCESS REST...
465800        MOVE PREV-CC                        TO WS-CRAFT-CODE-CHECK
465900        IF ENGINE-CRAFT
466000           SET WS-ADD-REST-YES TO TRUE
466100        END-IF
466200     END-IF
466300     .
466400*C1176.2 - END
466500
466600*C983-BEG
466700******************************************************************
466800 P1200-DEADHEAD-FUNCTION.
466900******************************************************************
467000     MOVE SPACES                    TO WS-ASGN-FILE
467100                                       P938-COMMAREA-PARMS
467200     IF P920-DEADHEAD-HOME
467300        IF OD-AREA > SPACE
467400           MOVE ON-DUTY-ASGNMT-FLAG TO ASGN-JOB-TYPE
467500                                       P938-ASGN-TYPE
467600           MOVE ON-DUTY-ASGNMT      TO ASGN-ASSIGNMENT
467700                                       P938-ASGN-PARM
467800           SET ASGN-ON-DUTY-REC     TO TRUE
467900           MOVE ZEROES              TO ASGN-DATE-TIME
468000           MOVE ASGNKEY1            TO ASGNJOB
468100           IF SUCCESS
468200              EXEC CICS DELETE
468300                        DATASET(ASGN-VIA-ASGNJOB)
468400                        RIDFLD(ASGNJOB)
468500                        RESP(WS-RESPONSE)
468600              END-EXEC
468700              MOVE WS-RESPONSE TO FILE-STATUS
468800              IF NOT SUCCESS
468900                 MOVE 'P1200-1' TO ERR-PARAGRAPH
469000                 MOVE ASGNJOB   TO ERR-KEY
469100                 PERFORM P9999-GOT-PROBLEM
469200              END-IF
469300           ELSE
469400              MOVE 'P1200-2' TO ERR-PARAGRAPH
469500              MOVE ASGNJOB   TO ERR-KEY
469600              PERFORM P9999-GOT-PROBLEM
469700           END-IF
469800        END-IF
469900        MOVE SPACES TO SAVE-TEMPORARY-ASGNMT-FLAG
470000                       SAVE-TEMPORARY-ASGNMT
470100        IF TA-AREA > SPACES
470200           SET NOT-RELEASED-FROM-TV     TO TRUE
470300           IF TEMP-ASGN-F-NOT
470400              AND (TA-AREA = OD-AREA
470500              OR   OD-AREA NOT > SPACES)
470600              MOVE TEMPORARY-ASGNMT-FLAG TO
470700                                        SAVE-TEMPORARY-ASGNMT-FLAG
470800              MOVE TEMPORARY-ASGNMT     TO SAVE-TEMPORARY-ASGNMT
470900                                           ON-DUTY-ASGNMT
471000              MOVE SPACES               TO WS-ASGN-FILE
471100              MOVE SAVE-TEMP-ASGN-KEY   TO ASGNJOB
471200              EXEC CICS DELETE
471300                        DATASET(ASGN-VIA-ASGNJOB)
471400                        RIDFLD(ASGNJOB)
471500                        RESP(WS-RESPONSE)
471600              END-EXEC
471700              MOVE WS-RESPONSE          TO FILE-STATUS
471800              IF NOT SUCCESS
471900                 MOVE 'P1200-3'         TO ERR-PARAGRAPH
472000                 MOVE ASGNJOB           TO ERR-KEY
472100                 PERFORM P9999-GOT-PROBLEM
472200              END-IF
472300              SET RELEASED-FROM-TV      TO TRUE
472400           END-IF
472500           IF TEMP-ASGN-XB-AUG
472600              MOVE SPACES               TO P913-COMMAREA-PARMS
472700              SET P913-DEL-TURN-ONLY-FUNCTION TO TRUE
472800              MOVE TA-DIST              TO P913-TURN-DIST
472900              MOVE TA-SUB-DIST          TO P913-TURN-SUB-DIST
473000              MOVE TA-CC                TO P913-TURN-CC
473100              MOVE TA-XB-TURN           TO P913-TURN
473200              MOVE P920-TIME-ZONE       TO P913-TIME-ZONE
473300              MOVE P920-DHD-DATE-TIME   TO P913-EFF-DATE-TIME
473400              EXEC CICS LINK
473500                        PROGRAM(P913-PGM)
473600                        COMMAREA(P913-COMMAREA-PARMS)
473700                        LENGTH(P913-LGTH)
473800                        RESP(WS-RESPONSE)
473900              END-EXEC
474000              MOVE WS-RESPONSE TO FILE-STATUS
474100              IF NOT SUCCESS
474200                 MOVE 'P1200-4' TO ERR-PARAGRAPH
474300                 PERFORM P9999-GOT-PROBLEM
474400              END-IF
474500           END-IF
474600           IF RELEASED-FROM-TV
474700              MOVE SPACES               TO P943-COMMAREA-PARMS
474800              SET P943-REL-FROM-ASSIGN-FUN TO TRUE
474900              MOVE P920-DHD-EMP-NO      TO P943-EMP-NBR
475000*
475100              MOVE SPACES               TO TZ-PARAMETERS
475200              MOVE P920-TIME-ZONE       TO TZ-IN-ZONE
475300              MOVE P920-DHD-DATE-TIME   TO TZ-IN-DATE-TIME
475400              MOVE WS-EMP-TIME-ZONE     TO TZ-OUT-ZONE
475500              PERFORM P8996-TIMEZONE
475600              IF TZ-INVALID-PARAMETERS
475700                 MOVE '1200TZ'          TO ERR-PARAGRAPH
475800                 PERFORM P8996-TZERROR
475900              END-IF
476000              MOVE TZ-OUT-DATE-TIME     TO P943-EFF-DATE-TIME
476100*
476200              MOVE CRAFT OF WS-MSTR     TO P943-CRAFT
476300              MOVE LAYOFF-CODE          TO P943-LO
476400              MOVE P920-ASGN-MERG-CLASS TO P943-ASGN-MERG-CLASS
476500              MOVE OD-DIST              TO P943-DIST
476600              MOVE OD-SUB-DIST          TO P943-SDIST
476700              IF ON-DUTY-UFP
476800                 MOVE OD-POOL           TO P943-POOL-ASG
476900                 MOVE IN-OUT-TERMINAL   TO P943-IN-OUT
477000              END-IF
477100              MOVE ON-DUTY-ASGNMT       TO P943-TAT
477200              PERFORM P8510-READ-MASTER-JOBS
477300              IF TEMPORARY-ASGNMT > SPACES
477400                 MOVE TEMPORARY-ASGNMT  TO P943-NORM-ASGN
477500              ELSE
477600                 MOVE NORMAL-ASGNMT     TO P943-NORM-ASGN
477700              END-IF
477800              PERFORM P8900-WRITE-HISTORY
477900           END-IF
478000        END-IF
478100     ELSE
478200        MOVE SPACES                  TO WS-ASGN-FILE
478300        IF P920-ASGN-UFP
478400           MOVE 'U'                  TO ASGN-JOB-TYPE
478500        ELSE
478600           MOVE 'A'                  TO ASGN-JOB-TYPE
478700        END-IF
478800        MOVE P920-ASGN-DIST          TO ASGN-DIST
478900        MOVE P920-ASGN-SUB-DIST      TO ASGN-SUB-DIST
479000        MOVE P920-ASGN-ASSIGN
479100                               TO  ASGN-AJ-JOB OF ASGN-ASSIGNMENT
479200        MOVE ASGN-JOB-TYPE           TO P938-ASGN-TYPE
479300        MOVE ASGN-ASSIGNMENT         TO P938-ASGN-PARM
479400        MOVE P920-ASGN-MERG-CLASS    TO P938-ASGN-MERG-CLASS
479500        MOVE EMP-NBR OF WS-MSTR TO ASGN-EMP-NO
479600        IF P920-DHD-FURTH-NOT-FLAG = 'Y'
479700           SET ASGN-TEMP-REC          TO TRUE
479800           SET ASGN-EMP-TEMP-REC      TO TRUE
479900           SET ASGN-DH-F-NOTICE       TO TRUE
480000           MOVE SPACES                TO TZ-PARAMETERS
480100           MOVE P920-TIME-ZONE        TO TZ-IN-ZONE
480200           MOVE P920-DHD-DATE-TIME    TO TZ-IN-DATE-TIME
480300           MOVE WS-EMP-TIME-ZONE      TO TZ-OUT-ZONE
480400           PERFORM P8996-TIMEZONE
480500           IF TZ-INVALID-PARAMETERS
480600              MOVE 'A1200TZ'        TO ERR-PARAGRAPH
480700              PERFORM P8996-TZERROR
480800           END-IF
480900           MOVE TZ-OUT-DATE-TIME      TO ASGN-EMP-DATE-TIME
481000                                         ASGN-DATE-TIME
481100                                         ASGN-ASSIGNMENT-DATE-TIME
481200           MOVE 'N'                TO WS-ASGN-DONE-CODE
481300           MOVE ZEROES             TO WS-ASGN-COUNT
481400           PERFORM UNTIL ASGN-DONE
481500              MOVE ASGNKEY1        TO ASGNJOB
481600              EXEC CICS WRITE
481700                        DATASET(ASGN-VIA-ASGNJOB)
481800                        FROM(WS-ASGN-FILE)
481900                        LENGTH(ASGNJOB-RLGTH)
482000                        RIDFLD(ASGNJOB)
482100                        RESP(WS-RESPONSE)
482200              END-EXEC
482300              MOVE WS-RESPONSE TO FILE-STATUS
482400              IF SUCCESS
482500                 SET ASGN-DONE TO TRUE
482600                 MOVE ASGN-DATE TO TEMP-ASGN-DATE
482700              ELSE
482800                 IF DUP-KEY-ERR
482900                    MOVE ZEROES TO DATE-CONVERSION-PARMS
483000                    SET PARM-ADD TO TRUE
483100                    MOVE ASGN-DATE TO PARM-PRI-DATE-GREG
483200                    MOVE ASGN-TIME TO PARM-PRI-HRMN
483300                    MOVE 0001 TO PARM-SEC-HRMN
483400                    EXEC CICS LINK
483500                              PROGRAM(P903-PGM)
483600                              COMMAREA(DATE-CONVERSION-PARMS)
483700                              LENGTH(P903-LGTH)
483800                              RESP(WS-RESPONSE)
483900                    END-EXEC
484000                    MOVE WS-RESPONSE TO FILE-STATUS
484100                    IF NOT SUCCESS
484200                       MOVE 'P1200-5' TO ERR-PARAGRAPH
484300                       PERFORM P9999-GOT-PROBLEM
484400                    END-IF
484500                    MOVE PARM-RES-DATE-GREG TO ASGN-DATE
484600                    MOVE PARM-RES-HRMN      TO ASGN-TIME
484700                    MOVE ASGN-DATE-TIME  TO ASGN-EMP-DATE-TIME
484800                    ADD 1 TO WS-ASGN-COUNT
484900                    IF WS-ASGN-COUNT > 5
485000                       SET ASGN-DONE TO TRUE
485100                       MOVE 'P1200-6' TO ERR-PARAGRAPH
485200                       MOVE ASGNJOB TO ERR-KEY
485300                       PERFORM P9999-GOT-PROBLEM
485400                    END-IF
485500                 ELSE
485600                    SET ASGN-DONE TO TRUE
485700                    MOVE 'P1200-7' TO ERR-PARAGRAPH
485800                    MOVE ASGNJOB TO ERR-KEY
485900                    PERFORM P9999-GOT-PROBLEM
486000                 END-IF
486100              END-IF
486200           END-PERFORM
486300           MOVE 'N'                  TO WS-ASGN-DONE-CODE
486400           MOVE SPACES               TO P943-COMMAREA-PARMS
486500           MOVE EMP-NBR OF WS-MSTR   TO P943-EMP-NBR
486600           SET P943-ASSIGNED-FURTHER-NOT-FUN TO TRUE
486700           MOVE ASGN-DIST            TO P943-DIST
486800           MOVE ASGN-SUB-DIST        TO P943-SDIST
486900           IF ASGN-UFP-JOB
487000              MOVE ASGN-UFP-POOL     TO P943-POOL-ASG
487100           END-IF
487200           MOVE IN-OUT-TERMINAL      TO P943-IN-OUT
487300           MOVE TZ-OUT-DATE-TIME     TO P943-EFF-DATE-TIME
487400           IF TEMPORARY-ASGNMT > SPACES
487500              MOVE TEMPORARY-ASGNMT  TO P943-NORM-ASGN
487600           ELSE
487700              MOVE NORMAL-ASGNMT     TO P943-NORM-ASGN
487800           END-IF
487900           MOVE LAYOFF-CODE          TO P943-LO
488000           IF P920-HAVE-TEMP-EMP
488100              MOVE P920-ASGN-TEMP-EMP TO P943-EMP-NBR-AFFECTED
488200           ELSE
488300              IF P920-HAVE-OWNER
488400                 MOVE P920-ASGN-OWNER  TO P943-EMP-NBR-AFFECTED
488500              ELSE
488600                 MOVE '999999998'      TO P943-EMP-NBR-AFFECTED
488700              END-IF
488800           END-IF
488900           SET P943-NOT-REG-EMP         TO TRUE
489000           MOVE ASGN-ASSIGNMENT         TO P943-TAT
489100           PERFORM P8900-WRITE-HISTORY
489200           IF TEMP-ASGN-XB
489300              OR (NORM-ASGN-XB AND TEMPORARY-ASGNMT NOT > SPACE)
489400              MOVE SPACES TO P913-COMMAREA-PARMS
489500              SET P913-DEADHEAD-FUNCTION TO TRUE
489600              IF TEMP-ASGN-XB
489700                 MOVE TA-DIST           TO P913-TURN-DIST
489800                 MOVE TA-SUB-DIST       TO P913-TURN-SUB-DIST
489900                 MOVE TA-CC             TO P913-TURN-CC
490000                 MOVE TA-XB-TURN        TO P913-TURN
490100              ELSE
490200                 MOVE NA-DIST           TO P913-TURN-DIST
490300                 MOVE NA-SUB-DIST       TO P913-TURN-SUB-DIST
490400                 MOVE NA-CC             TO P913-TURN-CC
490500                 MOVE NA-XB-TURN        TO P913-TURN
490600              END-IF
490700              MOVE P920-TIME-ZONE       TO P913-TIME-ZONE
490800              MOVE P920-DHD-DATE-TIME   TO P913-EFF-DATE-TIME
490900*-------------------------------------------------------------
491000*         FOR FASTSLOW BOARDS, THE FLAG SET IN DECISION
491100*         PROCESSING IS USED TO DETERMINE ROAD VS, YARD.
491200*----------------------------------------------------------PLS
491300              IF P920-FROM-FAST-BOARD
491400                 SET P913-YARD-CALL        TO TRUE
491500              ELSE
491600                 IF P920-FROM-SLOW-BOARD
491700                    SET P913-ROAD-CALL     TO TRUE
491800                 ELSE
491900                    IF P920-ASGN-UFP
492000                      OR (P920-ASGN-AJ AND JOB-DEF-LOCAL-ASGN)
492100                       SET P913-ROAD-CALL        TO TRUE
492200                    ELSE
492300                       SET P913-YARD-CALL        TO TRUE
492400                    END-IF
492500                 END-IF
492600              END-IF
492700              EXEC CICS LINK
492800                        PROGRAM(P913-PGM)
492900                        COMMAREA(P913-COMMAREA-PARMS)
493000                        LENGTH(P913-LGTH)
493100                        RESP(WS-RESPONSE)
493200              END-EXEC
493300              MOVE WS-RESPONSE TO FILE-STATUS
493400              IF NOT SUCCESS
493500                 MOVE 'P1200-8' TO ERR-PARAGRAPH
493600                 PERFORM P9999-GOT-PROBLEM
493700              END-IF
493800           END-IF
493900        END-IF
494000        IF (P920-DHD-FURTH-NOT-FLAG = 'Y'
494100           AND P920-ASGN-UFP
494200           AND OUT-OF-TOWN OF WS-UFP)
494300           OR (P920-DHD-FURTH-NOT-FLAG = 'Y'
494400              AND P920-ASGN-UFP
494500              AND (DIST OF WS-UFP NOT = DIST2
494600                  OR SUB-DIST OF WS-UFP NOT = SUB-DIST2
494700                  OR POOL-NAME OF WS-UFP NOT = POOL-NAME2))
494800           OR P920-DHD-FURTH-NOT-FLAG NOT = 'Y'
494900           SET ASGN-ON-DUTY-REC     TO TRUE
495000           SET ASGN-EMP-ON-DUTY-REC TO TRUE
495100           MOVE SPACES              TO ASGN-DH-F-NOTICE-FLAG
495200           MOVE ZEROS               TO ASGN-DATE-TIME
495300                                       ASGN-EMP-DATE-TIME
495400                                       ASGN-ON-DUTY-DATE-TIME
495500*A494 - BEG
495600           IF  P920-DHD-FURTH-NOT-FLAG NOT = 'Y'
495700           AND P920-ASGN-UFP
495800              MOVE DIST OF WS-UFP   TO ASGN-HOME-BOARD-DIST
495900              MOVE SUB-DIST OF WS-UFP
496000                                    TO ASGN-HOME-BOARD-SDIST
496100              MOVE POOL-NAME OF WS-UFP
496200                                    TO ASGN-HOME-BOARD-POOL
496300              MOVE IN-OUT-TERMINAL  TO ASGN-HOME-BOARD-TERM
496400*
496500              MOVE SPACES           TO WORK-CNTLKEY
496600              MOVE '03'             TO WK-CNTL-REC-TYPE
496700              MOVE P920-ASGN-DIST   TO WK-CNTL-DIST
496800              MOVE P920-ASGN-SUB-DIST
496900                                    TO WK-CNTL-SUB-DIST
497000              MOVE P920-ASGN-POOL   TO WK-CNTL-POOL
497100              MOVE 'F'              TO WK-CNTL-POOL-TYPE
497200              PERFORM P8640-READ-CNTLFILE
497300              IF NOT SUCCESS
497400                 MOVE 'P1200-15'    TO ERR-PARAGRAPH
497500                 MOVE CNTLKEY       TO ERR-KEY
497600                 PERFORM P9999-GOT-PROBLEM
497700              END-IF
497800              MOVE CNTL-POOL-ASGN-POOL
497900                                    TO ASGN-ASSIGNED-POOL-FLAG
498000           END-IF
498100*A494 - END
498200           MOVE ASGNKEY1            TO ASGNJOB
498300           EXEC CICS READ
498400                     UPDATE
498500                     DATASET(ASGN-VIA-ASGNJOB)
498600                     INTO(WS-HOLD-ASGN-FILE)
498700                     LENGTH(ASGNJOB-RLGTH)
498800                     RIDFLD(ASGNJOB)
498900                     KEYLENGTH(ASGNJOB-KLGTH)
499000                     RESP(WS-RESPONSE)
499100           END-EXEC
499200           MOVE WS-RESPONSE TO FILE-STATUS
499300           IF SUCCESS
499400              EXEC CICS REWRITE
499500                        DATASET(ASGN-VIA-ASGNJOB)
499600                        FROM(WS-ASGN-FILE)
499700                        LENGTH(ASGNJOB-RLGTH)
499800                        RESP(WS-RESPONSE)
499900              END-EXEC
500000              MOVE WS-RESPONSE TO FILE-STATUS
500100              IF NOT SUCCESS
500200                 MOVE 'P1200-9' TO ERR-PARAGRAPH
500300                 MOVE ASGNJOB   TO ERR-KEY
500400                 PERFORM P9999-GOT-PROBLEM
500500              END-IF
500600           ELSE
500700              IF NO-RECORD-FND
500800                 MOVE ASGNKEY1 TO ASGNJOB
500900                 EXEC CICS WRITE
501000                           DATASET(ASGN-VIA-ASGNJOB)
501100                           FROM(WS-ASGN-FILE)
501200                           LENGTH(ASGNJOB-RLGTH)
501300                           RIDFLD(ASGNJOB)
501400                           RESP(WS-RESPONSE)
501500                 END-EXEC
501600                 MOVE WS-RESPONSE TO FILE-STATUS
501700                 IF NOT SUCCESS
501800                    MOVE 'P1200-10' TO ERR-PARAGRAPH
501900                    MOVE ASGNJOB    TO ERR-KEY
502000                    PERFORM P9999-GOT-PROBLEM
502100                 END-IF
502200              ELSE
502300                 MOVE 'P1200-11' TO ERR-PARAGRAPH
502400                 MOVE ASGNJOB   TO ERR-KEY
502500                 PERFORM P9999-GOT-PROBLEM
502600              END-IF
502700           END-IF
502800        END-IF
502900     END-IF
503000*
503100     PERFORM P1230-BUILD-DEADHEAD-HSL
503200*
503300*CNC0570-BEG
503400     IF ADD-DH-FRA
503500        PERFORM P1400-CREATE-FRA-SHELL
503600     END-IF
503700*CNC0570-END
503800     PERFORM P1210-UPDATE-EMPLOYEE
503900*
504000*    RELEASE ANY EMPLOYEES WHO WERE TEMPORARILY WORKING THE
504100*    ASSIGNMENT OF AN EMPLOYEE WHO DEADHEADED HOME
504200*
504300     IF P920-DEADHEAD-HOME
504400        IF TEMPORARY-ASGNMT > SPACES OR NORMAL-ASGNMT > SPACES
504500           PERFORM P1250-RELEASE-EMPS
504600        END-IF
504700     END-IF
504800*
504900*       GENERATE A PAY CLAIM FOR THIS DEADHEAD
505000*
505100     MOVE SPACES                TO P970-COMMAREA-PARMS
505200     SET P970-SYSTEM-VERSION    TO TRUE
505300     SET P970-DEADHEAD-FUNC     TO TRUE
505400     SET P970-UPDATE            TO TRUE
505500     MOVE P920-DHD-PROFILE-KEY  TO P970-SYDH-ASGN-PRO
505600     MOVE P920-DHD-EMP-NO       TO P970-SYDH-EMP-NO
505700     MOVE P920-DHD-DATE-TIME    TO P970-SYDH-EFF-DATE-TIME
505800     MOVE P920-DHD-MILES-CLMD   TO P970-SYDH-TRAVEL-MILES
505900     MOVE P920-DHD-DURATION     TO P970-SYDH-TRAVEL-TIME
506000     MOVE P920-DHD-MODE-OF-TRANS
506100                                TO P970-SYDH-MODE-OF-TRANS
506200     IF P920-DEADHEAD-HOME
506300        EVALUATE TRUE
506400           WHEN SAVE-TEMPORARY-ASGNMT > SPACES
506500              MOVE SAVE-TEMPORARY-ASGNMT-FLAG
506600                                TO P970-SYDH-ASGN-TYPE
506700              MOVE SAVE-TEMPORARY-ASGNMT
506800                                TO P970-SYDH-ASSIGNMENT
506900           WHEN TEMPORARY-ASGNMT      > SPACE
507000              MOVE TEMPORARY-ASGNMT-FLAG
507100                                TO P970-SYDH-ASGN-TYPE
507200              MOVE TEMPORARY-ASGNMT
507300                                TO P970-SYDH-ASSIGNMENT
507400           WHEN NORMAL-ASGNMT         > SPACE
507500              MOVE NORMAL-ASGNMT-FLAG
507600                                TO P970-SYDH-ASGN-TYPE
507700              MOVE NORMAL-ASGNMT
507800                                TO P970-SYDH-ASSIGNMENT
507900           WHEN OTHER
508000              MOVE P920-ASGN-TYPE
508100                                TO P970-SYDH-ASGN-TYPE
508200              MOVE P920-ASGN-PARM
508300                                TO P970-SYDH-ASSIGNMENT
508400        END-EVALUATE
508500     ELSE
508600        MOVE P920-ASGN-TYPE     TO P970-SYDH-ASGN-TYPE
508700        MOVE P920-ASGN-PARM     TO P970-SYDH-ASSIGNMENT
508800     END-IF
508900     EXEC CICS LINK
509000               PROGRAM(P970-PGM)
509100               COMMAREA(P970-COMMAREA-PARMS)
509200               LENGTH(P970-LGTH)
509300               RESP(WS-RESPONSE)
509400     END-EXEC
509500     MOVE WS-RESPONSE TO FILE-STATUS
509600     IF NOT SUCCESS
509700        MOVE 'P1200-12'         TO ERR-PARAGRAPH
509800        MOVE 'P970LINK'         TO ERR-KEY
509900        PERFORM P9999-GOT-PROBLEM
510000     END-IF
510100     IF P920-DHD-RJHS-EMPNO > SPACES
510200        MOVE SPACES                TO P970-COMMAREA-PARMS
510300        SET P970-SYSTEM-VERSION    TO TRUE
510400        SET P970-RJHS-FUNC         TO TRUE
510500        SET P970-UPDATE            TO TRUE
510600        MOVE P920-DHD-RJHS-EMPNO   TO P970-SYRJHS-EMP-NO
510700        MOVE P920-DHD-DATE-TIME    TO P970-SYRJHS-EFF-DATE-TIME
510800        IF P920-DEADHEAD-HOME
510900           EVALUATE TRUE
511000              WHEN SAVE-TEMPORARY-ASGNMT > SPACES
511100                 MOVE SAVE-TEMPORARY-ASGNMT-FLAG
511200                                   TO P970-SYRJHS-ASGN-TYPE
511300                 MOVE SAVE-TEMPORARY-ASGNMT
511400                                   TO P970-SYRJHS-ASSIGNMENT
511500              WHEN TEMPORARY-ASGNMT      > SPACE
511600                 MOVE TEMPORARY-ASGNMT-FLAG
511700                                   TO P970-SYRJHS-ASGN-TYPE
511800                 MOVE TEMPORARY-ASGNMT
511900                                   TO P970-SYRJHS-ASSIGNMENT
512000              WHEN NORMAL-ASGNMT         > SPACE
512100                 MOVE NORMAL-ASGNMT-FLAG
512200                                   TO P970-SYRJHS-ASGN-TYPE
512300                 MOVE NORMAL-ASGNMT
512400                                   TO P970-SYRJHS-ASSIGNMENT
512500              WHEN OTHER
512600                 MOVE P920-ASGN-TYPE
512700                                   TO P970-SYRJHS-ASGN-TYPE
512800                 MOVE P920-ASGN-PARM
512900                                   TO P970-SYRJHS-ASSIGNMENT
513000           END-EVALUATE
513100        ELSE
513200           MOVE P920-ASGN-TYPE     TO P970-SYRJHS-ASGN-TYPE
513300           MOVE P920-ASGN-PARM     TO P970-SYRJHS-ASSIGNMENT
513400        END-IF
513500        MOVE P920-DHD-PROFILE-KEY  TO TRCNKEY1
513600        EXEC CICS READ
513700                  DATASET(TRAIN-CN-VIA-TRCNKEY1)
513800                  INTO(WS-TRCN-FILE)
513900                  LENGTH(TRAINCN-RLGTH)
514000                  RIDFLD(TRCNKEY1)
514100                  KEYLENGTH(TRAINCN-KLGTH)
514200                  RESP(WS-RESPONSE)
514300        END-EXEC
514400        MOVE WS-RESPONSE           TO FILE-STATUS
514500        IF NOT SUCCESS
514600           MOVE 'P1200-13'         TO ERR-PARAGRAPH
514700           MOVE TRCNKEY1           TO ERR-KEY
514800           PERFORM P9999-GOT-PROBLEM
514900        END-IF
515000        MOVE TRCN-ORIGIN-STN       TO P970-SYRJHS-ORIGIN-STN
515100        MOVE TRCN-JOB-TYPE         TO P970-SYRJHS-JOB-TYPE
515200        MOVE TRCN-RATE-CODE        TO P970-SYRJHS-RATE-CODE
515300        MOVE P970-SYRJHS-ASGN-CC   TO WS-CRAFT-CODE-CHECK
515400        IF ENGINE-CRAFT
515500           MOVE TRCN-EN-BASE-DAY   TO P970-SYRJHS-BASIC-DAY
515600           MOVE TRCN-EN-BASE-TYPE  TO P970-SYRJHS-BASIC-DAY-TYPE
515700           MOVE TRCN-EN-TKPRO      TO P970-SYRJHS-TKPRO
515800        ELSE
515900           MOVE TRCN-TR-BASE-DAY   TO P970-SYRJHS-BASIC-DAY
516000           MOVE TRCN-TR-BASE-TYPE  TO P970-SYRJHS-BASIC-DAY-TYPE
516100           MOVE TRCN-TR-TKPRO      TO P970-SYRJHS-TKPRO
516200        END-IF
516300        EXEC CICS LINK
516400                  PROGRAM(P970-PGM)
516500                  COMMAREA(P970-COMMAREA-PARMS)
516600                  LENGTH(P970-LGTH)
516700                  RESP(WS-RESPONSE)
516800        END-EXEC
516900        MOVE WS-RESPONSE TO FILE-STATUS
517000        IF NOT SUCCESS
517100           MOVE 'P1200-14'         TO ERR-PARAGRAPH
517200           MOVE 'P970LINK'         TO ERR-KEY
517300           PERFORM P9999-GOT-PROBLEM
517400        END-IF
517500     END-IF.
517600*
517700******************************************************************
517800 P1210-UPDATE-EMPLOYEE.
517900******************************************************************
518000     MOVE ZEROS                 TO DATE-CONVERSION-PARMS
518100     SET PARM-ADD               TO TRUE
518200     MOVE P920-DHD-DATE         TO PARM-PRI-DATE-GREG
518300     MOVE P920-DHD-TIME         TO PARM-PRI-HRMN
518400     MOVE P920-DHD-DURATION     TO PARM-SEC-HRMN
518500     EXEC CICS LINK
518600               PROGRAM(P903-PGM)
518700               COMMAREA(DATE-CONVERSION-PARMS)
518800               LENGTH(P903-LGTH)
518900               RESP(WS-RESPONSE)
519000     END-EXEC
519100     MOVE WS-RESPONSE TO FILE-STATUS
519200     IF NOT SUCCESS
519300        MOVE 'P1210-1' TO ERR-PARAGRAPH
519400        PERFORM P9999-GOT-PROBLEM
519500     END-IF
519600*-----------------------------------------------------------------
519700*    GET TRAIN PROFILE FOR FURTHER PROCESSING.
519800*--------------------------------------------------------------PLS
519900     MOVE P920-DHD-PROFILE-KEY       TO TRCNKEY1
520000     EXEC CICS READ
520100               DATASET(TRAIN-CN-VIA-TRCNKEY1)
520200               INTO(WS-TRCN-FILE)
520300               LENGTH(TRAINCN-RLGTH)
520400               RIDFLD(TRCNKEY1)
520500               KEYLENGTH(TRAINCN-KLGTH)
520600               RESP(WS-RESPONSE)
520700     END-EXEC
520800     MOVE WS-RESPONSE                TO FILE-STATUS
520900     IF NOT SUCCESS
521000        MOVE 'P1210-2'               TO ERR-PARAGRAPH
521100        MOVE TRCNKEY1                TO ERR-KEY
521200        PERFORM P9999-GOT-PROBLEM
521300     END-IF
521400
521500*CNC0413 - JES
521600*    BROWSE TRACKING RECORDS AND INSERT ROW IN TEMP TRACK TABLE
521700*    FOR EACH EMPLOYEE
521800*
521900     MOVE SPACES                   TO EMPTRKASGNKEY-AREA
522000     MOVE ZEROES                   TO TRK-SUB
522100     SET ETRK-NOT-DONE             TO TRUE
522200     PERFORM UNTIL ETRK-DONE
522300        IF P920-ASGN-UFP
522400           SET EMPTRK-ASG-UFP      TO TRUE
522500        ELSE
522600           SET EMPTRK-ASG-AJ       TO TRUE
522700        END-IF
522800        MOVE P920-ASGN-PARM        TO EMPTRK-ASSIGNMENT
522900        ADD 1                      TO TRK-SUB
523000        MOVE TRK-SUB               TO EMPTRK-ASGN-SEQ
523100        MOVE EMPTRKASGNKEY-AREA    TO ETRACK-ASGNKEY
523200        EXEC CICS READ
523300                  DATASET  (ETRACK-VIA-ASGN)
523400                  INTO     (WS-EMP-TRACK)
523500                  RIDFLD   (ETRACK-ASGNKEY)
523600                  LENGTH   (ETRACK-ASGN-RLGTH)
523700                  KEYLENGTH(ETRACK-ASGN-KLGTH)
523800                  GTEQ
523900                  RESP     (WS-RESPONSE)
524000        END-EXEC
524100        MOVE WS-RESPONSE           TO FILE-STATUS
524200        IF SUCCESS
524300           IF  EMPTRK-ASGN-TYPE = P920-ASGN-TYPE
524400           AND EMPTRK-ASSIGNMENT = P920-ASGN-PARM
524500              IF EMPTRK-LOST-WORK
524600*                ADD A TTA ROW
524700                 MOVE P920-DHD-EMP-NO   TO TTA-ON-DUTY-EMP-NBR
524800                 MOVE P920-DHD-DATE-TIME TO TTA-ON-DUTY-TS-DTTM
524900                 MOVE EMPTRK-ASGN-DIST  TO TTA-DIST
525000                 MOVE EMPTRK-ASGN-SDIST TO TTA-SUB-DIST
525100                 MOVE P920-ASGN-PARM    TO TTA-ASGN-ID
525200                 MOVE EMPTRK-ASGN-CRAFT TO TTA-CRAFT-CD
525300                 MOVE EMPTRK-EMP-NO     TO TTA-TRACKED-EMP
525400                 IF EMPTRK-VALID-REST-STATUS
525500                    MOVE EMPTRK-REST-STATUS-FLAG
525600                                        TO TTA-REST-STATUS-CD
525700                 ELSE
525800                    SET TTA-EMP-STATUS-GREEN
525900                                        TO TRUE
526000                 END-IF
526100                 MOVE WS-PRESENT-TIME   TO TTA-CREATE-TS-DTTM
526200                 PERFORM PSQL-TTAINS
526300              END-IF
526400           ELSE
526500              SET ETRK-DONE        TO TRUE
526600           END-IF
526700        ELSE
526800           SET ETRK-DONE           TO TRUE
526900           IF NOT (NO-RECORD-FND OR END-OF-FILE)
527000              MOVE 'P1210-8'       TO ERR-PARAGRAPH
527100              MOVE ETRACK-ASGNKEY  TO ERR-KEY
527200              PERFORM P9999-GOT-PROBLEM
527300           END-IF
527400        END-IF
527500     END-PERFORM
527600
527700     MOVE SPACES                TO P925-COMMAREA-PARMS
527800     SET P925-CALC-US-HRS-SVC   TO TRUE
527900     SET P925-CALC-CAN-HRS-SVC  TO TRUE
528000     IF P920-ASGN-AJ
528100        SET P925-TIE-UP-YARD    TO TRUE
528200     ELSE
528300        SET P925-TIE-UP-ROAD    TO TRUE
528400     END-IF
528500*                                                              PLS
528600     IF P920-DEADHEAD-HOME
528700        SET P925-CALC-PENALTY   TO TRUE
528800        MOVE TRCN-ORIGIN-STN    TO P925-STATION
528900        MOVE 'H'                TO P925-TERM
529000     ELSE
529100        MOVE 'A'                TO P925-TERM
529200     END-IF
529300     SET P925-CALC-US-CONT-DUTY TO TRUE
529400     MOVE P920-DHD-EMP-NO       TO P925-EMP-NO
529500     MOVE P920-DHD-DATE-TIME    TO P925-OD-DATE-TIME
529600     MOVE PARM-RES-DATE-GREG    TO P925-OFFD-DATE
529700     MOVE PARM-RES-HRMN         TO P925-OFFD-TIME
529800     MOVE P920-TIME-ZONE        TO P925-TIME-ZONE
529900     SET P925-DEADHEAD          TO TRUE
530000     IF P920-DEADHEAD-HOME
530100        SET P925-TIE-UP-HOME    TO TRUE
530200     END-IF
530300     PERFORM P1212-UPD-ETOD-DHD
530400*CNC0600-B
530500     IF WS-CAN-WRR-NEW AND
530600        P920-DEADHEAD-HOME
530700        PERFORM P2020-7DAY-RESET-BREAK-ELIG
530800     END-IF
530900*CNC0600-E
531000     EXEC CICS LINK
531100               PROGRAM(P925-PGM)
531200               COMMAREA(P925-COMMAREA-PARMS)
531300               LENGTH(P925-LGTH)
531400               RESP(WS-RESPONSE)
531500     END-EXEC
531600     MOVE WS-RESPONSE TO FILE-STATUS
531700     IF NOT SUCCESS
531800        MOVE 'P1210-3' TO ERR-PARAGRAPH
531900        PERFORM P9999-GOT-PROBLEM
532000     END-IF
532100     MOVE P920-DHD-EMP-NO   TO MSTRNBRK
532200     PERFORM P8520-READ-MASTER-UPDATE
532300     IF NOT SUCCESS
532400        MOVE 'P1210-4'      TO ERR-PARAGRAPH
532500        MOVE MSTRNBRK       TO ERR-KEY
532600        PERFORM P9999-GOT-PROBLEM
532700     END-IF
532800     MOVE LAST-ON-DUTY-TIME       TO SAVE-PREV-ODT
532900*-------------------------------------------------------*
533000*     CONVERT TO EMP-TIME-ZONE                          *
533100*-------------------------------------------------------*
533200     MOVE SPACES                  TO TZ-PARAMETERS
533300     MOVE P920-TIME-ZONE          TO TZ-IN-ZONE
533400     MOVE P920-DHD-DATE-TIME      TO TZ-IN-DATE-TIME
533500     MOVE WS-EMP-TIME-ZONE        TO TZ-OUT-ZONE
533600     PERFORM P8996-TIMEZONE
533700     IF TZ-INVALID-PARAMETERS
533800        MOVE '1210TZ'             TO ERR-PARAGRAPH
533900        PERFORM P8996-TZERROR
534000     END-IF
534100     MOVE TZ-OUT-DATE-TIME        TO LAST-ON-DUTY-TIME
534200*
534300     IF NOT P920-DEADHEAD-HOME
534400        MOVE EMP-PREV-DUTY        TO SAVE-PREV-DUTY
534500        MOVE P925-US-PREV-DUTY    TO EMP-PREV-DUTY
534600     END-IF
534700     MOVE P925-US-REST-DATE-TIME  TO EMP-US-RSTD
534800     MOVE EMP-PREV-DUTY-MTOD      TO PREV-MTOD-1
534900     MOVE P925-MTOD               TO EMP-PREV-DUTY-MTOD
535000     MOVE P925-MTOD-DATE-TIME     TO EMP-MTOD
535100     SET MSTR-MTOD-CAN-ADJUST     TO TRUE
164700*CNLD-309 B  COMMENTING
535200*    MOVE P925-MTOY-DATE-TIME     TO EMP-MTOY
535300*    MOVE P925-MTOR-DATE-TIME     TO EMP-MTOR
164700*CNLD-309 E
535400     MOVE P925-MTOD-AMT           TO EMP-LAST-MTOD-AMT
535500     MOVE P925-OFFD-DATE-TIME     TO LAST-TIE-UP-TIME
535600     MOVE LAST-TIE-UP-TIME        TO RELEASE-DATE-TIME
535700     MOVE P925-OFFD-DATE-TIME     TO LAST-ARRIVAL-TIME
535800     PERFORM P8510-READ-MASTER-JOBS
535900     SET NOT-NEW-TO-PLACE                TO TRUE
536000     IF P920-DEADHEAD-HOME
536100        MOVE SPACES               TO EMP-EXTENDED-RUN-INFO
536200        IF UNAVAILABLE-LAST-FLAG > SPACES
536300           MOVE UNAVAILABLE-LAST-FLAG    TO LAYOFF-CODE-1
536400           MOVE MSTR-LAST-STATUS-REASON  TO LAYOFF-EM-CODE
536500           MOVE SPACES                  TO UNAVAILABLE-LAST-FLAG
536600                                           MSTR-LAST-STATUS-REASON
536700        ELSE
536800           IF LAYOFF-CODE-1 > 'C'
536900              CONTINUE
537000           ELSE
537100              IF TEMPORARY-ASGNMT > SPACES OR
537200                 NORMAL-ASGNMT > SPACES
537300                 SET AVAILABLE              TO TRUE
537400              ELSE
537500                 SET NEW-TO-PLACE           TO TRUE
537600                 SET TO-PLACE               TO TRUE
537700                 MOVE WS-PRESENT-TIME       TO LAYOFF-TIME
537800              END-IF
537900           END-IF
538000        END-IF
538100        IF NORMAL-ASGNMT > SPACES AND
538200           TEMPORARY-ASGNMT NOT > SPACES
538300           MOVE SPACES                   TO EMP-FTV-DATE
538400        END-IF
538500     ELSE
538600*
538700*       SINCE A PERSON WHO IS TIED AWAY CAN BE DEADHEADED TO A
538800*       DIFFERENT AWAY LOCATION, ONLY UPDATE THE EXTENDED RUN
538900*       ASSIGNMENT IF THE XR-ASGN-TYPE IS BLANK.
539000*
539100        IF EMP-XR-ASGN-TYPE NOT > SPACES
539200           MOVE SPACES                   TO EMP-EXTENDED-RUN-INFO
539300           IF  TEMPORARY-ASGNMT > SPACES
539400              MOVE TEMPORARY-ASGNMT-FLAG TO EMP-XR-ASGN-TYPE
539500              MOVE TEMPORARY-ASGNMT      TO EMP-XR-ASSIGNMENT
539600           ELSE
539700              IF NORMAL-ASGNMT > SPACES
539800                 MOVE NORMAL-ASGNMT-FLAG TO EMP-XR-ASGN-TYPE
539900                 MOVE NORMAL-ASGNMT      TO EMP-XR-ASSIGNMENT
540000              ELSE
540100                 SET EMP-XR-NO-JOB       TO TRUE
540200              END-IF
540300           END-IF
540400        END-IF
540500        IF P920-ASGN-UFP
540600           SET EMP-ON-EXTENDED-RUN       TO TRUE
540700        END-IF
540800        IF LAYOFF-CODE-1 > 'B'
540900           MOVE LAYOFF-CODE-1          TO UNAVAILABLE-LAST-FLAG
541000           MOVE LAYOFF-EM-CODE         TO MSTR-LAST-STATUS-REASON
541100           MOVE MSTR-LAST-STATUS-REASON TO LAYOFF-EM-CODE
541200        END-IF
541300        SET AVAILABLE                    TO TRUE
541400        IF P920-DHD-FURTH-NOT-FLAG = 'Y'
541500           IF EMP-FTV-DATE NOT > SPACES
541600              MOVE TEMP-ASGN-DATE        TO EMP-FTV-DATE
541700           END-IF
541800        END-IF
541900     END-IF
542000     IF TEMPORARY-ASGNMT > SPACES OR NORMAL-ASGNMT > SPACES
542100        PERFORM P1220-FIND-HOME-TERM-CODE
542200     END-IF
542300*
542400*    DETERMINE WHETHER THIS TOUR IS IN/OUT OF THE "BOX"
542500*
542600     IF P920-DEADHEAD-HOME
542700        MOVE CRAFT IN WS-MSTR        TO WS-CRAFT-CODE-CHECK
542800     ELSE
542900        MOVE P920-ASGN-CC            TO WS-CRAFT-CODE-CHECK
543000     END-IF
543100     MOVE ' '                        TO EMP-LAST-TOUR-FLAG
543200     IF ENGINE-CRAFT
543300        IF TRCN-EN-REST-REQ NOT = 'N'
543400           SET EMP-LAST-TOUR-OUT-OF-BOX
543500                                     TO TRUE
543600        END-IF
543700     ELSE
543800        IF TRCN-TR-REST-REQ NOT = 'N'
543900           SET EMP-LAST-TOUR-OUT-OF-BOX
544000                                     TO TRUE
544100        END-IF
544200     END-IF
544300*
544400*    RESET CONSECUTIVE MISSED CALLS COUNTER
544500*
544600     MOVE ZEROS                TO MSTR-CONS-MISSED-CALLS
544700*
544800*CNC0600 - RJA - B
544900     IF WS-CAN-WRR-NEW
545000        MOVE EMP-NBR OF WS-MSTR    TO MSTR3NBRK
545100        PERFORM P8565-READ-UPDATE-MSTR3
545200        IF NOT SUCCESS
545300           MOVE 'P1210-09' TO ERR-PARAGRAPH
545400           MOVE MSTR3NBRK TO ERR-KEY
545500           PERFORM P9999-GOT-PROBLEM
545600        END-IF
545700        PERFORM P2030-COMPUTE-RESET-BREAK
545800        PERFORM P8570-REWRITE-MSTR3
545900        IF NOT SUCCESS
546000           MOVE 'P1210-10' TO ERR-PARAGRAPH
546100           MOVE MSTR3NBRK TO ERR-KEY
546200           PERFORM P9999-GOT-PROBLEM
546300        END-IF
546400     END-IF
546500*CNC0600 - RJA - E
546600*
546700     PERFORM P8550-REWRITE-MASTER
546800*
546900     IF NEW-TO-PLACE
547000        PERFORM P8800-LINK-P937-TO-PLACE
547100     END-IF
547200*
547300     MOVE SPACES             TO P943-COMMAREA-PARMS
547400     SET P943-DEADHEAD-FUN   TO TRUE
547500     MOVE P920-DHD-EMP-NO    TO P943-EMP-NBR
547600     MOVE P925-OD-DATE-TIME  TO P943-EFF-DATE-TIME
547700     MOVE CRAFT OF WS-MSTR   TO P943-CRAFT
547800     MOVE LAYOFF-CODE        TO P943-LO
547900     MOVE P920-ASGN-MERG-CLASS TO P943-ASGN-MERG-CLASS
548000     IF NOT P920-DEADHEAD-HOME
548100        IF P920-ASGN-UFP
548200           MOVE DIST OF WS-UFP      TO P943-DIST
548300           MOVE SUB-DIST OF WS-UFP  TO P943-SDIST
548400           MOVE POOL-NAME OF WS-UFP TO P943-POOL-ASG
548500           MOVE IN-OUT-TERMINAL     TO P943-IN-OUT
548600        ELSE
548700           MOVE P920-ASGN-DIST      TO P943-DIST
548800           MOVE P920-ASGN-SUB-DIST  TO P943-SDIST
548900           MOVE AJ-JOB-ASGN-ID      TO JOB-DEF-CHECK
549000           IF JOB-DEF-LOCAL-ASGN
549100              MOVE JOB-DEF-LOCAL-POOL TO P943-POOL-ASG
549200           ELSE
549300              MOVE JOB-DEF-YARD-POOL  TO P943-POOL-ASG
549400           END-IF
549500           MOVE '0'                   TO P943-IN-OUT
549600        END-IF
549700        MOVE P920-ASGN-PARM           TO P943-TAT
549800     ELSE
549900        MOVE DIST OF WS-MSTR         TO P943-DIST
550000        MOVE SUB-DIST OF WS-MSTR     TO P943-SDIST
550100     END-IF
550200     PERFORM P8510-READ-MASTER-JOBS
550300     IF TEMPORARY-ASGNMT > SPACES
550400        AND TEMPORARY-ASGNMT NOT = P920-ASGN-PARM
550500        MOVE TEMPORARY-ASGNMT    TO P943-NORM-ASGN
550600     ELSE
550700        MOVE NORMAL-ASGNMT       TO P943-NORM-ASGN
550800     END-IF
550900     IF P920-DEADHEAD-HOME
551000        MOVE 'HOME'              TO P943-FUN35-TYPE
551100     ELSE
551200        MOVE P920-DHD-FUNCTION   TO P943-FUN35-TYPE
551300     END-IF
551400     MOVE P920-DEC-RULE-NO       TO P943-FUN35-RULE-NO
551500     MOVE P920-DHD-MODE-OF-TRANS TO P943-FUN35-MOT
551600     MOVE P920-DHD-DURATION      TO P943-FUN35-HRMN
551700     MOVE P920-DHD-MILES-CLMD    TO P943-FUN35-MILES
551800     MOVE P920-DHD-EMP-REST-STATUS
551900                                 TO P943-FUN35-REST-STATUS
552000*
552100     PERFORM P8900-WRITE-HISTORY
552200     IF TEMPORARY-ASGNMT > SPACE
552300        IF TA-DIST = DIST OF WS-MSTR
552400           AND TA-SUB-DIST = SUB-DIST OF WS-MSTR
552500           CONTINUE
552600        ELSE
552700           PERFORM P8000-UPDATE-MSTR-DIST-SDIST
552800        END-IF
552900     ELSE
553000        IF NORMAL-ASGNMT > SPACES
553100           IF NA-DIST = DIST OF WS-MSTR
553200              AND NA-SUB-DIST = SUB-DIST OF WS-MSTR
553300              CONTINUE
553400           ELSE
553500              PERFORM P8000-UPDATE-MSTR-DIST-SDIST
553600           END-IF
553700        END-IF
553800     END-IF
553900*
554000*    UPDATE TRACKED EMPLOYEES
554100*
554200     IF P938-ASGN-PARM > SPACE
554300        SET P938-DEADHEAD-FUNCTION    TO TRUE
554400        IF NOT P920-DEADHEAD-HOME
554500           IF P920-ASGN-UFP
554600              MOVE DIST IN WS-UFP     TO P938-TIE-UP-TO-DIST
554700              MOVE SUB-DIST IN WS-UFP TO P938-TIE-UP-TO-SDIST
554800              MOVE POOL-NAME IN WS-UFP
554900                                      TO P938-TIE-UP-TO-POOL
555000              MOVE IN-OUT-TERMINAL    TO P938-TIE-UP-TO-TERM
555100              MOVE POOL-CRAFT-CODE IN WS-UFP
555200                                      TO P938-TIE-UP-TO-CC
555300           ELSE
555400              MOVE P920-ASGN-DIST     TO P938-TIE-UP-TO-DIST
555500              MOVE P920-ASGN-SUB-DIST TO P938-TIE-UP-TO-SDIST
555600              MOVE AJ-JOB-ASGN-ID     TO JOB-DEF-CHECK
555700              IF JOB-DEF-LOCAL-ASGN
555800                 MOVE JOB-DEF-LOCAL-POOL
555900                                      TO P938-TIE-UP-TO-POOL
556000              ELSE
556100                 MOVE JOB-DEF-YARD-POOL
556200                                      TO P938-TIE-UP-TO-POOL
556300              END-IF
556400              MOVE '0'                TO P938-TIE-UP-TO-TERM
556500              MOVE AJ-JOB-ASGN-CC     TO P938-TIE-UP-TO-CC
556600           END-IF
556700           MOVE P920-ASGN-PARM        TO P938-DH-TO-ASGN
556800           MOVE P920-DHD-DECKEY       TO P938-DECKEY
556900        ELSE
557000           IF TEMPORARY-ASGNMT > SPACE
557100              MOVE TEMPORARY-ASGNMT   TO P938-DH-TO-ASGN
557200           ELSE
557300              MOVE NORMAL-ASGNMT      TO P938-DH-TO-ASGN
557400           END-IF
557500           SET P938-ASGN-IS-HOME      TO TRUE
557600        END-IF
557700        MOVE P920-TIME-ZONE           TO P938-TIME-ZONE
557800        MOVE P925-OD-DATE-TIME        TO P938-OD-DATE-TIME
557900        MOVE P925-OFFD-DATE-TIME      TO P938-OFFD-DATE-TIME
558000        MOVE P920-DHD-EMP-NO          TO P938-ON-DUTY-EMP
558100        MOVE P920-DHD-MILES-CLMD      TO P938-MILES-CLAIMED
558200                                         P938-MILES-ACTUAL
558300        MOVE P920-ASGN-MERG-CLASS     TO P938-ASGN-MERG-CLASS
558400        EXEC CICS LINK
558500                  PROGRAM(P938-PGM)
558600                  COMMAREA(P938-COMMAREA-PARMS)
558700                  LENGTH(P938-LGTH)
558800                  RESP(WS-RESPONSE)
558900        END-EXEC
559000        MOVE WS-RESPONSE              TO FILE-STATUS
559100        IF NOT SUCCESS
559200           MOVE 'P1210-6'             TO ERR-PARAGRAPH
559300           MOVE 'P938LINK'            TO ERR-KEY
559400           PERFORM P9999-GOT-PROBLEM
559500        END-IF
559600     END-IF
559700*
559800     IF TEMP-ASGN-XB
559900        OR (NORM-ASGN-XB AND TEMPORARY-ASGNMT NOT > SPACE)
560000        IF P920-DEADHEAD-HOME
560100           PERFORM P8010-PUT-TURN-ON-XBRD
560200        ELSE
560300           MOVE SPACES TO P913-COMMAREA-PARMS
560400           SET P913-DEADHEAD-FUNCTION    TO TRUE
560500           IF TEMP-ASGN-XB
560600              MOVE TA-DIST               TO P913-TURN-DIST
560700              MOVE TA-SUB-DIST           TO P913-TURN-SUB-DIST
560800              MOVE TA-CC                 TO P913-TURN-CC
560900              MOVE TA-XB-TURN            TO P913-TURN
561000           ELSE
561100              MOVE NA-DIST               TO P913-TURN-DIST
561200              MOVE NA-SUB-DIST           TO P913-TURN-SUB-DIST
561300              MOVE NA-CC                 TO P913-TURN-CC
561400              MOVE NA-XB-TURN            TO P913-TURN
561500           END-IF
561600           MOVE P920-DHD-DATE-TIME       TO P913-EFF-DATE-TIME
561700           MOVE P920-TIME-ZONE           TO P913-TIME-ZONE
561800*-------------------------------------------------------------
561900*         FOR FASTSLOW BOARDS, THE FLAG SET IN DECISION
562000*         PROCESSING IS USED TO DETERMINE ROAD VS, YARD.
562100*----------------------------------------------------------PLS
562200           IF P920-FROM-FAST-BOARD
562300              SET P913-YARD-CALL        TO TRUE
562400           ELSE
562500              IF P920-FROM-SLOW-BOARD
562600                 SET P913-ROAD-CALL     TO TRUE
562700              ELSE
562800                 IF P920-ASGN-UFP
562900                   OR (P920-ASGN-AJ AND JOB-DEF-LOCAL-ASGN)
563000                    SET P913-ROAD-CALL        TO TRUE
563100                 ELSE
563200                    SET P913-YARD-CALL        TO TRUE
563300                 END-IF
563400              END-IF
563500           END-IF
563600           EXEC CICS LINK
563700                     PROGRAM(P913-PGM)
563800                     COMMAREA(P913-COMMAREA-PARMS)
563900                     LENGTH(P913-LGTH)
564000                     RESP(WS-RESPONSE)
564100           END-EXEC
564200           MOVE WS-RESPONSE TO FILE-STATUS
564300           IF NOT SUCCESS
564400              MOVE 'P1210-7' TO ERR-PARAGRAPH
564500              PERFORM P9999-GOT-PROBLEM
564600           END-IF
564700        END-IF
564800     END-IF
564900*CNC0600 - RJA - B
565000     IF WS-CAN-WRR-NEW AND
565100        P920-DEADHEAD-HOME
      *CNLD-246-DXC-B
244200        MOVE CRAFT OF WS-MSTR TO WS-CRAFT-CODE-CHECK
244200
565200        IF RESET-BREAK-ELIGIBLE
244000        AND NOT (YARDMASTER-CRAFT
244000                 OR YARDMASTER-TRAINEE)
      *CNLD-246-DXC-E
565300*          SYSTEM RESET AND NATURAL RESET MSTR3 UPDATE
565400           MOVE EMP-NBR OF WS-MSTR  TO MSTR3NBRK
565500           PERFORM P8565-READ-UPDATE-MSTR3
565600           IF NOT SUCCESS
565700              MOVE 'P1210-5'  TO ERR-PARAGRAPH
565800              MOVE MSTR3NBRK  TO ERR-KEY
565900              PERFORM P9999-GOT-PROBLEM
566000           END-IF
566100           PERFORM P2030-COMPUTE-RESET-BREAK
566200*
566300           MOVE WS-UPD-PROJ-RESET-BRK-CH
566400                                     TO MSTR3-PROJ-RESET-BRK-CH
566500                                        MSTR3-SYSTEM-RESET-BRK-CH
566600
566700           MOVE WS-UPD-PROJ-UD1-FROM TO MSTR3-PROJ-UD1-FROM
566800                                        MSTR3-SYSTEM-UD1-FROM
566900
567000           MOVE WS-UPD-PROJ-UD1-TO   TO MSTR3-PROJ-UD1-TO
567100                                        MSTR3-SYSTEM-UD1-TO
567200
567300           MOVE WS-UPD-PROJ-UD2-FROM TO MSTR3-PROJ-UD2-FROM
567400                                        MSTR3-SYSTEM-UD2-FROM
567500
567600           MOVE WS-UPD-PROJ-UD2-TO   TO MSTR3-PROJ-UD2-TO
567700                                        MSTR3-SYSTEM-UD2-TO
567800*
567900           PERFORM P8570-REWRITE-MSTR3
568000           IF NOT SUCCESS
568100              MOVE 'P1210-9'  TO ERR-PARAGRAPH
568200              MOVE MSTR3NBRK  TO ERR-KEY
568300              PERFORM P9999-GOT-PROBLEM
568400           END-IF
568500*          SYSTEM FORCED RESET HISTORY
568600           PERFORM P2060-WRITE-RESET-BRK-HIST
568700*          EMPTOD-RESET-BREAK-REC
568800           PERFORM P2070-WRITE-ETOD-RESET-BREAK
568900*          READ MSTR TO GET THE UPDATED LAYOFF-CODE
569000           MOVE EMP-NBR  OF WS-MSTR  TO MSTRNBRK
569100           PERFORM P8515-READ-MASTER
569200           IF NOT SUCCESS
569300              MOVE 'P1210-11' TO ERR-PARAGRAPH
569400              MOVE MSTRNBRK TO ERR-KEY
569500              PERFORM P9999-GOT-PROBLEM
569600           END-IF
569700           IF ((AVAILABLE OF WS-MSTR) OR
569800               (TO-PLACE  OF WS-MSTR))
569900              PERFORM P2080-E95-LAYOFF
570000           END-IF
570100        END-IF
570200     END-IF.
570300*CNC0600 - RJA - E
570400
570500*=================================================================
570600 P1212-UPD-ETOD-DHD.
570700*=================================================================
570800*    IF THERE IS RESPITE THEN DETERMINE THE DATE
570900
571000*C969-BEG
571100*    IF P925-RESPITE-FROM-TIME > SPACES
571200*       AND P925-RESPITE-TO-TIME > SPACES
571300*       SET DE-REFORMAT-ONLY         TO TRUE
571400*       SET DE-YYMMDD-FORMAT         TO TRUE
571500*       IF P925-OD-TIME > P925-RESPITE-FROM-TIME
571600*          MOVE P925-OFFD-DATE       TO DE-YYMMDD
571700*       ELSE
571800*          MOVE P925-OD-DATE         TO DE-YYMMDD
571900*       END-IF
572000*       PERFORM P8998-DATEEDIT
572100*       MOVE DE-CCYYMMDD          TO WS-RESPITE-FROM-DATE-CENT
572200*       MOVE P925-RESPITE-FROM-TIME  TO WS-RESPITE-FROM-TIME
572300*
572400*       SET DE-REFORMAT-ONLY         TO TRUE
572500*       SET DE-YYMMDD-FORMAT         TO TRUE
572600*       IF P925-RESPITE-TO-TIME > P925-OFFD-TIME
572700*          MOVE P925-OD-DATE         TO DE-YYMMDD
572800*       ELSE
572900*          MOVE P925-OFFD-DATE       TO DE-YYMMDD
573000*       END-IF
573100*       PERFORM P8998-DATEEDIT
573200*       MOVE DE-CCYYMMDD             TO WS-RESPITE-TO-DATE-CENT
573300*       MOVE P925-RESPITE-TO-TIME    TO WS-RESPITE-TO-TIME
573400*    END-IF
573500     IF P925-RESPITE-FROM-TIME > SPACES
573600        AND P925-RESPITE-TO-TIME > SPACES
573700        SET DE-REFORMAT-ONLY         TO TRUE
573800        SET DE-YYMMDD-FORMAT         TO TRUE
573900        MOVE P920-RESPITE-FROM-DATE  TO DE-YYMMDD
574000        PERFORM P8998-DATEEDIT
574100        MOVE DE-CCYYMMDD             TO WS-RESPITE-FROM-DATE-CENT
574200        MOVE P925-RESPITE-FROM-TIME  TO WS-RESPITE-FROM-TIME
574300
574400        SET DE-REFORMAT-ONLY         TO TRUE
574500        SET DE-YYMMDD-FORMAT         TO TRUE
574600        MOVE P920-RESPITE-TO-DATE    TO DE-YYMMDD
574700        PERFORM P8998-DATEEDIT
574800        MOVE DE-CCYYMMDD             TO WS-RESPITE-TO-DATE-CENT
574900        MOVE P925-RESPITE-TO-TIME    TO WS-RESPITE-TO-TIME
575000     END-IF
575100*C969-END
575200
575300     INITIALIZE PS08-COMMAREA-PARMS
575400     SET PS08-INSERT-FUN      TO TRUE
575500*-----------------------------------------------------------------
575600*  NOTE:  DHD CALLS DO NOT HAVE DIFFERENT DHD ORDER DT/TM AND
575700*         EMPLOYEE ON DUTY DT/TM.
575800*-----------------------------------------------------------------
575900     MOVE P925-EMP-NO         TO PS08-EMP-NBR
576000*CNLD-192-B
576100*    MOVE P925-OD-DATE-TIME   TO PS08-OD-DATE-TIME
576200*                                PS08-ORDER-DATE-TIME
576300     MOVE SPACES                TO TZ-PARAMETERS
576400     MOVE P920-TIME-ZONE        TO TZ-IN-ZONE
576500     MOVE P925-OD-DATE-TIME     TO TZ-IN-DATE-TIME
576600     MOVE WS-EMP-TIME-ZONE      TO TZ-OUT-ZONE
576700     PERFORM P8996-TIMEZONE
576800     IF TZ-INVALID-PARAMETERS
576900        MOVE 'Y1212TZ'        TO ERR-PARAGRAPH
577000        PERFORM P8996-TZERROR
577100     END-IF
577200     MOVE TZ-OUT-DATE-TIME    TO PS08-OD-DATE-TIME
577300                                 PS08-ORDER-DATE-TIME
577400*
577500*CNLD-192-E
577600     SET DE-YYMMDD-FORMAT     TO TRUE
577700     MOVE PS08-OD-DATE        TO DE-YYMMDD
577800     PERFORM P8998-DATEEDIT
577900     MOVE DE-CCYYMMDD         TO PS08-OD-DATE-CENT
578000                                 PS08-ORDER-DATE-CENT
578100*
578200*CNLD-192-B
578300*    MOVE P925-OFFD-DATE-TIME TO PS08-OFFD-DATE-TIME
578400     MOVE SPACES                TO TZ-PARAMETERS
578500     MOVE P920-TIME-ZONE        TO TZ-IN-ZONE
578600     MOVE P925-OFFD-DATE-TIME   TO TZ-IN-DATE-TIME
578700     MOVE WS-EMP-TIME-ZONE      TO TZ-OUT-ZONE
578800     PERFORM P8996-TIMEZONE
578900     IF TZ-INVALID-PARAMETERS
579000        MOVE 'Y1213TZ'        TO ERR-PARAGRAPH
579100        PERFORM P8996-TZERROR
579200     END-IF
579300     MOVE TZ-OUT-DATE-TIME    TO PS08-OFFD-DATE-TIME
579400*CNLD-192-E
579500*
579600*CNC0600 - RJA - B
579700                                 WS-PROJ-RESET-BEGIN
579710     MOVE WS-EMP-TIME-ZONE    TO PS08-TIME-ZONE
579800*CNC0600 - RJA - E
579900     SET DE-YYMMDD-FORMAT     TO TRUE
580000     MOVE PS08-OFFD-DATE      TO DE-YYMMDD
580100     PERFORM P8998-DATEEDIT
580200     MOVE DE-CCYYMMDD         TO PS08-OFFD-DATE-CENT
580300
580400     MOVE P920-ASGN-DIST           TO PS08-DIST
580500     MOVE P920-ASGN-SUB-DIST       TO PS08-SDIST
580600     MOVE P920-ASGN-PARM           TO PS08-TRAIN-ASGN
580700     MOVE P920-ASGN-CC             TO PS08-CRAFT
580800     MOVE P920-DHD-EMP-REST-STATUS TO PS08-EMP-REST-STATUS
580900*CNC0600 - RJA - B
581000     MOVE PS08-DIST                TO WS-PS08-DIST
581100     MOVE PS08-SDIST               TO WS-PS08-SDIST
581200     MOVE PS08-TRAIN-ASGN          TO WS-PS08-TRAIN-ASGN
581300     MOVE PS08-CRAFT               TO WS-PS08-CRAFT
581400     MOVE PS08-EMP-REST-STATUS     TO WS-PS08-EMP-REST-STATUS
581500*CNC0600 - RJA - E
581600
581700     IF WS-RESPITE-FROM-DTTM IS NUMERIC
581800        AND WS-RESPITE-TO-DTTM IS NUMERIC
581900        AND WS-RESPITE-TO-DTTM > WS-RESPITE-FROM-DTTM
582000        MOVE WS-RESPITE-FROM-DTTM  TO
582100                                   PS08-RESPITE-FR-DATE-TIME-CENT
582200        MOVE WS-RESPITE-TO-DTTM    TO
582300                                   PS08-RESPITE-TO-DATE-TIME-CENT
582400     END-IF
582500     MOVE P920-DHD-DATE-TIME       TO PS08-VIRT-ORDER-DATE-TIME
582600
582700     EXEC CICS LINK
582800               PROGRAM(PS08-PGM)
582900               COMMAREA(PS08-COMMAREA-PARMS)
583000               LENGTH(PS08-LGTH)
583100               RESP(WS-RESPONSE)
583200     END-EXEC
583300     MOVE WS-RESPONSE           TO FILE-STATUS
583400     IF NOT SUCCESS
583500        MOVE 'P1212-1'          TO ERR-PARAGRAPH
583600        PERFORM P9999-GOT-PROBLEM
583700     END-IF
583800     IF NOT PS08-NO-ERRORS
583900        MOVE 'P1212-2'          TO ERR-PARAGRAPH
584000        MOVE PS08-RETURN-ERRORS TO ERR-KEY
584100        MOVE 'CHECK S08 INPUT PARAMETERS'
584200                                TO ERR-SENTENCE
584300        PERFORM P9999-GOT-PROBLEM
584400     END-IF.
584500*
584600******************************************************************
584700 P1220-FIND-HOME-TERM-CODE.
584800******************************************************************
584900     IF TEMP-ASGN-AJ
585000        OR (NORM-ASGN-AJ AND TEMPORARY-ASGNMT NOT > SPACE)
585100        IF TEMP-ASGN-AJ
585200           MOVE TEMPORARY-ASGNMT  TO TRCNKEY3
585300        ELSE
585400           MOVE NORMAL-ASGNMT     TO TRCNKEY3
585500        END-IF
585600        EXEC CICS READ
585700                  DATASET(TRAIN-CN-VIA-DSD-ASGN)
585800                  INTO(WS-TRCN-FILE)
585900                  LENGTH(TRAINCN-DSD-RLGTH)
586000                  RIDFLD(TRCNKEY3)
586100                  KEYLENGTH(TRAINCN-DSD-KLGTH)
586200                  RESP(WS-RESPONSE)
586300        END-EXEC
586400        MOVE WS-RESPONSE TO FILE-STATUS
586500        IF NOT SUCCESS
586600           MOVE 'P1220-1' TO ERR-PARAGRAPH
586700           MOVE TRCNKEY3  TO ERR-KEY
586800           PERFORM P9999-GOT-PROBLEM
586900        END-IF
587000        MOVE TRCN-ORIGIN-STN TO EMP-HOME-TERM-CODE
587100        SET SEND-EM-DATA     TO TRUE
587200     ELSE
587300        MOVE SPACES          TO CNTLKEY-AREA
587400        IF TEMPORARY-ASGNMT > SPACE
587500           MOVE TA-DIST         TO CNTL-DIST
587600           MOVE TA-SUB-DIST     TO CNTL-SUB-DIST
587700           IF TEMP-ASGN-UFP
587800              MOVE '03'         TO CNTL-REC-TYPE
587900              MOVE TA-POOL      TO CNTL-POOL-CODE
588000              MOVE 'F'          TO CNTL-POOL-TYPE
588100           ELSE
588200              MOVE '08'         TO CNTL-REC-TYPE
588300              MOVE TA-CC        TO CNTL-XB
588400           END-IF
588500        ELSE
588600           MOVE NA-DIST         TO CNTL-DIST
588700           MOVE NA-SUB-DIST     TO CNTL-SUB-DIST
588800           IF NORM-ASGN-UFP
588900              MOVE '03'         TO CNTL-REC-TYPE
589000              MOVE NA-POOL      TO CNTL-POOL-CODE
589100              MOVE 'F'          TO CNTL-POOL-TYPE
589200           ELSE
589300              MOVE '08'         TO CNTL-REC-TYPE
589400              MOVE NA-CC        TO CNTL-XB
589500           END-IF
589600        END-IF
589700        MOVE CNTLKEY-AREA       TO CNTLKEY
589800        EXEC CICS READ
589900                  DATASET(CNTL-FILE-VIA-CNTLKEY)
590000                  INTO(WS-CNTL-FILE)
590100                  LENGTH(CNTLFILE-RLGTH)
590200                  RIDFLD(CNTLKEY)
590300                  KEYLENGTH(CNTLFILE-KLGTH)
590400                  RESP(WS-RESPONSE)
590500        END-EXEC
590600        MOVE WS-RESPONSE TO FILE-STATUS
590700        IF NOT SUCCESS
590800           MOVE 'P1220-2'    TO ERR-PARAGRAPH
590900           MOVE CNTLKEY      TO ERR-KEY
591000           PERFORM P9999-GOT-PROBLEM
591100        END-IF
591200        IF TEMP-ASGN-UFP
591300           OR (NORM-ASGN-UFP AND TEMPORARY-ASGNMT NOT > SPACE)
591400           MOVE CNTL-HOME-TERM-CODE
591500              TO EMP-HOME-TERM-CODE
591600           SET SEND-EM-DATA TO TRUE
591700        ELSE
591800           MOVE CNTL-XB-HOME-TERM-CODE
591900              TO EMP-HOME-TERM-CODE
592000           SET SEND-EM-DATA TO TRUE
592100        END-IF
592200     END-IF.
592300******************************************************************
592400 P1230-BUILD-DEADHEAD-HSL.
592500******************************************************************
592600*
592700     MOVE P920-DHD-DATE            TO WS-PS93-START-DATE
592800     MOVE P920-DHD-TIME            TO WS-PS93-START-TIME
592900     PERFORM P1113-CHECK-FOR-7TH-START
593000*
593100     INITIALIZE PS93-COMMAREA-PARMS
593200     MOVE ZEROES                   TO WS-TOTAL-MN
593300                                      WS-LIMBO-MN
593400                                      WS-HRMN
593500     SET PS93-INSERT-HSD           TO TRUE
593600     MOVE EMP-NBR OF WS-MSTR       TO PS93-EMP-NBR
593700     MOVE P920-TIME-ZONE           TO PS93-TIME-ZONE
593800     MOVE P920-DHD-DATE-TIME       TO PS93-HSL-EVENT-STRT-TS-DTTM
593900                                      PS93-HSD-EVENT-STRT-TS-DTTM
594000     MOVE ZEROS                    TO DATE-CONVERSION-PARMS
594100     SET PARM-ADD                  TO TRUE
594200     MOVE P920-DHD-DATE            TO PARM-PRI-DATE-GREG
594300     MOVE P920-DHD-TIME            TO PARM-PRI-HRMN
594400     MOVE P920-DHD-DURATION        TO PARM-SEC-HRMN
594500     EXEC CICS LINK
594600               PROGRAM(P903-PGM)
594700               COMMAREA(DATE-CONVERSION-PARMS)
594800               LENGTH(P903-LGTH)
594900               RESP(WS-RESPONSE)
595000     END-EXEC
595100     MOVE WS-RESPONSE              TO FILE-STATUS
595200     IF NOT SUCCESS
595300        MOVE 'P1230-01'            TO ERR-PARAGRAPH
595400        MOVE 'P903'                TO ERR-KEY
595500        PERFORM P9999-GOT-PROBLEM
595600     END-IF
595700     MOVE PARM-RES-DATE-GREG       TO PS93-EVENT-END-TS-DT
595800     MOVE PARM-RES-HRMN            TO PS93-EVENT-END-TS-TM
595900     IF P920-DEADHEAD-HOME
596000        MOVE 'N'                   TO PS93-TIE-UP-AWAY-INDR
596100     ELSE
596200        MOVE 'Y'                   TO PS93-TIE-UP-AWAY-INDR
596300     END-IF
596400     MOVE '3'                      TO PS93-EVENT-CD
596500     MOVE P920-DHD-PROFILE-KEY     TO PS93-TRAIN-SYMBOL
596600     MOVE AHM-AHIST-KEY            TO PS93-AHIST-KEY
596700     IF P920-DEADHEAD-HOME
596800        MOVE P920-ASGN-ASGN        TO PS93-ASGNMT-TXT
596900     ELSE
597000        MOVE P920-ASGN-PARM        TO PS93-ASGNMT-TXT
597100     END-IF
597200     MOVE 'Y'                      TO PS93-STRT-INDR
597300                                      PS93-HOS-FL
597400*CNC0570-BEG
597500*                                     PS93-CERTIFICATION-INDR
597600     IF ADD-DH-FRA
597700        MOVE 'N'                   TO PS93-CERTIFICATION-INDR
597800     ELSE
597900        MOVE 'Y'                   TO PS93-CERTIFICATION-INDR
598000     END-IF
598100*CNC0570-BEG
598200
598300*CNC0526-BEG
598400     IF US-DOMICILED AND P920-TIE-UP-FUNCTION
598500        IF P920-DHD-DATE-TIME       < WS-HOLD-MSTR-US-RSTD
598600           MOVE 'N'                TO PS93-STRT-INDR
598700        END-IF
598800     END-IF
598900*CNC0526-END
599000     IF WS-COUNT-AS-START-NO
599100        MOVE 'N'                   TO PS93-STRT-INDR
599200     END-IF
599300     MOVE P920-DHD-DURATION        TO WS-HRMN
599400     COMPUTE WS-TOTAL-MN = ((WS-HR * 60) + WS-MN)
599500     MOVE WS-TOTAL-MN              TO PS93-DURATION
599600     IF WS-TOTAL-MN > 720
599700        COMPUTE WS-LIMBO-MN = WS-TOTAL-MN - 720
599800     ELSE
599900        MOVE ZEROES                TO PS93-LIMBO-TM
600000     END-IF
600100
600200     EXEC CICS ASSIGN
600300               USERID(PS93-USER-ID)
600400     END-EXEC
600500
600600     PERFORM P8910-CALL-PS93-PROGRAM.
600700*
600800******************************************************************
600900 P1250-RELEASE-EMPS.
601000******************************************************************
601100     IF SAVE-TEMP-ASGN-KEY > SPACE
601200        MOVE SAVE-TEMP-ASGN-KEY      TO XXXX-ASGNKEY1
601300     ELSE
601400        IF SAVE-NORM-ASGN-KEY > SPACE
601500           MOVE SAVE-NORM-ASGN-KEY   TO XXXX-ASGNKEY1
601600        END-IF
601700     END-IF
601800     IF XXXX-ASGNKEY1 > SPACE
601900        ADD 1                        TO XX-ASGN-DATE-TIME
602000        MOVE 0                       TO WS-DONE-CODE
602100        PERFORM UNTIL DONE
602200           MOVE XXXX-ASGNKEY1        TO ASGNJOB
602300           EXEC CICS READ
602400                     DATASET(ASGN-VIA-ASGNJOB)
602500                     INTO(WS-ASGN-FILE)
602600                     LENGTH(ASGNJOB-RLGTH)
602700                     RIDFLD(ASGNJOB)
602800                     KEYLENGTH(ASGNJOB-KLGTH)
602900                     GTEQ
603000                     RESP(WS-RESPONSE)
603100           END-EXEC
603200           MOVE WS-RESPONSE          TO FILE-STATUS
603300           IF SUCCESS
603400              IF XX-ASGN-DIST = ASGN-DIST
603500                 AND XX-ASGN-SUB-DIST = ASGN-SUB-DIST
603600                 AND XX-ASGN-JOB =
603700                     ASGN-AJ-JOB OF ASGN-ASSIGNMENT
603800                 AND ASGN-TEMP-REC
603900                 PERFORM P1255-DELETE-ASGNJOB
604000              ELSE
604100                 SET DONE            TO TRUE
604200              END-IF
604300           ELSE
604400              SET DONE               TO TRUE
604500              IF NOT (NO-RECORD-FND OR END-OF-FILE)
604600                 MOVE 'P1250-1'      TO ERR-PARAGRAPH
604700                 MOVE ASGNJOB        TO ERR-KEY
604800                 PERFORM P9999-GOT-PROBLEM
604900              END-IF
605000           END-IF
605100        END-PERFORM
605200     END-IF.
605300*
605400******************************************************************
605500 P1255-DELETE-ASGNJOB.
605600******************************************************************
605700     MOVE ASGNKEY1                   TO ASGNJOB
605800     EXEC CICS DELETE
605900               DATASET(ASGN-VIA-ASGNJOB)
606000               RIDFLD(ASGNJOB)
606100               RESP(WS-RESPONSE)
606200     END-EXEC
606300     MOVE WS-RESPONSE                TO FILE-STATUS
606400     IF NOT SUCCESS
606500        MOVE 'P1255-1'               TO ERR-PARAGRAPH
606600        MOVE ASGNKEY2                TO ERR-KEY
606700        PERFORM P9999-GOT-PROBLEM
606800     END-IF
606900     MOVE ASGN-EMP-NO                TO MSTRNBRK
607000     EXEC CICS READ
607100               DATASET(MSTR-VIA-EMP-NBR)
607200               INTO(WS-MSTR)
607300               LENGTH(MSTRENBR-RLGTH)
607400               RIDFLD(MSTRNBRK)
607500               KEYLENGTH(MSTRENBR-KLGTH)
607600               RESP(WS-RESPONSE)
607700     END-EXEC
607800     MOVE WS-RESPONSE                TO FILE-STATUS
607900     IF NOT SUCCESS
608000        MOVE 'P1255-2'               TO ERR-PARAGRAPH
608100        MOVE MSTRNBRK                TO ERR-KEY
608200        PERFORM P9999-GOT-PROBLEM
608300     END-IF
608400     MOVE SPACES                     TO WORK-CNTLKEY
608500     MOVE '02'                       TO WK-CNTL-REC-TYPE
608600     MOVE DIST OF WS-MSTR            TO WK-CNTL-DIST
608700     MOVE SUB-DIST OF WS-MSTR        TO WK-CNTL-SUB-DIST
608800     PERFORM P8640-READ-CNTLFILE
608900     IF NOT SUCCESS
609000        MOVE 'P1255-3'               TO ERR-PARAGRAPH
609100
609200        MOVE CNTLKEY                 TO ERR-KEY
609300
609400        PERFORM P9999-GOT-PROBLEM
609500     END-IF
609600     MOVE SPACES                     TO P927-COMMAREA-PARMS
609700                                        TZ-PARAMETERS
609800
609900     MOVE WS-EMP-TIME-ZONE           TO TZ-IN-ZONE
610000     MOVE RELEASE-DATE-TIME          TO TZ-IN-DATE-TIME
610100     MOVE CNTL-TIME-ZONE             TO TZ-OUT-ZONE
610200                                        P927-TIME-ZONE
610300     PERFORM P8996-TIMEZONE
610400     MOVE TZ-OUT-DATE-TIME           TO P927-EFF-DATE-TIME
610500     SET P927-NOTIFY-FUNCTION        TO TRUE
610600     MOVE ASGN-DIST                  TO P927-DIST
610700     MOVE ASGN-SUB-DIST              TO P927-SUB-DIST
610800     MOVE ASGN-EMP-NO                TO P927-NTFY-EMP-NO
610900     MOVE ASGNKEY1                   TO P927-NTFY-ASSIGNMENT-KEY
611000     MOVE P920-DHD-EMP-NO            TO P927-NTFY-DISP-BY
611100     MOVE 'T'                        TO P927-NTFY-MOVE-TYPE
611200*CNC0436B
611300*    IS IVR ACTIVATED IN DISTRICT
611400     MOVE SPACES                        TO CNTLKEY-AREA
611500     SET  COMPANY-TYPE-REC              TO TRUE
611600     MOVE CNTLKEY-AREA                  TO CNTLKEY
611700     EXEC CICS READ
611800               DATASET  (CNTL-FILE-VIA-CNTLKEY)
611900               INTO     (WS-CNTL-FILE)
612000               LENGTH   (CNTLFILE-RLGTH)
612100               RIDFLD   (CNTLKEY)
612200               KEYLENGTH(CNTLFILE-KLGTH)
612300               RESP     (WS-RESPONSE)
612400     END-EXEC
612500
612600     MOVE WS-RESPONSE              TO FILE-STATUS
612700     IF  SUCCESS
612800     AND CNTL-IVR-CALL-FLAG              = 'Y'
612900        MOVE SPACES                     TO CNTLKEY-AREA
613000        SET  SUB-DIST-TYPE-2B-REC       TO TRUE
613100        MOVE ASGN-DIST                  TO CNTL-DIST
613200        MOVE ASGN-SUB-DIST              TO CNTL-SUB-DIST
613300        MOVE CNTLKEY-AREA               TO CNTLKEY
613400        EXEC CICS READ
613500                  DATASET  (CNTL-FILE-VIA-CNTLKEY)
613600                  INTO     (WS-CNTL-FILE)
613700                  LENGTH   (CNTLFILE-RLGTH)
613800                  RIDFLD   (CNTLKEY)
613900                  KEYLENGTH(CNTLFILE-KLGTH)
614000                  RESP     (WS-RESPONSE)
614100        END-EXEC
614200
614300        MOVE WS-RESPONSE                TO FILE-STATUS
614400        IF  SUCCESS
614500        AND CNTL-2B-IVR-NOTIFY-FL        = 'Y'
614600*    GET NOTIFICATION PROFILE
614700           PERFORM P1235-FIND-IVR-NTFY-CNTL
614800           IF  NTFY-CNTL-FOUND
614900           AND CNTL-DSPL-IVR-NTFY
615000              SET  P927-IVR             TO TRUE
615100              MOVE WS-IVR-NTFY-CNTL-KEY TO P927-IVR-NTFY-CNTL-KEY
615200              MOVE ZEROES               TO P927-PREF-ORD-NBR
615300              CALL CNCTSC USING TYP-TO  P927-AWRD-EFF-TS
615400                                        P927-EFF-DATE-TIME
615500              MOVE C-MAX-TS             TO P927-CLS-TS
615600              MOVE 'N'                  TO P927-NOTIFY-HOLD-FLAG
615700              SET  P927-DISPLACED-FROM  TO TRUE
615800           END-IF
615900        END-IF
616000     END-IF
616100     EXEC CICS LINK
616200               PROGRAM(P927-PGM)
616300               COMMAREA(P927-COMMAREA-PARMS)
616400               LENGTH(P927-LGTH)
616500               RESP(WS-RESPONSE)
616600     END-EXEC
616700     MOVE WS-RESPONSE                TO FILE-STATUS
616800     IF NOT SUCCESS
616900        MOVE 'P1255-3'               TO ERR-PARAGRAPH
617000        PERFORM P9999-GOT-PROBLEM
617100     END-IF
617200     MOVE SPACES                     TO P943-COMMAREA-PARMS
617300     MOVE EMP-NBR OF WS-MSTR         TO P943-EMP-NBR
617400     SET P943-DISPLACED-FUN          TO TRUE
617500     MOVE P927-EFF-DATE-TIME         TO P943-EFF-DATE-TIME
617600     MOVE DIST OF WS-MSTR            TO P943-DIST
617700     MOVE SUB-DIST OF WS-MSTR        TO P943-SDIST
617800     MOVE CRAFT OF WS-MSTR           TO P943-CRAFT
617900     MOVE LAYOFF-CODE                TO P943-LO
618000     MOVE P920-DHD-EMP-NO            TO P943-EMP-NBR-AFFECTED
618100     MOVE ASGN-ASSIGNMENT            TO P943-NORM-ASGN
618200     MOVE P927-NTFY-MOVE-TYPE        TO P943-MOVE-TYPE
618300*
618400*    IF THIS IS NOT THE PERSON'S CURRENT ASSIGNMENT, IT MAY BE IN
618500*    A DIFFERENT TIMEZONE.  IF SO ADJUST THE ASSIGNMENT TIME FOR
618600*    TIMEZONE.  IF DISPLACED BEFORE ASSIGNED, SET HIST SEQ ERROR.
618700*
618800     IF DIST OF WS-MSTR NOT = ASGN-DIST OR
618900        SUB-DIST OF WS-MSTR NOT = ASGN-SUB-DIST
619000        MOVE SPACES                  TO TZ-PARAMETERS
619100        MOVE CNTL-TIME-ZONE          TO TZ-OUT-ZONE
619200        MOVE SPACES                  TO WORK-CNTLKEY
619300        MOVE '02'                    TO WK-CNTL-REC-TYPE
619400        MOVE ASGN-DIST               TO WK-CNTL-DIST
619500        MOVE ASGN-SUB-DIST           TO WK-CNTL-SUB-DIST
619600        PERFORM P8640-READ-CNTLFILE
619700        IF NOT SUCCESS
619800           MOVE 'P1255-4'            TO ERR-PARAGRAPH
619900
620000           MOVE CNTLKEY              TO ERR-KEY
620100
620200           PERFORM P9999-GOT-PROBLEM
620300        END-IF
620400        MOVE ASGN-ASSIGNMENT-DATE-TIME TO TZ-IN-DATE-TIME
620500        MOVE CNTL-TIME-ZONE            TO TZ-IN-ZONE
620600        PERFORM P8996-TIMEZONE
620700        MOVE TZ-OUT-DATE-TIME          TO DISPLACED-ASGN-DATE-TIME
620800     ELSE
620900        MOVE ASGN-ASSIGNMENT-DATE-TIME TO DISPLACED-ASGN-DATE-TIME
621000     END-IF
621100     SET DE-YYMMDD-FORMAT               TO TRUE
621200     MOVE P943-EFF-DATE-TIME(1:6)       TO DE-YYMMDD
621300     PERFORM P8998-DATEEDIT
621400     MOVE DE-CCYYMMDD                   TO DE-COMPARE1-DATE
621500     MOVE P943-EFF-DATE-TIME(7:4)       TO DE-COMPARE1-TIME
621600     SET DE-YYMMDD-FORMAT               TO TRUE
621700     MOVE DISPLACED-ASGN-DATE-TIME(1:6) TO DE-YYMMDD
621800     PERFORM P8998-DATEEDIT
621900     MOVE DE-CCYYMMDD                   TO DE-COMPARE2-DATE
622000     MOVE DISPLACED-ASGN-DATE-TIME(7:4) TO DE-COMPARE2-TIME
622100     IF DE-COMPARE1-DATE-TIME < DE-COMPARE2-DATE-TIME
622200*    IF P943-EFF-DATE-TIME    < DISPLACED-ASGN-DATE-TIME
622300        SET P943-SEQ-ERROR              TO TRUE
622400     END-IF
622500     PERFORM P8900-WRITE-HISTORY.
622600*
622700*
622800 P1235-FIND-IVR-NTFY-CNTL.
622900*
623000     SET  NTFY-CNTL-NOT-FOUND      TO TRUE
623100     MOVE SPACES                   TO WS-CNTL-FILE
623200     SET  IVR-NTFY-CNTL-REC        TO TRUE
623300*    FULLY QUALIFY THE KEY
623400     MOVE ASGN-DIST                TO CNTL-IVR-NTFY-DIST
623500     MOVE ASGN-SUB-DIST            TO CNTL-IVR-NTFY-SDIST
623600     MOVE ASGN-AJ-JOB-CC           TO CNTL-IVR-NTFY-CRAFT
623700                                      WS-SAVE-ASGN-CC
623800     MOVE ASGN-JOB-TYPE            TO CNTL-IVR-NTFY-ASGN-TYP
623900     MOVE ASGN-AJ-JOB-NO           TO CNTL-IVR-NTFY-ASGN
624000
624100     PERFORM P1236-READ-NTFY-CNTL
624200
624300     IF NOT SUCCESS
624400*       FULLY QUALIFY THE KEY W/ MASTER CRAFT
624500        MOVE WS-SAVE-ASGN-CC       TO WS-CRAFT-CODE-CHECK
624600                                      WS-SAVE-MASTER-CC
624700        EVALUATE TRUE
624800           WHEN CONDUCTOR-CRAFT
624900                MOVE 'CO'          TO CNTL-IVR-NTFY-CRAFT
625000                                      WS-SAVE-MASTER-CC
625100           WHEN FOREMAN-CRAFT
625200                MOVE 'FO'          TO CNTL-IVR-NTFY-CRAFT
625300                                      WS-SAVE-MASTER-CC
625400           WHEN BRAKEMAN-CRAFT
625500                MOVE 'BK'          TO CNTL-IVR-NTFY-CRAFT
625600                                      WS-SAVE-MASTER-CC
625700           WHEN SWITCHMAN-CRAFT
625800                MOVE 'SW'          TO CNTL-IVR-NTFY-CRAFT
625900                                      WS-SAVE-MASTER-CC
626000           WHEN YARDMASTER-CRAFT
626100                MOVE 'YA'          TO CNTL-IVR-NTFY-CRAFT
626200                                      WS-SAVE-MASTER-CC
626300        END-EVALUATE
626400        IF WS-SAVE-ASGN-CC     NOT  = WS-SAVE-MASTER-CC
626500           PERFORM P1236-READ-NTFY-CNTL
626600        END-IF
626700     END-IF
626800*
626900     IF NOT SUCCESS
627000*       WILDCARD THE TURN ON POOL AND XB ASSIGNMENTS
627100        IF CNTL-IVR-NTFY-ASGN-TYP   = 'U' OR 'X'
627200           MOVE WS-SAVE-ASGN-CC    TO CNTL-IVR-NTFY-CRAFT
627300           MOVE '****'             TO CNTL-IVR-NTFY-ASGN(3:4)
627400           PERFORM P1236-READ-NTFY-CNTL
627500           IF NOT SUCCESS
627600           AND WS-SAVE-ASGN-CC  NOT = WS-SAVE-MASTER-CC
627700*          WILDCARD THE TURN ON POOL AND XB ASSIGNMENTS-MASTER CC
627800              MOVE WS-SAVE-MASTER-CC TO CNTL-IVR-NTFY-CRAFT
627900              PERFORM P1236-READ-NTFY-CNTL
628000           END-IF
628100        END-IF
628200     END-IF
628300
628400     IF NOT SUCCESS
628500*       WILDCARD THE TURN ON ASSIGNED JOB ASSIGNMENTS
628600        IF CNTL-IVR-NTFY-ASGN-TYP   = 'A'
628700           MOVE WS-SAVE-ASGN-CC    TO CNTL-IVR-NTFY-CRAFT
628800           MOVE '**'               TO CNTL-IVR-NTFY-ASGN(5:2)
628900           PERFORM P1236-READ-NTFY-CNTL
629000           IF NOT SUCCESS
629100           AND WS-SAVE-ASGN-CC  NOT = WS-SAVE-MASTER-CC
629200*          WILDCARD THE TURN ON ASSIGNED JOB ASSIGNMENTS-MASTER CC
629300              MOVE WS-SAVE-MASTER-CC TO CNTL-IVR-NTFY-CRAFT
629400              PERFORM P1236-READ-NTFY-CNTL
629500           END-IF
629600        END-IF
629700     END-IF
629800
629900     IF NOT SUCCESS
630000*       WILDCARD THE ASSIGNMENT ON ALL ASSIGNMENTS
630100        MOVE WS-SAVE-ASGN-CC    TO CNTL-IVR-NTFY-CRAFT
630200        MOVE '******'           TO CNTL-IVR-NTFY-ASGN
630300        PERFORM P1236-READ-NTFY-CNTL
630400        IF NOT SUCCESS
630500        AND WS-SAVE-ASGN-CC  NOT = WS-SAVE-MASTER-CC
630600*       WILDCARD THE ASSIGNMENT ON POOL & XB ASGNMTS-MASTER CC
630700           MOVE WS-SAVE-MASTER-CC TO CNTL-IVR-NTFY-CRAFT
630800           PERFORM P1236-READ-NTFY-CNTL
630900        END-IF
631000     END-IF
631100
631200     IF NOT SUCCESS
631300*       WILDCARD THE ASSIGNMENT TYPE AND ASSIGNMENT
631400        MOVE WS-SAVE-ASGN-CC       TO CNTL-IVR-NTFY-CRAFT
631500        MOVE '*'                   TO CNTL-IVR-NTFY-ASGN-TYP
631600        MOVE '******'              TO CNTL-IVR-NTFY-ASGN
631700        PERFORM P1236-READ-NTFY-CNTL
631800        IF NOT SUCCESS
631900        AND WS-SAVE-ASGN-CC  NOT = WS-SAVE-MASTER-CC
632000*       WILDCARD THE ASSIGNMENT TYPE AND ASSIGNMENT-MASTER CC
632100           MOVE WS-SAVE-MASTER-CC  TO CNTL-IVR-NTFY-CRAFT
632200           PERFORM P1236-READ-NTFY-CNTL
632300        END-IF
632400     END-IF
632500
632600     IF NOT SUCCESS
632700*       WILDCARD THE CRAFT CODE
632800        MOVE '**'                  TO CNTL-IVR-NTFY-CRAFT
632900        PERFORM P1236-READ-NTFY-CNTL
633000     END-IF
633100
633200     IF NOT SUCCESS
633300*       WILDCARD THE SUB DISTRICT
633400        MOVE '**'                  TO CNTL-IVR-NTFY-SDIST
633500        PERFORM P1236-READ-NTFY-CNTL
633600     END-IF
633700
633800     IF NOT SUCCESS
633900*       WILDCARD THE DISTRICT
634000        MOVE '**'                  TO CNTL-IVR-NTFY-DIST
634100        PERFORM P1236-READ-NTFY-CNTL
634200     END-IF
634300
634400     IF SUCCESS
634500        SET  NTFY-CNTL-FOUND       TO TRUE
634600        MOVE CNTLKEY-AREA          TO WS-IVR-NTFY-CNTL-KEY
634700     END-IF
634800     .
634900*
635000 P1236-READ-NTFY-CNTL.
635100*
635200     MOVE CNTLKEY-AREA             TO CNTLKEY
635300     EXEC CICS READ
635400               DATASET  (CNTL-FILE-VIA-CNTLKEY)
635500               INTO     (WS-CNTL-FILE)
635600               LENGTH   (CNTLFILE-RLGTH)
635700               RIDFLD   (CNTLKEY)
635800               KEYLENGTH(CNTLFILE-KLGTH)
635900               RESP     (WS-RESPONSE)
636000     END-EXEC
636100
636200     MOVE WS-RESPONSE              TO FILE-STATUS
636300     EVALUATE TRUE
636400        WHEN SUCCESS
636500        WHEN NO-RECORD-FND
636600             CONTINUE
636700        WHEN OTHER
636800             MOVE 'P1236-1'        TO ERR-PARAGRAPH
636900             MOVE CNTLKEY          TO ERR-KEY
637000             PERFORM P9999-GOT-PROBLEM
637100     END-EVALUATE
637200     .
637300******************************************************************
637400 P1300-UPDATE-LVE.
637500******************************************************************
637600     IF NOT P920-CANCEL-FUNCTION
637700        IF P920-ASGN-IS-HOME
637800           IF LVE-RECORD-EXISTS
637900              IF LVE-FCLTY-CD = '999'
638000                 SET FACILITY-999-DELETED TO TRUE
638100                 MOVE LVE-LDG-STN  TO WS-DELETED-STATION
638200              END-IF
638300              PERFORM PSQL-LVEDEL01
638400           END-IF
638500           MOVE SPACES             TO TELE-USE-PH-NBR-ON-FILE-FL
638600        ELSE
638700           IF LVE-RECORD-EXISTS
638800              IF P920-FINAL-STATION NOT = LVE-LDG-STN
638900
639000                 IF LVE-FCLTY-CD = '999'
639100                    SET FACILITY-999-DELETED TO TRUE
639200                    MOVE SPACES    TO TELE-USE-PH-NBR-ON-FILE-FL
639300                 END-IF
639400                 PERFORM PSQL-LVEDEL01
639500                 PERFORM P8850-INSERT-LVE
639600              ELSE
639700                 IF AHM-KEY NOT = LVE-AHM-KEY
639800                    PERFORM PSQL-LVEDEL01
639900                    PERFORM P8850-INSERT-LVE
640000                 END-IF
640100              END-IF
640200           ELSE
640300              IF P920-AFHT-FACILITY-CD > SPACES
640400                 PERFORM P8850-INSERT-LVE
640500              END-IF
640600           END-IF
640700           IF P920-USE-PH-NBR-ON-FILE > SPACES
640800              MOVE P920-USE-PH-NBR-ON-FILE
640900                                   TO TELE-USE-PH-NBR-ON-FILE-FL
641000           END-IF
641100        END-IF
641200     END-IF
641300     .
641400*C983-END
641500
641600*CNC0570-BEG
641700******************************************************************
641800 P1400-CREATE-FRA-SHELL.
641900******************************************************************
642000     INITIALIZE WS-FRA-STORAGE
642100     MOVE P920-TIME-ZONE                 TO FRA-TIME-ZONE
642200     MOVE ZERO                           TO FRA-TTOD-HRS
642300     MOVE P920-DHD-EMP-NO                TO FRA-EMP-NBR
642400*
642500     MOVE P920-DHD-DATE-TIME             TO WS-DH-AHM-ON-DUTY-DTTM
642600     MOVE WS-DH-AHM-EMP-KEY              TO FRA-AHM-EMP-KEY
642700*
642800     MOVE P920-ASGN-DIST                 TO WS-DH-AHIST-DIST
642900     MOVE P920-ASGN-SUB-DIST             TO WS-DH-AHIST-SUB-DIST
643000     MOVE P920-DHD-DATE-TIME             TO WS-DH-AHIST-CALL-DTTM
643100                                            FRA-STRT-TS-DTTM
643200*
643300     MOVE ZEROS                          TO DATE-CONVERSION-PARMS
643400     SET PARM-ADD                        TO TRUE
643500     MOVE P920-DHD-DATE                  TO PARM-PRI-DATE-GREG
643600     MOVE P920-DHD-TIME                  TO PARM-PRI-HRMN
643700     MOVE P920-DHD-DURATION              TO PARM-SEC-HRMN
643800     EXEC CICS LINK
643900               PROGRAM(P903-PGM)
644000               COMMAREA(DATE-CONVERSION-PARMS)
644100               LENGTH(P903-LGTH)
644200               RESP(WS-RESPONSE)
644300     END-EXEC
644400     MOVE WS-RESPONSE                    TO FILE-STATUS
644500     IF NOT SUCCESS
644600        MOVE 'P1400-1'                   TO ERR-PARAGRAPH
644700        MOVE 'P903'                      TO ERR-KEY
644800        PERFORM P9999-GOT-PROBLEM
644900     END-IF
645000     MOVE PARM-RES-DATE-GREG             TO FRA-RLVD-TS-DT
645100                                            FRA-RLSD-TS-DT
645200     MOVE PARM-RES-HRMN                  TO FRA-RLVD-TS-TM
645300                                            FRA-RLSD-TS-TM
645400*
645500     MOVE WS-DH-AHIST-KEY                TO FRA-AHIST-KEY
645600*
645700     MOVE 1                              TO FRA-TRN-SEQ-NBR
645800     MOVE 'DH'                           TO FRA-ACT-TYP
645900                                            FRA-SYMBOL
646000     PERFORM PSQL-FRAINS
646100     .
646200*CNC0570-END
646300******************************************************************
646400 P2000-UPD-ETOD.
646500******************************************************************
646600*    IF THERE IS RESPITE THEN DETERMINE THE DATE
646700
646800*C969-BEG
646900*    IF P925-RESPITE-FROM-TIME > SPACES
647000*       AND P925-RESPITE-TO-TIME > SPACES
647100*       SET DE-REFORMAT-ONLY         TO TRUE
647200*       SET DE-YYMMDD-FORMAT         TO TRUE
647300*       IF P925-OD-TIME > P925-RESPITE-FROM-TIME
647400*          MOVE P925-OFFD-DATE       TO DE-YYMMDD
647500*       ELSE
647600*          MOVE P925-OD-DATE         TO DE-YYMMDD
647700*       END-IF
647800*       PERFORM P8998-DATEEDIT
647900*       MOVE DE-CCYYMMDD          TO WS-RESPITE-FROM-DATE-CENT
648000*       MOVE P925-RESPITE-FROM-TIME  TO WS-RESPITE-FROM-TIME
648100*
648200*       SET DE-REFORMAT-ONLY         TO TRUE
648300*       SET DE-YYMMDD-FORMAT         TO TRUE
648400*       IF P925-RESPITE-TO-TIME > P925-OFFD-TIME
648500*          MOVE P925-OD-DATE         TO DE-YYMMDD
648600*       ELSE
648700*          MOVE P925-OFFD-DATE       TO DE-YYMMDD
648800*       END-IF
648900*       PERFORM P8998-DATEEDIT
649000*       MOVE DE-CCYYMMDD             TO WS-RESPITE-TO-DATE-CENT
649100*       MOVE P925-RESPITE-TO-TIME    TO WS-RESPITE-TO-TIME
649200*    END-IF
649300     IF P925-RESPITE-FROM-TIME > SPACES
649400        AND P925-RESPITE-TO-TIME > SPACES
649500        SET DE-REFORMAT-ONLY         TO TRUE
649600        SET DE-YYMMDD-FORMAT         TO TRUE
649700        MOVE P920-RESPITE-FROM-DATE  TO DE-YYMMDD
649800        PERFORM P8998-DATEEDIT
649900        MOVE DE-CCYYMMDD             TO WS-RESPITE-FROM-DATE-CENT
650000        MOVE P925-RESPITE-FROM-TIME  TO WS-RESPITE-FROM-TIME
650100
650200        SET DE-REFORMAT-ONLY         TO TRUE
650300        SET DE-YYMMDD-FORMAT         TO TRUE
650400        MOVE P920-RESPITE-TO-DATE    TO DE-YYMMDD
650500        PERFORM P8998-DATEEDIT
650600        MOVE DE-CCYYMMDD             TO WS-RESPITE-TO-DATE-CENT
650700        MOVE P925-RESPITE-TO-TIME    TO WS-RESPITE-TO-TIME
650800     END-IF
650900*C969-END
651000
651100     INITIALIZE PS08-COMMAREA-PARMS
651200     IF P920-ADJ-TIE-UP-FUNCTION
651300        SET PS08-UPDATE-FUN          TO TRUE
651400
651500*       THE PREVIOUS OD DATE/TIME IS ADJUSTED FOR PREP/FINAL
651600*       IT WAS STORED IN THE EMPLOYE TIME ZONE AND NEEDS TO BE
651700*       CONVERTED TO THE ASSIGNMENT TIME ZONE.
651800
651900        IF WS-EMP-PREV-OD-DATE > SPACES
652000           MOVE SPACES                   TO TZ-PARAMETERS
652100           MOVE WS-EMP-TIME-ZONE         TO TZ-IN-ZONE
652200           MOVE P920-TIME-ZONE           TO TZ-OUT-ZONE
652300           MOVE WS-EMP-PREV-OD-DATE-TIME TO TZ-IN-DATE-TIME
652400           PERFORM P8996-TIMEZONE
652500           IF TZ-INVALID-PARAMETERS
652600              MOVE 'N1100TZ'             TO ERR-PARAGRAPH
652700              PERFORM P8996-TZERROR
652800           END-IF
652900           MOVE TZ-OUT-DATE              TO DE-YYMMDD
653000
653100           SET DE-REFORMAT-ONLY      TO TRUE
653200           SET DE-YYMMDD-FORMAT      TO TRUE
653300           PERFORM P8998-DATEEDIT
653400           MOVE DE-CCYYMMDD          TO PS08-PREV-OD-DATE-CENT
653500           MOVE TZ-OUT-TIME          TO PS08-PREV-OD-TIME
653600        END-IF
653700     ELSE
653800        SET PS08-INSERT-FUN          TO TRUE
653900     END-IF
654000
654100     MOVE P925-EMP-NO         TO PS08-EMP-NBR
654200     MOVE P920-TIME-ZONE      TO PS08-TIME-ZONE
654300     MOVE P925-OD-DATE-TIME   TO PS08-OD-DATE-TIME
654400     SET DE-YYMMDD-FORMAT     TO TRUE
654500     MOVE PS08-OD-DATE        TO DE-YYMMDD
654600     PERFORM P8998-DATEEDIT
654700     MOVE DE-CCYYMMDD         TO PS08-OD-DATE-CENT
654800
654900     MOVE PS08-OD-DATE-TIME-CENT
655000                              TO PS08-ORDER-DATE-TIME-CENT
655100     MOVE P925-OFFD-DATE-TIME TO PS08-OFFD-DATE-TIME
655200*CNC0600 - RJA - B
655300                                 WS-PROJ-RESET-BEGIN
655400* 04/26/2023 - PER QUOC, FOR ALL NON-DH TRAINS THE PROFILES ARE
655401*              SET UP SUCH THAT P920-TIME-ZONE = WS-EMP-TIME-ZONE;
655402*              THEREFORE, WS-PROJ-RESET-BEGIN WILL BE IN EMPLOYEE
655403*              TIME ZONE AS REQUIRED.
655410*CNC0600 - RJA - E
655500     SET DE-YYMMDD-FORMAT     TO TRUE
655600     MOVE PS08-OFFD-DATE      TO DE-YYMMDD
655700     PERFORM P8998-DATEEDIT
655800     MOVE DE-CCYYMMDD         TO PS08-OFFD-DATE-CENT
655900
656000     IF P920-ADJ-TIE-UP-FUNCTION
656100        MOVE P920-ASGN-HIST-KEY TO WORK-ASGN-HIST-KEY
656200     ELSE
656300        MOVE EMP-TRHIST-KEY     TO WORK-ASGN-HIST-KEY
656400     END-IF
656500     MOVE WORK-AH-DIST        TO PS08-DIST
656600     MOVE WORK-AH-SUB-DIST    TO PS08-SDIST
656700     MOVE WORK-AH-TRAIN-NO    TO PS08-TRAIN-ASGN
656800     MOVE WS-EMP-REST-STATUS  TO PS08-EMP-REST-STATUS
656900     IF P920-TIE-UP-CC > SPACES
657000        MOVE P920-TIE-UP-CC   TO PS08-CRAFT
657100     ELSE
657200        MOVE P920-ASGN-CC     TO PS08-CRAFT
657300     END-IF
657400*CNC0600 - RJA - B
657500     MOVE PS08-DIST           TO WS-PS08-DIST
657600     MOVE PS08-SDIST          TO WS-PS08-SDIST
657700     MOVE PS08-TRAIN-ASGN     TO WS-PS08-TRAIN-ASGN
657800     MOVE PS08-CRAFT          TO WS-PS08-CRAFT
657900     MOVE PS08-EMP-REST-STATUS TO WS-PS08-EMP-REST-STATUS
658000*CNC0600 - RJA - E
658100
658200     IF WS-RESPITE-FROM-DTTM IS NUMERIC
658300        AND WS-RESPITE-TO-DTTM IS NUMERIC
658400        AND WS-RESPITE-TO-DTTM > WS-RESPITE-FROM-DTTM
658500        MOVE WS-RESPITE-FROM-DTTM  TO
658600                                   PS08-RESPITE-FR-DATE-TIME-CENT
658700        MOVE WS-RESPITE-TO-DTTM    TO
658800                                   PS08-RESPITE-TO-DATE-TIME-CENT
658900     END-IF
659000
659100     MOVE P925-JOB-TYPE            TO PS08-JOB-TYPE
659200     MOVE P925-TERM                TO PS08-TERM
659300     MOVE P925-TIE-UP-SERVICE      TO PS08-TIE-UP-SERVICE
659400     MOVE WS-AHM-EFF-DATE-TIME     TO PS08-VIRT-ORDER-DATE-TIME
659500
659600     EXEC CICS LINK
659700               PROGRAM(PS08-PGM)
659800               COMMAREA(PS08-COMMAREA-PARMS)
659900               LENGTH(PS08-LGTH)
660000               RESP(WS-RESPONSE)
660100     END-EXEC
660200     MOVE WS-RESPONSE           TO FILE-STATUS
660300     IF NOT SUCCESS
660400        MOVE 'P2000-1'          TO ERR-PARAGRAPH
660500        PERFORM P9999-GOT-PROBLEM
660600     END-IF
660700     IF NOT PS08-NO-ERRORS
660800        MOVE 'P2000-2'          TO ERR-PARAGRAPH
660900        MOVE PS08-RETURN-ERRORS TO ERR-KEY
661000        MOVE 'CHECK S08 INPUT PARAMETERS'
661100                                TO ERR-SENTENCE
661200        PERFORM P9999-GOT-PROBLEM
661300     END-IF.
199800*CNLD-302 B COMMENTING
661400******************************************************************
661500* P2010-UPD-ETOD-IMPOSED-REST.
661600******************************************************************
661700**    IF THERE IS RESPITE THEN DETERMINE THE DATE
661800*
661900**C969-BEG
662000**    IF P925-RESPITE-FROM-TIME > SPACES
662100**       AND P925-RESPITE-TO-TIME > SPACES
662200**       SET DE-REFORMAT-ONLY         TO TRUE
662300**       SET DE-YYMMDD-FORMAT         TO TRUE
662400**       IF P925-OD-TIME > P925-RESPITE-FROM-TIME
662500**          MOVE P925-OFFD-DATE       TO DE-YYMMDD
662600**       ELSE
662700**          MOVE P925-OD-DATE         TO DE-YYMMDD
662800**       END-IF
662900**       PERFORM P8998-DATEEDIT
663000**       MOVE DE-CCYYMMDD          TO WS-RESPITE-FROM-DATE-CENT
663100**       MOVE P925-RESPITE-FROM-TIME  TO WS-RESPITE-FROM-TIME
663200**
663300**       SET DE-REFORMAT-ONLY         TO TRUE
663400**       SET DE-YYMMDD-FORMAT         TO TRUE
663500**       IF P925-RESPITE-TO-TIME > P925-OFFD-TIME
663600**          MOVE P925-OD-DATE         TO DE-YYMMDD
663700**       ELSE
663800**          MOVE P925-OFFD-DATE       TO DE-YYMMDD
663900**       END-IF
664000**       PERFORM P8998-DATEEDIT
664100**       MOVE DE-CCYYMMDD             TO WS-RESPITE-TO-DATE-CENT
664200**       MOVE P925-RESPITE-TO-TIME    TO WS-RESPITE-TO-TIME
664300**    END-IF
664400*
664500*     IF P925-RESPITE-FROM-TIME > SPACES
664600*        AND P925-RESPITE-TO-TIME > SPACES
664700*        SET DE-REFORMAT-ONLY         TO TRUE
664800*        SET DE-YYMMDD-FORMAT         TO TRUE
664900*        MOVE P920-RESPITE-FROM-DATE  TO DE-YYMMDD
665000*        PERFORM P8998-DATEEDIT
665100*        MOVE DE-CCYYMMDD           TO WS-RESPITE-FROM-DATE-CENT
665200*        MOVE P925-RESPITE-FROM-TIME  TO WS-RESPITE-FROM-TIME
665300*
665400*        SET DE-REFORMAT-ONLY         TO TRUE
665500*        SET DE-YYMMDD-FORMAT         TO TRUE
665600*        MOVE P920-RESPITE-TO-DATE    TO DE-YYMMDD
665700*        PERFORM P8998-DATEEDIT
665800*        MOVE DE-CCYYMMDD             TO WS-RESPITE-TO-DATE-CENT
665900*        MOVE P925-RESPITE-TO-TIME    TO WS-RESPITE-TO-TIME
666000*     END-IF
666100**C969-END
666200*     INITIALIZE PS08-COMMAREA-PARMS
666300*     SET PS08-IMPOSED-REST-FUN     TO TRUE
666400*
666500*     MOVE P925-EMP-NO              TO PS08-EMP-NBR
666600*     MOVE P925-MTOD-DATE-TIME      TO PS08-OD-DATE-TIME
666700*                                      PS08-ORDER-DATE-TIME
666800*     SET DE-YYMMDD-FORMAT          TO TRUE
666900*     MOVE PS08-OD-DATE             TO DE-YYMMDD
667000*     PERFORM P8998-DATEEDIT
667100*     MOVE DE-CCYYMMDD              TO PS08-OD-DATE-CENT
667200*                                      PS08-ORDER-DATE-CENT
667300*
667400*     MOVE PS08-OD-DATE-TIME-CENT   TO PS08-OFFD-DATE-TIME-CENT
667500*
667600*     IF P920-ADJ-TIE-UP-FUNCTION
667700*        MOVE P920-ASGN-HIST-KEY    TO WORK-ASGN-HIST-KEY
667800*     ELSE
667900*        MOVE EMP-TRHIST-KEY        TO WORK-ASGN-HIST-KEY
668000*     END-IF
668100*     MOVE WORK-AH-DIST             TO PS08-DIST
668200*     MOVE WORK-AH-SUB-DIST         TO PS08-SDIST
668300*     MOVE WORK-AH-TRAIN-NO         TO PS08-TRAIN-ASGN
668400*     MOVE WS-EMP-REST-STATUS       TO PS08-EMP-REST-STATUS
668500*     IF P920-TIE-UP-CC > SPACES
668600*        MOVE P920-TIE-UP-CC        TO PS08-CRAFT
668700*     ELSE
668800*        MOVE P920-ASGN-CC          TO PS08-CRAFT
668900*     END-IF
669000*
669100*     IF WS-RESPITE-FROM-DTTM IS NUMERIC
669200*        AND WS-RESPITE-TO-DTTM IS NUMERIC
669300*        AND WS-RESPITE-TO-DTTM > WS-RESPITE-FROM-DTTM
669400*        MOVE WS-RESPITE-FROM-DTTM  TO
669500*                                  PS08-RESPITE-FR-DATE-TIME-CENT
669600*        MOVE WS-RESPITE-TO-DTTM    TO
669700*                                  PS08-RESPITE-TO-DATE-TIME-CENT
669800*     END-IF
669900*
670000*     EXEC CICS LINK
670100*               PROGRAM(PS08-PGM)
670200*               COMMAREA(PS08-COMMAREA-PARMS)
670300*               LENGTH(PS08-LGTH)
670400*               RESP(WS-RESPONSE)
670500*     END-EXEC
670600*     MOVE WS-RESPONSE           TO FILE-STATUS
670700*     IF NOT SUCCESS
670800*        MOVE 'P2010-1'          TO ERR-PARAGRAPH
670900*        PERFORM P9999-GOT-PROBLEM
671000*     END-IF
671100*     IF NOT PS08-NO-ERRORS
671200*        MOVE 'P2010-2'          TO ERR-PARAGRAPH
671300*        MOVE PS08-RETURN-ERRORS TO ERR-KEY
671400*        MOVE 'CHECK S08 INPUT PARAMETERS'
671500*                                TO ERR-SENTENCE
671600*        PERFORM P9999-GOT-PROBLEM
671700*     END-IF
671800*     .
199800*CNLD-302 E
671900*
672000*CNC0600 - RJA - B
672100******************************************************************
672200 P2020-7DAY-RESET-BREAK-ELIG.
672300******************************************************************
672400**   NOTE: WE'RE NOT CHECKING RESET-BREAK ELIGIBILITY WHEN      **
672500**         EMPLOYEES TIE UP AT AWAY                             **
672600******************************************************************
672700     MOVE SPACES                TO WS-RESET-BREAK-ELIGIBLE-FL
672800
672900     MOVE P925-EMP-NO           TO MSTR3NBRK
673000     PERFORM P8560-READ-MSTR3
673100     IF NOT SUCCESS
673200        IF NOT NO-RECORD-FND
673300           MOVE 'P2020-1'       TO ERR-PARAGRAPH
673400           MOVE MSTR3NBRK       TO ERR-KEY
673500           PERFORM P9999-GOT-PROBLEM
673600        END-IF
673700     ELSE
673800        IF MSTR3-7DAY-END-PERIOD-CH > '0000000000'
673900
674000*             WS-PROJ-RESET-BEGIN = P925-OFFD-DATE-TIME
674100           IF WS-PROJ-RESET-BEGIN >= MSTR3-7DAY-END-PERIOD-CH
674200              SET RESET-BREAK-ELIGIBLE TO TRUE
674300           ELSE
674400*             OFF-DUTY TIME IS LESSER THAN MSTR3-7DAY-END-PERIOD,
674500*             CALCULATING THE DIFFERENCE.
674600              MOVE ZEROS               TO DATE-CONVERSION-PARMS
674700              SET PARM-DIFF            TO TRUE
674800              MOVE WS-PROJ-RESET-BEGIN-DT TO PARM-PRI-DATE-GREG
674900              MOVE WS-PROJ-RESET-BEGIN-TM TO PARM-PRI-HRMN
675000              MOVE MSTR3-7DAY-END-DATE TO PARM-SEC-DATE-GREG
675100              MOVE MSTR3-7DAY-END-TIME TO PARM-SEC-HRMN
675200              EXEC CICS LINK
675300                        PROGRAM(P903-PGM)
675400                        COMMAREA(DATE-CONVERSION-PARMS)
675500                        LENGTH(P903-LGTH)
675600                        RESP(WS-RESPONSE)
675700              END-EXEC
675800              MOVE WS-RESPONSE         TO FILE-STATUS
675900              IF NOT SUCCESS
676000                 MOVE 'P2020-2'        TO ERR-PARAGRAPH
676100                 MOVE 'P903'           TO ERR-KEY
676200                 PERFORM P9999-GOT-PROBLEM
676300              END-IF
676400
676500              EVALUATE TRUE
676600                 WHEN (PARM-RES-TOT-DAYS = 0 AND
676700                       PARM-RES-HRMN     < 1800)
676800*
676900** TO WORK ANOTHER JOB OF MIN. 6 HRS IN THE CURRENT 7-DAY WINDOW,
677000** EMPLOYEE MUST HAVE MIN. 18 HRS LEFT FROM THE OFFDUTY TIME:
677100*
677200** 12HRS MTOD@HOME(INCLUDES 2HR CALL LEAD TIME) + MIN. 6HRS WORK
677300*
677400** IF LESS THAN 18 HRS ARE LEFT, PUT THE EMP ON RESET-BREAK.
677500*
677600** THIS 18HR CHECK COVERS THE OTHER RESET REQUISITES IN SPEC I.E.,
677700*  -> IF OFFDUTY IS WITHIN 2 HRS FROM MSTR3-7DAY-END
677800*  -> IF OFFDUTY IS WITHIN 8 HRS FROM MSTR3-7DAY-END
677900*  -> IF OFFDUTY IS WITHIN <MTOD DURATION> FROM MSTR3-7DAY-END
678000
678100                      SET RESET-BREAK-ELIGIBLE TO TRUE
678200
701400* 5/30/2023 B CNC0600
678300*                WHEN PARM-RES-TOT-DAYS < 3
678400
678500** NOTE FROM THE BELOW EXAMPLE: IF DIFFERENCE IS LESS THAN 3 DAYS,
678600**                              IT'S DAY 5 OR 6 OR 7
678700*
678800*  DAY    DAY-START       MSTR3-7DAY-END  DIFFERENCE
678900*
679000*  DAY1   3/1/2023 9:00   3/8/2023 8:59   6 DAYS 23 HOUR 59 MINUTE
679100*  DAY2   3/2/2023 9:00   3/8/2023 8:59   5 DAYS 23 HOUR 59 MINUTE
679200*  DAY3   3/3/2023 9:00   3/8/2023 8:59   4 DAYS 23 HOUR 59 MINUTE
679300*  DAY4   3/4/2023 9:00   3/8/2023 8:59   3 DAYS 23 HOUR 59 MINUTE
679400*  DAY5   3/5/2023 9:00   3/8/2023 8:59   2 DAYS 23 HOUR 59 MINUTE
679500*  DAY6   3/6/2023 9:00   3/8/2023 8:59   1 DAYS 23 HOUR 59 MINUTE
679600*  DAY7   3/7/2023 9:00   3/8/2023 8:59   0 DAYS 23 HOUR 59 MINUTE
679700*
679800*                     CHECK IF MIN. 6 HRS ARE LEFT IN
679900*                     60HRS/7DAYS CLOCK ON DAY 5 OR 6 OR 7.
680000*                     IF NOT, THEY NEED A RESET-BREAK.
680100
678300                 WHEN OTHER
701400* 5/30/2023 E CNC0600
701400* 2/15/2024 B CNLD-311
679800*                     CHECK IF EMP EXCEEDED
679900*                     60HRS IN 60HRS/7DAYS CLOCK, OR
679900*                     192HRS IN 192HRS/28DAYS CLOCK.
680000*                     IF YES, THEY NEED A RESET-BREAK.
680200                      PERFORM P2025-CHECK-7DAY-TTOD
680300                      IF EXCEEDED-HRS
680400                         SET RESET-BREAK-ELIGIBLE TO TRUE
680500                      ELSE
680200                         PERFORM P2025B-CHECK-28DAY-TTOD
680300                         IF EXCEEDED-HRS
680400                            SET RESET-BREAK-ELIGIBLE TO TRUE
680500                         END-IF
680500                      END-IF
701400* 2/15/2024 E CNLD-311
680600              END-EVALUATE
680700           END-IF
680800        END-IF
680900     END-IF
681000     .
701400* 2/15/2024 B CNLD-311
681000******************************************************************
681100 P2025-CHECK-7DAY-TTOD.
681200******************************************************************
681300     MOVE SPACES                        TO WS-CHECK-HRS-FL
681400
681500     INITIALIZE PS08-COMMAREA-PARMS
681600     SET  PS08-INQUIRY-FUN              TO TRUE
681700     MOVE P925-EMP-NO                   TO PS08-EMP-NBR
681800     MOVE 7                             TO PS08-CALC-NBR-DAYS
681900
682000*    WS-PROJ-RESET-BEGIN = P925-OFFD-DATE-TIME
682100     MOVE WS-PROJ-RESET-BEGIN-DT        TO DE-YYMMDD
682200     SET DE-YYMMDD-FORMAT               TO TRUE
682300     PERFORM P8998-DATEEDIT
682400     MOVE DE-CCYYMMDD                   TO PS08-CALC-DATE-CENT
682500     MOVE WS-PROJ-RESET-BEGIN-TM        TO PS08-CALC-TIME
682600
682900     EXEC CICS LINK
683000               PROGRAM(PS08-PGM)
683100               COMMAREA(PS08-COMMAREA-PARMS)
683200               LENGTH(PS08-LGTH)
683300               RESP(WS-RESPONSE)
683400     END-EXEC
683500     MOVE WS-RESPONSE                   TO FILE-STATUS
683600     IF NOT SUCCESS
683700        MOVE 'P2025-1'                  TO ERR-PARAGRAPH
683800        MOVE 'PS08LINK'                 TO ERR-KEY
683900        PERFORM P9999-GOT-PROBLEM
684000     END-IF
684100     IF NOT PS08-NO-ERRORS
684200        MOVE 'P2025-2'                  TO ERR-PARAGRAPH
684300        MOVE PS08-RETURN-ERRORS         TO ERR-KEY
684400        MOVE 'CHECK S08 INPUT PARAMETERS'
684500                                        TO ERR-SENTENCE
684600        PERFORM P9999-GOT-PROBLEM
684700     END-IF
684800     IF PS08-TOTAL-TIME-ON-DUTY > 6000
684900*        7-DAY-TTOD > 60 HRS
685000        SET EXCEEDED-HRS TO TRUE
685100     END-IF
685100     .
681000******************************************************************
681100 P2025B-CHECK-28DAY-TTOD.
681200******************************************************************
681300     MOVE SPACES                        TO WS-CHECK-HRS-FL
681400
681500     INITIALIZE PS08-COMMAREA-PARMS
681600     SET  PS08-INQUIRY-FUN              TO TRUE
681700     MOVE P925-EMP-NO                   TO PS08-EMP-NBR
681800     MOVE 28                            TO PS08-CALC-NBR-DAYS
681900
682000*    WS-PROJ-RESET-BEGIN = P925-OFFD-DATE-TIME
682100     MOVE WS-PROJ-RESET-BEGIN-DT        TO DE-YYMMDD
682200     SET DE-YYMMDD-FORMAT               TO TRUE
682300     PERFORM P8998-DATEEDIT
682400     MOVE DE-CCYYMMDD                   TO PS08-CALC-DATE-CENT
682500     MOVE WS-PROJ-RESET-BEGIN-TM        TO PS08-CALC-TIME
682600
682900     EXEC CICS LINK
683000               PROGRAM(PS08-PGM)
683100               COMMAREA(PS08-COMMAREA-PARMS)
683200               LENGTH(PS08-LGTH)
683300               RESP(WS-RESPONSE)
683400     END-EXEC
683500     MOVE WS-RESPONSE                   TO FILE-STATUS
683600     IF NOT SUCCESS
683700        MOVE 'P2025B-1'                 TO ERR-PARAGRAPH
683800        MOVE 'PS08LINK'                 TO ERR-KEY
683900        PERFORM P9999-GOT-PROBLEM
684000     END-IF
684100     IF NOT PS08-NO-ERRORS
684200        MOVE 'P2025B-2'                 TO ERR-PARAGRAPH
684300        MOVE PS08-RETURN-ERRORS         TO ERR-KEY
684400        MOVE 'CHECK S08 INPUT PARAMETERS'
684500                                        TO ERR-SENTENCE
684600        PERFORM P9999-GOT-PROBLEM
684700     END-IF
684800     IF PS08-TOTAL-TIME-ON-DUTY > 19200
684900*       28-DAY-TTOD > 192HRS
685000        SET EXCEEDED-HRS TO TRUE
685100     END-IF
685100     .
701400* 2/15/2024 E CNLD-311
685200******************************************************************
685300 P2030-COMPUTE-RESET-BREAK.
685400******************************************************************
685500*    WS-PROJ-RESET-BEGIN = P925-OFFD-DATE-TIME
685600     MOVE WS-PROJ-RESET-BEGIN-DT  TO WS-DAY1-DATE
685700     MOVE WS-PROJ-RESET-BEGIN-TM  TO WS-DAY1-TIME
685800
685900     MOVE ZEROS                   TO DATE-CONVERSION-PARMS
686000     SET PARM-ADD                 TO TRUE
686100     MOVE WS-DAY1-DATE            TO PARM-PRI-DATE-GREG
686200     MOVE 01                      TO PARM-SEC-GREG-DAY
686300     EXEC CICS LINK
686400               PROGRAM(P903-PGM)
686500               COMMAREA(DATE-CONVERSION-PARMS)
686600               LENGTH(P903-LGTH)
686700               RESP(WS-RESPONSE)
686800     END-EXEC
686900     MOVE WS-RESPONSE             TO FILE-STATUS
687000     IF NOT SUCCESS
687100        MOVE 'P2030-1'            TO ERR-PARAGRAPH
687200        MOVE 'P903LINK'           TO ERR-KEY
687300        PERFORM P9999-GOT-PROBLEM
687400     END-IF
687500     MOVE PARM-RES-DATE-GREG      TO WS-DAY2-DATE
687600
687700     MOVE ZEROS                   TO DATE-CONVERSION-PARMS
687800     SET PARM-ADD                 TO TRUE
687900     MOVE WS-DAY1-DATE            TO PARM-PRI-DATE-GREG
688000     MOVE 02                      TO PARM-SEC-GREG-DAY
688100     EXEC CICS LINK
688200               PROGRAM(P903-PGM)
688300               COMMAREA(DATE-CONVERSION-PARMS)
688400               LENGTH(P903-LGTH)
688500               RESP(WS-RESPONSE)
688600     END-EXEC
688700     MOVE WS-RESPONSE             TO FILE-STATUS
688800     IF NOT SUCCESS
688900        MOVE 'P2030-2'            TO ERR-PARAGRAPH
689000        MOVE 'P903LINK'           TO ERR-KEY
689100        PERFORM P9999-GOT-PROBLEM
689200     END-IF
689300     MOVE PARM-RES-DATE-GREG      TO WS-DAY3-DATE
689400
689500     IF WS-DAY1-TIME >= 2200 AND WS-DAY1-TIME <= 2359
689600        MOVE ZEROS                   TO DATE-CONVERSION-PARMS
689700        SET PARM-ADD                 TO TRUE
689800        MOVE WS-DAY1-DATE            TO PARM-PRI-DATE-GREG
689900        MOVE WS-DAY1-TIME            TO PARM-PRI-HRMN
015310*CNLD-304 B
111600*       MOVE 3200                 TO PARM-SEC-HRMN
111600        MOVE 3159                 TO PARM-SEC-HRMN
015310*CNLD-304 E
690100        EXEC CICS LINK
690200                  PROGRAM(P903-PGM)
690300                  COMMAREA(DATE-CONVERSION-PARMS)
690400                  LENGTH(P903-LGTH)
690500                  RESP(WS-RESPONSE)
690600        END-EXEC
690700        MOVE WS-RESPONSE             TO FILE-STATUS
690800        IF NOT SUCCESS
690900           MOVE 'P2030-3'            TO ERR-PARAGRAPH
691000           MOVE 'P903LINK'           TO ERR-KEY
691100           PERFORM P9999-GOT-PROBLEM
691200        END-IF
691300        MOVE PARM-RES-DATE-GREG      TO WS-UPD-PROJ-RESET-DATE
691400        MOVE PARM-RES-HRMN           TO WS-UPD-PROJ-RESET-TIME
691500        MOVE WS-DAY1-DATE            TO WS-UPD-PROJ-UD1-FROM-DATE
691600        MOVE WS-DAY1-TIME            TO WS-UPD-PROJ-UD1-FROM-TIME
691700        MOVE WS-DAY2-DATE            TO WS-UPD-PROJ-UD1-TO-DATE
691800        MOVE '0800'                  TO WS-UPD-PROJ-UD1-TO-TIME
691900        MOVE WS-DAY2-DATE            TO WS-UPD-PROJ-UD2-FROM-DATE
692000        MOVE '2200'                  TO WS-UPD-PROJ-UD2-FROM-TIME
692100        MOVE WS-DAY3-DATE            TO WS-UPD-PROJ-UD2-TO-DATE
692200        MOVE '0559'                  TO WS-UPD-PROJ-UD2-TO-TIME
692300     ELSE
692400        IF WS-DAY1-TIME = 0000
692500           MOVE WS-DAY2-DATE         TO WS-UPD-PROJ-RESET-DATE
114000*CNLD-259 B CNC0600
114000*          RESET DURATION WILL BE LESS THAN THE REQUIRED MINIMUM
114000*          OF 32 HOURS IN THIS CASE; WILL BE 31H 59M.
692600*          MOVE '0800'               TO WS-UPD-PROJ-RESET-TIME
692600           MOVE '0759'               TO WS-UPD-PROJ-RESET-TIME
114000*CNLD-259 E CNC0600
692700           MOVE WS-DAY1-DATE         TO WS-UPD-PROJ-UD1-FROM-DATE
692800                                        WS-UPD-PROJ-UD1-TO-DATE
692900                                        WS-UPD-PROJ-UD2-FROM-DATE
693000           MOVE '0000'               TO WS-UPD-PROJ-UD1-FROM-TIME
693100           MOVE '0800'               TO WS-UPD-PROJ-UD1-TO-TIME
693200           MOVE '2200'               TO WS-UPD-PROJ-UD2-FROM-TIME
693300           MOVE WS-DAY2-DATE         TO WS-UPD-PROJ-UD2-TO-DATE
693400           MOVE '0559'               TO WS-UPD-PROJ-UD2-TO-TIME
693500        ELSE
693600           MOVE WS-DAY3-DATE         TO WS-UPD-PROJ-RESET-DATE
693700           MOVE '0559'               TO WS-UPD-PROJ-RESET-TIME
693800           MOVE WS-DAY1-DATE         TO WS-UPD-PROJ-UD1-FROM-DATE
693900           MOVE '2200'               TO WS-UPD-PROJ-UD1-FROM-TIME
694000           MOVE WS-DAY2-DATE         TO WS-UPD-PROJ-UD1-TO-DATE
694100           MOVE '0800'               TO WS-UPD-PROJ-UD1-TO-TIME
694200           MOVE WS-DAY2-DATE         TO WS-UPD-PROJ-UD2-FROM-DATE
694300           MOVE '2200'               TO WS-UPD-PROJ-UD2-FROM-TIME
694400           MOVE WS-DAY3-DATE         TO WS-UPD-PROJ-UD2-TO-DATE
694500           MOVE '0559'               TO WS-UPD-PROJ-UD2-TO-TIME
694600        END-IF
694700     END-IF
694800
694800* CNLD-328 B
694900
695100*    IF WS-UPD-PROJ-RESET-BRK-CH > MSTR3-PROJ-RESET-BRK-CH
695200*       MOVE WS-UPD-PROJ-RESET-BRK-CH
695300*                                    TO MSTR3-PROJ-RESET-BRK-CH
695400*       MOVE WS-UPD-PROJ-UD1-FROM
695500*                                    TO MSTR3-PROJ-UD1-FROM
695600*       MOVE WS-UPD-PROJ-UD1-TO
695700*                                    TO MSTR3-PROJ-UD1-TO
695800*       MOVE WS-UPD-PROJ-UD2-FROM
695900*                                    TO MSTR3-PROJ-UD2-FROM
696000*       MOVE WS-UPD-PROJ-UD2-TO
696100*                                    TO MSTR3-PROJ-UD2-TO
696200*    ELSE
696300*       MOVE MSTR3-PROJ-RESET-BRK-CH
696400*                                    TO WS-UPD-PROJ-RESET-BRK-CH
696500*       MOVE MSTR3-PROJ-UD1-FROM
696600*                                    TO WS-UPD-PROJ-UD1-FROM
696700*       MOVE MSTR3-PROJ-UD1-TO
696800*                                    TO WS-UPD-PROJ-UD1-TO
696900*       MOVE MSTR3-PROJ-UD2-FROM
697000*                                    TO WS-UPD-PROJ-UD2-FROM
697100*       MOVE MSTR3-PROJ-UD2-TO
697200*                                    TO WS-UPD-PROJ-UD2-TO
697300*    END-IF
694900
697300     IF P920-ADJ-TIE-UP-FUNCTION
695000
695100        IF WS-UPD-PROJ-RESET-BRK-CH >= MSTR3-PROJ-RESET-BRK-CH
695200           MOVE WS-UPD-PROJ-RESET-BRK-CH
695300                                     TO MSTR3-PROJ-RESET-BRK-CH
695400           MOVE WS-UPD-PROJ-UD1-FROM
695500                                     TO MSTR3-PROJ-UD1-FROM
695600           MOVE WS-UPD-PROJ-UD1-TO
695700                                     TO MSTR3-PROJ-UD1-TO
695800           MOVE WS-UPD-PROJ-UD2-FROM
695900                                     TO MSTR3-PROJ-UD2-FROM
696000           MOVE WS-UPD-PROJ-UD2-TO
696100                                     TO MSTR3-PROJ-UD2-TO
696200        ELSE
695000
694900*          THE TRIP BEING ADJUSTED MAY NOT BE THE MOST RECENT ONE.
694900*          SO, DO NOT OVERRIDE MSTR3-PROJ-RESET-BRK-CH IF IT
695000*          ALREADY HAS A GREATER VALUE.
695000
696300           MOVE MSTR3-PROJ-RESET-BRK-CH
696400                                     TO WS-UPD-PROJ-RESET-BRK-CH
696500           MOVE MSTR3-PROJ-UD1-FROM
696600                                     TO WS-UPD-PROJ-UD1-FROM
696700           MOVE MSTR3-PROJ-UD1-TO
696800                                     TO WS-UPD-PROJ-UD1-TO
696900           MOVE MSTR3-PROJ-UD2-FROM
697000                                     TO WS-UPD-PROJ-UD2-FROM
697100           MOVE MSTR3-PROJ-UD2-TO
697200                                     TO WS-UPD-PROJ-UD2-TO
697300        END-IF
695000
697300     ELSE
695000
695200        MOVE WS-UPD-PROJ-RESET-BRK-CH
695300                                     TO MSTR3-PROJ-RESET-BRK-CH
695400        MOVE WS-UPD-PROJ-UD1-FROM
695500                                     TO MSTR3-PROJ-UD1-FROM
695600        MOVE WS-UPD-PROJ-UD1-TO
695700                                     TO MSTR3-PROJ-UD1-TO
695800        MOVE WS-UPD-PROJ-UD2-FROM
695900                                     TO MSTR3-PROJ-UD2-FROM
696000        MOVE WS-UPD-PROJ-UD2-TO
696100                                     TO MSTR3-PROJ-UD2-TO
695000
697300     END-IF
694800* CNLD-328 E
697400
697500* NOTE: 1. MSTR3-PREV-7DAY-END SHOULD BE SPACED ONLY AT TIE-UP
697600*          OR TIE-UP EQUIVALENT ACTIVITY.
697700*       2. ON THE FIRST CALL AFTER A NATURAL RESET BREAK,
697800*          MSTR3-7DAY-END IS MOVED TO MSTR3-PREV-7DAY-END.
697900*          THEN, NEW MSTR3-7DAY-END IS COMPUTED.
698000*       3. MSTR3-PREV-7DAY-END IS USED TO RESTORE MSTR3-7DAY-END
698100*          WHEN THE FIRST CALL AFTER A NATURAL RESET BREAK
698200*          IS CANCELED WITH CC/RL.
698300     MOVE SPACES                     TO MSTR3-PREV-7DAY-END-CH
698400     .
698500******************************************************************
698600 P2040-DEL-RESET-BREAK-ETOD.
698700******************************************************************
698800     MOVE SPACES                     TO WS-EMP-TOD
698900     MOVE MSTR3-EMP-NBR              TO EMPTOD-EMP-NBR
699000     MOVE MSTR3-PROJ-RESET-DATE      TO DE-YYMMDD
699100     SET DE-REFORMAT-ONLY            TO TRUE
699200     SET DE-YYMMDD-FORMAT            TO TRUE
699300     PERFORM P8998-DATEEDIT
699400     MOVE DE-CCYYMMDD                TO EMPTOD-OD-DATE-CENT
699500     MOVE MSTR3-PROJ-RESET-TIME      TO EMPTOD-OD-TIME
699600     MOVE EMPTOD-KEY-AREA            TO EMPTOD-EMPKEY
699700
699800     PERFORM P8070-READ-EMPTOD
699900     IF SUCCESS
700000        PERFORM P8080-DELETE-EMPTOD
700100     END-IF.
700200******************************************************************
700300 P2050-WRITE-RESET-VOID-HIST.
700400******************************************************************
700500     MOVE SPACES                   TO P943-COMMAREA-PARMS
700600     MOVE EMP-NBR OF WS-MSTR       TO P943-EMP-NBR
700700     SET P943-RESET-VOID-FUN       TO TRUE
700800     STRING '7-DAY END TM CHANGED '
700900            'FROM ' WS-VOIDED-7DAY-END
701000            ' TO ' WS-RESTORED-7DAY-END
701100               DELIMITED BY SIZE INTO P943-FUN32-COMMENTS
701200     MOVE DIST OF WS-MSTR          TO P943-DIST
701300     MOVE SUB-DIST OF WS-MSTR      TO P943-SDIST
701400* 5/27/2023 - B - RESET-VOID/REVERSE HIST EFF TIME IN EMP TZ
701400*
701400*    MOVE P920-TIME-ZONE           TO P943-EMP-TIME-ZONE
701500*    MOVE WS-SYSTEM-DATE           TO P943-E-DATE
701600*    MOVE WS-SYSTEM-TIME           TO P943-E-TOD
701600*
221700     IF WS-EMP-TIME-ZONE = P920-TIME-ZONE
221700        MOVE P920-CAN-DATE-TIME    TO P943-EFF-DATE-TIME
221700     ELSE
293100        MOVE SPACES                TO TZ-PARAMETERS
293200        MOVE P920-TIME-ZONE        TO TZ-IN-ZONE
293300        MOVE WS-EMP-TIME-ZONE      TO TZ-OUT-ZONE
293400        MOVE P920-CAN-DATE-TIME    TO TZ-IN-DATE-TIME
293500        PERFORM P8996-TIMEZONE
293600        IF TZ-INVALID-PARAMETERS
293700           MOVE 'P2050TZ'          TO ERR-PARAGRAPH
293800           PERFORM P8996-TZERROR
293900        END-IF
294000        MOVE TZ-OUT-DATE-TIME      TO P943-EFF-DATE-TIME
221700     END-IF
701400* 5/27/2023 - E
701700     PERFORM P8900-WRITE-HISTORY.
701800******************************************************************
701900 P2060-WRITE-RESET-BRK-HIST.
702000******************************************************************
702100     PERFORM VARYING I FROM 1 BY 1
702200     UNTIL I > 3
702300        MOVE SPACES                TO P943-COMMAREA-PARMS
702400        IF I = 1
702500           STRING 'SYSTEM FORCED RESET BREAK END: '
702600           WS-UPD-PROJ-RESET-BRK-CH DELIMITED
702700           BY SIZE INTO P943-FUN27-COMMENTS
702800        END-IF
702900        IF I = 2
703000           STRING 'UNDISTURB-1: ' WS-UPD-PROJ-UD1-FROM
703100           ' TO ' WS-UPD-PROJ-UD1-TO   DELIMITED
703200           BY SIZE INTO P943-FUN27-COMMENTS
703300        END-IF
703400        IF I = 3
703500           STRING 'UNDISTURB-2: ' WS-UPD-PROJ-UD2-FROM
703600           ' TO ' WS-UPD-PROJ-UD2-TO   DELIMITED
703700           BY SIZE INTO P943-FUN27-COMMENTS
703800        END-IF
703900        MOVE EMP-NBR OF WS-MSTR    TO P943-EMP-NBR
704000        SET P943-RESET-BREAK-FUN   TO TRUE
704100        MOVE DIST OF WS-MSTR       TO P943-DIST
704200        MOVE SUB-DIST OF WS-MSTR   TO P943-SDIST
701400* 5/27/2023 B - WRITE RESET BRK HISTORY EFF TIME IN EMP TZ ALWAYS
704300*       MOVE P920-TIME-ZONE        TO P943-EMP-TIME-ZONE
704400*       MOVE WS-SYSTEM-DATE        TO P943-E-DATE
704500*       MOVE WS-SYSTEM-TIME        TO P943-E-TOD
221700        MOVE WS-PROJ-RESET-BEGIN   TO P943-EFF-DATE-TIME
701400* 5/27/2023 E
704600        PERFORM P8900-WRITE-HISTORY
704700     END-PERFORM.
704800******************************************************************
704900 P2070-WRITE-ETOD-RESET-BREAK.
705000******************************************************************
705100     INITIALIZE PS08-COMMAREA-PARMS
705200     SET PS08-RESET-BREAK-FUN      TO TRUE
705200* CNLD-219 B
705200     SET PS08-RESET-BREAK-SYS      TO TRUE
705200* CNLD-219 E
705300
705400     MOVE EMP-NBR OF WS-MSTR       TO PS08-EMP-NBR
705500     MOVE MSTR3-SYSTEM-RESET-BRK   TO PS08-OD-DATE-TIME
705600                                      PS08-ORDER-DATE-TIME
705700     SET DE-YYMMDD-FORMAT          TO TRUE
705800     MOVE PS08-OD-DATE             TO DE-YYMMDD
705900     PERFORM P8998-DATEEDIT
706000     MOVE DE-CCYYMMDD              TO PS08-OD-DATE-CENT
706100                                      PS08-ORDER-DATE-CENT
706200
706300     MOVE PS08-OD-DATE-TIME-CENT   TO PS08-OFFD-DATE-TIME-CENT
706400     MOVE WS-PS08-DIST             TO PS08-DIST
706500     MOVE WS-PS08-SDIST            TO PS08-SDIST
706600     MOVE WS-PS08-TRAIN-ASGN       TO PS08-TRAIN-ASGN
706700     MOVE WS-PS08-EMP-REST-STATUS  TO PS08-EMP-REST-STATUS
706800     MOVE WS-PS08-CRAFT            TO PS08-CRAFT
706900
707000     EXEC CICS LINK
707100               PROGRAM(PS08-PGM)
707200               COMMAREA(PS08-COMMAREA-PARMS)
707300               LENGTH(PS08-LGTH)
707400               RESP(WS-RESPONSE)
707500     END-EXEC
707600     MOVE WS-RESPONSE           TO FILE-STATUS
707700     IF NOT SUCCESS
707800        MOVE 'P2070-1'          TO ERR-PARAGRAPH
707900        PERFORM P9999-GOT-PROBLEM
708000     END-IF
708100     IF NOT PS08-NO-ERRORS
708200        MOVE 'P2070-2'          TO ERR-PARAGRAPH
708300        MOVE PS08-RETURN-ERRORS TO ERR-KEY
708400        MOVE 'CHECK S08 INPUT PARAMETERS'
708500                                TO ERR-SENTENCE
708600        PERFORM P9999-GOT-PROBLEM
708700     END-IF.
708800******************************************************************
708900 P2080-E95-LAYOFF.
709000******************************************************************
709100     MOVE SPACES                        TO P917-COMMAREA-PARMS
709200     MOVE EMP-NBR OF WS-MSTR            TO P917-EMP-NO
709300     MOVE 'E'                           TO P917-STATUS-CODE
709400     MOVE '95'                          TO P917-EDB-CODE
709500     MOVE 'P920'                        TO P917-SUPV-INIT
709600     MOVE WS-EMP-TIME-ZONE              TO P917-TIME-ZONE
709700*    WS-PROJ-RESET-BEGIN IS POPULATED WITH P925-OFFD-DATE-TIME;
709800*    P925-OFFD-DATE-TIME WOULD BE IN EMPLOYEE TIMEZONE
709900     MOVE WS-PROJ-RESET-BEGIN-DT        TO P917-EFF-DATE
710000     MOVE WS-PROJ-RESET-BEGIN-TM        TO P917-EFF-TIME
015310*CNLD-259 B CNC0600
710100*    MOVE MSTR3-SYSTEM-RESET-DATE       TO P917-EXP-DATE
710200*    MOVE MSTR3-SYSTEM-RESET-TIME       TO P917-EXP-TIME
136600     MOVE MSTR3-SYSTEM-UD2-TO-DATE      TO P917-EXP-DATE
136700     MOVE MSTR3-SYSTEM-UD2-TO-TIME      TO P917-EXP-TIME
015310*CNLD-259 E
710300*
710400     EXEC CICS LINK
710500               PROGRAM(P917-PGM)
710600               COMMAREA(P917-COMMAREA-PARMS)
710700               LENGTH(P917-LGTH)
710800               RESP(WS-RESPONSE)
710900     END-EXEC
711000     MOVE WS-RESPONSE TO FILE-STATUS
711100     IF NOT SUCCESS
711200        MOVE 'P2080-1' TO ERR-PARAGRAPH
711300        PERFORM P9999-GOT-PROBLEM
711400     END-IF
711500     IF P917-ERROR-FOUND
711600        MOVE 'P2080-2' TO ERR-PARAGRAPH
711700        STRING P917-EMP-NO ' '
711800               P917-EFF-DATE-TIME
711900               P917-EXP-DATE-TIME
712000          DELIMITED BY SIZE  INTO ERR-SENTENCE
712100        STRING P917-ERRORCODE     DELIMITED BY SIZE
712200               ' '                DELIMITED BY SIZE
712300               P917-ERRORMSG      DELIMITED BY SIZE
712400                             INTO ERR-KEY
712500        PERFORM P9999-GOT-PROBLEM
712600     END-IF.
712700*
712800*CNC0600 - RJA - E
712900*
713000*=================================================================
713100 P4000-SEEK-TASK-FOR-NOT-NTFY.
713200*=================================================================
713300*    SEE IF EMPLOYEE HAS A NOT-NOTIFIED OR A NOT-NOTIFIED-AWARD
713400*    BEFORE YOU CHANGE LAYOFF-CODE-2 BACK TO A '0'
713500*
713600     MOVE SPACES              TO WS-TASK
713700                                 TASKEMPK
713800                                 TASK-DONE-FL
713900     MOVE EMP-NBR OF WS-MSTR  TO EMP-NBR OF WS-TASK
714000     MOVE 'N'                    TO TASK-TYPE
714100     MOVE TASK-EMPLOYEE-KEY      TO TASKEMPK
714200     EXEC CICS STARTBR
714300               DATASET(TASK-VIA-EMP-NBR)
714400               RIDFLD(TASKEMPK)
714500               KEYLENGTH(TASKENBR-KLGTH)
714600               RESP(WS-RESPONSE)
714700     END-EXEC
714800     PERFORM UNTIL TASK-DONE
714900        EXEC CICS READNEXT
715000                  DATASET(TASK-VIA-EMP-NBR)
715100                  INTO(WS-TASK)
715200                  LENGTH(TASKENBR-RLGTH)
715300                  RIDFLD(TASKEMPK)
715400                  KEYLENGTH(TASKENBR-KLGTH)
715500                  RESP(WS-RESPONSE)
715600        END-EXEC
715700        MOVE WS-RESPONSE TO FILE-STATUS
715800        IF SUCCESS
715900           IF TASK-NOTIFY
716000           AND EMP-NBR OF WS-TASK = EMP-NBR OF WS-MSTR
716100              IF TASK-NOTIFY-AWARD
716200                 SET AWARD-NTFY-FOUND    TO TRUE
716300              ELSE
716400*                CHECK FOR IEN-BULL-MSTR HERE
716500                 IF TASK-IER-TS-KEY > SPACES
716600                    INITIALIZE WS-IEN-TABLE
716700                    MOVE EMP-NBR OF WS-MSTR TO IEN-EMP-NBR
716800                    MOVE TASK-IER-TS-KEY TO IEN-TS
716900                    PERFORM PSQL-IENSEL01
717000                    IF SQL-SUCCESS
717100                       IF IEN-BULL-MSTR NOT > SPACES
717200                          SET REG-NTFY-FOUND TO TRUE
717300                       END-IF
717400                    ELSE
717500                       SET REG-NTFY-FOUND TO TRUE
717600                    END-IF
717700                 ELSE
717800                    SET REG-NTFY-FOUND  TO TRUE
717900                 END-IF
718000              END-IF
718100           ELSE
718200              SET TASK-DONE             TO TRUE
718300           END-IF
718400        ELSE
718500           SET TASK-DONE                TO TRUE
718600        END-IF
718700     END-PERFORM
718800     EXEC CICS ENDBR
718900               DATASET(TASK-VIA-EMP-NBR)
719000               RESP(WS-RESPONSE)
719100     END-EXEC
719200     .
719300******************************************************************
719400*
719500 P7000-COUNT-US-STEP-RATE-TRIPS.
719600*    US EMPLOYEE STEP RATES ARE MADE EFFECTIVE BASED ON
719700*    AN ANNIVERSARY DATE AND ON COMPLETING 80 TRIPS.  HERE,
719800*    WE ARE COUNTING TRIPS FOR THE NEXT STEP RATE TO BECOME
719900*    EFFECTIVE.  IT IS IDENTIFIED AS THE SECOND NON-EXPIRING RATE.
720000*                                                           CW0397
720100     MOVE ZERO TO SUB1
720200     PERFORM VARYING US-NDX FROM +1 BY +1
720300        UNTIL US-NDX > DOS-ARRAY-MAX
720400        IF WS-US-QUAL-DATE(US-NDX) = '999999'
720500           SET SUB1 TO US-NDX
720600           ADD +1 TO SUB1
720700           SET US-NDX TO DOS-ARRAY-MAX
720800        END-IF
720900     END-PERFORM
721000
721100     IF SUB1 > ZERO
721200        AND SUB1 <= DOS-ARRAY-MAX
721300        AND WS-US-QUAL-DATE(SUB1) = '999999'
721400        MOVE SPACES                  TO P931-COMMAREA-PARMS
721500        SET P931-TRIP-ADD-FUN        TO TRUE
721600        MOVE EMP-NBR OF WS-MSTR      TO P931-TRIP-ADD-EMP-NO
721700        MOVE WS-US-QUALIFICATION(SUB1) TO P931-TRIP-ADD-QUAL-CODE
721800        MOVE WS-QUAL-ON-DUTY-DATE TO P931-TRIP-ADD-QUAL-DATE
721900        MOVE WS-QUAL-ON-DUTY-TIME TO P931-TRIP-ADD-QUAL-TIME
722000        MOVE WS-AHMKEY               TO P931-TRIP-ADD-XREF-KEY
722100        SET P931-TRIP-ADD-XREF-AHM TO TRUE
722200        PERFORM P9100-LINK-TO-931
722300     END-IF
722400     .
722500*
722600 P7100-TABLE-US-STEP-RATES.
722700*                                                           CW0397
722800     MOVE SPACES TO WS-US-STEP-RATE-TABLE
722900     SET US-NDX TO +1
723000     PERFORM VARYING DOS-SUB FROM +1 BY +1
723100        UNTIL DOS-SUB > DOS-ARRAY-MAX
723200        MOVE SPACES              TO QUALEMP-KEY
723300        MOVE EMP-NBR OF WS-MSTR  TO QUAL-EMP-NO
723400        MOVE DOS-QUAL(DOS-SUB)   TO QUALIFICATION
723500        MOVE QUALEMP-KEY         TO QUAL-QUALEMP-KEY
723600        PERFORM P8100-READ-QUAL
723700        IF SUCCESS
723800           OR NO-RECORD-FND
723900           CONTINUE
724000        ELSE
724100           MOVE 'P7100-1'        TO ERR-PARAGRAPH
724200           MOVE QUAL-QUALEMP-KEY TO ERR-KEY
724300           PERFORM P9999-GOT-PROBLEM
724400        END-IF
724500        IF SUCCESS
724600           MOVE QUALIFICATION TO WS-US-QUALIFICATION(US-NDX)
724700           MOVE QUAL-DATE TO WS-US-QUAL-DATE(US-NDX)
724800           SET US-NDX UP BY +1
724900        END-IF
725000     END-PERFORM
725100     .
725200*
725300******************************************************************
725400 P8000-UPDATE-MSTR-DIST-SDIST.
725500******************************************************************
725600     MOVE SPACES         TO P918-COMMAREA-PARMS
725700     MOVE EMP-NBR  OF WS-MSTR TO P918-EMP-NO
725800     IF TEMPORARY-ASGNMT > SPACE
725900        MOVE TA-DIST     TO P918-DIST
726000        MOVE TA-SUB-DIST TO P918-SUB-DIST
726100     ELSE
726200        MOVE NA-DIST     TO P918-DIST
726300        MOVE NA-SUB-DIST TO P918-SUB-DIST
726400     END-IF
726500     MOVE CRAFT OF WS-MSTR TO P918-OLD-CC
726600     EXEC CICS LINK
726700               PROGRAM(P918-PGM)
726800               COMMAREA(P918-COMMAREA-PARMS)
726900               LENGTH(P918-LGTH)
727000               RESP(WS-RESPONSE)
727100     END-EXEC
727200     MOVE WS-RESPONSE TO FILE-STATUS
727300     IF NOT SUCCESS
727400        MOVE 'P8000-1' TO ERR-PARAGRAPH
727500        PERFORM P9999-GOT-PROBLEM
727600     END-IF.
727700*
727800******************************************************************
727900 P8010-PUT-TURN-ON-XBRD.
728000******************************************************************
728100     MOVE SPACES TO P914-COMMAREA-PARMS
728200     IF TEMP-ASGN-XB
728300        MOVE TA-DIST               TO P914-TURN-DIST
728400        MOVE TA-SUB-DIST           TO P914-TURN-SUB-DIST
728500        MOVE TA-CC                 TO P914-TURN-CC
728600        MOVE TA-XB-TURN            TO P914-TURN
728700     ELSE
728800        MOVE NA-DIST               TO P914-TURN-DIST
728900        MOVE NA-SUB-DIST           TO P914-TURN-SUB-DIST
729000        MOVE NA-CC                 TO P914-TURN-CC
729100        MOVE NA-XB-TURN            TO P914-TURN
729200     END-IF
729300
729400     IF P920-DEADHEAD-FUNCTION
729500        SET P914-DEADHEAD-FUNCTION TO TRUE
729600        MOVE OD-1                  TO JOB-DEF-CHECK
729700        IF ON-DUTY-UFP
729800           OR (ON-DUTY-AJ AND JOB-DEF-LOCAL-ASGN)
729900           SET P914-ROAD           TO TRUE
730000        ELSE
730100           SET P914-YARD           TO TRUE
730200        END-IF
730300        MOVE P920-DHD-DATE-TIME    TO P914-EFF-DATE-TIME
730400        MOVE P920-TIME-ZONE        TO P914-TIME-ZONE
730500*------------------------------------------------------------*
730600*       CONVERT EMP TIMES BACK TO P920-TIMEZONE PRIOR TO LINK*
730700*------------------------------------------------------------*
730800        MOVE SPACES                  TO TZ-PARAMETERS
730900        MOVE WS-EMP-TIME-ZONE        TO TZ-IN-ZONE
731000        MOVE LAST-ON-DUTY-TIME       TO TZ-IN-DATE-TIME
731100        MOVE P920-TIME-ZONE          TO TZ-OUT-ZONE
731200        PERFORM P8996-TIMEZONE
731300        MOVE TZ-OUT-DATE-TIME        TO P914-ODT-DATE-TIME
731400*
731500        MOVE SPACES                  TO TZ-PARAMETERS
731600        MOVE WS-EMP-TIME-ZONE        TO TZ-IN-ZONE
731700        MOVE LAST-ARRIVAL-TIME       TO TZ-IN-DATE-TIME
731800        MOVE P920-TIME-ZONE          TO TZ-OUT-ZONE
731900        PERFORM P8996-TIMEZONE
732000        MOVE TZ-OUT-DATE-TIME        TO P914-ARR-DATE-TIME
732100*
732200        MOVE SPACES                  TO TZ-PARAMETERS
732300        MOVE WS-EMP-TIME-ZONE        TO TZ-IN-ZONE
732400        MOVE LAST-TIE-UP-TIME        TO TZ-IN-DATE-TIME
732500        MOVE P920-TIME-ZONE          TO TZ-OUT-ZONE
732600        PERFORM P8996-TIMEZONE
732700        MOVE TZ-OUT-DATE-TIME        TO P914-TU-DATE-TIME
732800*
732900        MOVE P920-DHD-MILES-CLMD   TO P914-MILES-CLAIMED
733000                                      P914-MILES-ACTUAL
733100     END-IF
733200     IF P920-TIE-UP-FUNCTION OR
733300        P920-ADJ-TIE-UP-FUNCTION
733400        IF P920-ADJ-TIE-UP-FUNCTION
733500           SET P914-ADJ-TIE-UP-FUNCTION TO TRUE
733600*SAM 2/19/03
733700           IF P920-CLEAR-QUICK-TIE
733800              SET P914-QUICK-TIED  TO TRUE
733900           END-IF
734000        ELSE
734100           SET P914-TIE-UP-FUNCTION     TO TRUE
734200        END-IF
734300        MOVE P920-ASGN-ASGN        TO JOB-DEF-CHECK
734400*CNC0562-BEG
734500        IF JOB-DEF-RELIEF-ASGN
734600           IF WORK-AH-POOL            = JOB-DEF-YARD-POOL
734700              SET JOB-DEF-YARD-ASGN  TO TRUE
734800           ELSE
734900              SET JOB-DEF-LOCAL-ASGN TO TRUE
735000           END-IF
735100        END-IF
735200*CNC0562-END
735300        IF P920-ASGN-UFP
735400        OR (P920-ASGN-AJ AND JOB-DEF-LOCAL-ASGN)
735500           SET P914-ROAD             TO TRUE
735600        ELSE
735700           SET P914-YARD             TO TRUE
735800        END-IF
735900        MOVE P920-TIME-ZONE          TO P914-TIME-ZONE
736000        MOVE P920-EMP-OFFD-DATE-TIME TO P914-EFF-DATE-TIME
736100        MOVE P920-EMP-PERS-REST-CLMD TO P914-REST-CLAIMED
736200*------------------------------------------------------------*
736300*       CONVERT EMP TIMES BACK TO P920-TIMEZONE PRIOR TO LINK*
736400*------------------------------------------------------------*
736500        MOVE SPACES                  TO TZ-PARAMETERS
736600        MOVE WS-EMP-TIME-ZONE        TO TZ-IN-ZONE
736700        MOVE LAST-ON-DUTY-TIME       TO TZ-IN-DATE-TIME
736800        MOVE P920-TIME-ZONE          TO TZ-OUT-ZONE
736900        PERFORM P8996-TIMEZONE
737000        MOVE TZ-OUT-DATE-TIME        TO P914-ODT-DATE-TIME
737100*
737200        MOVE SPACES                  TO TZ-PARAMETERS
737300        MOVE WS-EMP-TIME-ZONE        TO TZ-IN-ZONE
737400        MOVE LAST-ARRIVAL-TIME       TO TZ-IN-DATE-TIME
737500        MOVE P920-TIME-ZONE          TO TZ-OUT-ZONE
737600        PERFORM P8996-TIMEZONE
737700        MOVE TZ-OUT-DATE-TIME        TO P914-ARR-DATE-TIME
737800*
737900        MOVE SPACES                  TO TZ-PARAMETERS
738000        MOVE WS-EMP-TIME-ZONE        TO TZ-IN-ZONE
738100        MOVE LAST-TIE-UP-TIME        TO TZ-IN-DATE-TIME
738200        MOVE P920-TIME-ZONE          TO TZ-OUT-ZONE
738300        PERFORM P8996-TIMEZONE
738400        MOVE TZ-OUT-DATE-TIME        TO P914-TU-DATE-TIME
738500*CNC0562 - BEG
738600*       MOVE P920-ASGN-ASGN          TO JOB-DEF-CHECK
738700*CNC0562 - BEG
738800        IF  P920-ASGN-AJ
738900        AND WS-ALT-REST
739000        AND (JOB-DEF-YARD-ASGN OR JOB-DEF-COMMUTER-ASGN)
739100           SET P914-ALT-BOARD-PLACEMENT       TO TRUE
739200           MOVE WS-SCHED-END-DATE-TIME TO P914-SCHED-END-DATE-TIME
739300        END-IF
739400*-------------------------------------------------------------
739500*  FOR EXTRABOARD TURNS, SHORT TURNS ARE DETERMINED IN CNP914,
739600*  SO THE FOLLOWING INFORMATION IS REQUIRED.
739700*----------------------------------------------------------PLS
739800        MOVE P920-EMP-ST-CLMD        TO P914-EMP-ST-CLMD
739900        MOVE P920-EMP-MILES-CLMD     TO P914-MILES-CLAIMED
740000        MOVE P920-ACTUAL-MILES       TO P914-MILES-ACTUAL
740100        IF P920-ORG-STATION > SPACES    AND
740200           P920-FINAL-STATION > SPACES  AND
740300           P920-ORG-STATION = P920-FINAL-STATION
740400           SET P914-SAME-ORIGIN-FINAL TO TRUE
740500        END-IF
740600     END-IF
740700     IF P920-CANCEL-FUNCTION
740800        SET P914-CANCEL-FUNCTION     TO TRUE
740900     END-IF
741000     EXEC CICS LINK
741100               PROGRAM(P914-PGM)
741200               COMMAREA(P914-COMMAREA-PARMS)
741300               LENGTH(P914-LGTH)
741400               RESP(WS-RESPONSE)
741500     END-EXEC
741600     MOVE WS-RESPONSE TO FILE-STATUS
741700     IF NOT SUCCESS
741800        MOVE 'P8010-2' TO ERR-PARAGRAPH
741900        PERFORM P9999-GOT-PROBLEM
742000     END-IF
742100     IF P920-CANCEL-FUNCTION
742200        MOVE SPACES TO P912-XB-POS-PARMS
742300        MOVE P914-TURN-PARM TO P912-TURN-PARM
742400        IF FASTSLOW-XB
742500           AND P914-ROAD
742600           SET P912-SLOW-BOARD TO TRUE
742700        END-IF
742800        EXEC CICS LINK
742900                  PROGRAM(P912-PGM)
743000                  COMMAREA(P912-XB-POS-PARMS)
743100                  LENGTH(P912-LGTH)
743200                  RESP(WS-RESPONSE)
743300        END-EXEC
743400        MOVE WS-RESPONSE TO FILE-STATUS
743500        IF NOT SUCCESS
743600           MOVE 'P8010-3' TO ERR-PARAGRAPH
743700           PERFORM P9999-GOT-PROBLEM
743800        END-IF
743900        IF P912-POS-PARM IS NUMERIC
744000           AND P912-POS-PARM < '999'
744100           MOVE P912-POS-PARM TO P920-EMP-POSITION
744200        END-IF
744300     END-IF.
744400*=================================================================
744500 P8070-READ-EMPTOD.
744600*=================================================================
744700     EXEC CICS READ
744800               DATASET(EMPTOD-VIA-EMP)
744900               INTO(WS-EMP-TOD)
745000               RIDFLD(EMPTOD-EMPKEY)
745100               LENGTH(EMPTOD-EMP-RLGTH)
745200               KEYLENGTH(EMPTOD-EMP-KLGTH)
745300               RESP(WS-RESPONSE)
745400     END-EXEC
745500     MOVE WS-RESPONSE      TO FILE-STATUS
745600     IF NOT SUCCESS AND
745700        NOT NO-RECORD-FND
745800        MOVE 'P8070-1'      TO ERR-PARAGRAPH
745900        MOVE EMPTOD-EMPKEY  TO ERR-KEY
746000        PERFORM P9999-GOT-PROBLEM
746100     END-IF.
746200*=================================================================
746300 P8080-DELETE-EMPTOD.
746400*=================================================================
746500     EXEC CICS DELETE
746600               DATASET(EMPTOD-VIA-EMP)
746700               RIDFLD(EMPTOD-EMPKEY)
746800               RESP(WS-RESPONSE)
746900     END-EXEC
747000     MOVE WS-RESPONSE         TO FILE-STATUS
747100     IF NOT SUCCESS
747200        MOVE 'P8080-1'      TO ERR-PARAGRAPH
747300        MOVE EMPTOD-EMPKEY  TO ERR-KEY
747400        PERFORM P9999-GOT-PROBLEM
747500     END-IF.
747600*
747700******************************************************************
747800 P8100-READ-QUAL.
747900*                                                          CW0397
748000******************************************************************
748100     EXEC CICS READ
748200               DATASET(QUAL-FILE-VIA-QUALEMP)
748300               INTO(WS-QUAL-FILE)
748400               LENGTH(QUALEMP-RLGTH)
748500               RIDFLD(QUALEMP)
748600               KEYLENGTH(QUALEMP-KLGTH)
748700               RESP(WS-RESPONSE)
748800     END-EXEC
748900     MOVE WS-RESPONSE TO FILE-STATUS
749000     .
749100*****************************************************************
749200 P8200-READ-TELE-UPDATE.
749300*****************************************************************
749400     EXEC CICS READ
749500               UPDATE
749600               DATASET(TELE-VIA-EMP-NBR)
749700               INTO(WS-TELE-FILE)
749800               LENGTH(TELEENBR-RLGTH)
749900               RIDFLD(TELENBRK)
750000               KEYLENGTH(TELEENBR-KLGTH)
750100               RESP(WS-RESPONSE)
750200     END-EXEC
750300     MOVE WS-RESPONSE                   TO FILE-STATUS
750400     IF NOT (SUCCESS OR NO-RECORD-FND)
750500        MOVE 'P8200-1'                  TO ERR-PARAGRAPH
750600        MOVE TELENBRK                   TO ERR-KEY
750700        PERFORM P9999-GOT-PROBLEM
750800     END-IF
750900     .
751000*****************************************************************
751100 P8210-REWRITE-TELE.
751200*****************************************************************
751300     EXEC CICS REWRITE
751400               DATASET(TELE-VIA-EMP-NBR)
751500               FROM(WS-TELE-FILE)
751600               LENGTH(TELEENBR-RLGTH)
751700               RESP(WS-RESPONSE)
751800     END-EXEC
751900     MOVE WS-RESPONSE                   TO FILE-STATUS
752000     IF NOT SUCCESS
752100        MOVE 'P8210-1'                  TO ERR-PARAGRAPH
752200        MOVE TELENBRK                   TO ERR-KEY
752300        PERFORM P9999-GOT-PROBLEM
752400     END-IF
752500     .
752600*MET 6/30/2006 C596
752700*****************************************************************
752800 P8300-READ-GTEQ-AH-MISC.
752900*****************************************************************
753000     MOVE AHM-KEY                       TO AHMKEY
753100     EXEC CICS READ
753200               GTEQ
753300               DATASET  (AHM-FILE)
753400               INTO     (WS-AHIST-MISC)
753500               LENGTH   (AHM-RLGTH)
753600               RIDFLD   (AHMKEY)
753700               KEYLENGTH(AHM-KLGTH)
753800               RESP     (WS-RESPONSE)
753900     END-EXEC
754000     MOVE WS-RESPONSE                   TO FILE-STATUS
754100     IF SUCCESS
754200     OR NO-RECORD-FND
754300        CONTINUE
754400     ELSE
754500        MOVE 'P8300'                    TO ERR-PARAGRAPH
754600        MOVE AHMKEY                     TO ERR-KEY
754700        PERFORM P9999-GOT-PROBLEM
754800     END-IF
754900     .
755000*****************************************************************
755100 P8400-GET-LATEST-TEMP-JOB.
755200*****************************************************************
755300     INITIALIZE WS-ASSIGN-COMMAREA
755400                WS-ASGN-FILE
755500     MOVE EMP-NBR IN WS-MSTR         TO ASGN-EMP-NO
755600     SET GET-EMPS-LATEST-TEMP-JOB    TO TRUE
755700     MOVE WS-ASGN-FILE               TO WS-ASSIGN-RECORD
755800     EXEC CICS LINK
755900               PROGRAM (P901-PGM)
756000               COMMAREA(WS-ASSIGN-COMMAREA)
756100               LENGTH  (P901-LGTH)
756200               RESP    (WS-RESPONSE)
756300     END-EXEC
756400     MOVE WS-RESPONSE                TO FILE-STATUS
756500     IF NOT SUCCESS
756600        MOVE 'P8400-1'               TO ERR-PARAGRAPH
756700        MOVE 'P901LINK'              TO ERR-KEY
756800        MOVE 'LINK TO 901 FAILED'    TO ERR-SENTENCE
756900        PERFORM P9999-GOT-PROBLEM
757000     END-IF
757100     MOVE WS-ASSIGN-RECORD           TO WS-ASGN-FILE.
757200*
757300******************************************************************
757400 P8500-READ-MASTER.
757500******************************************************************
757600     EXEC CICS READ
757700               DATASET(MSTR-VIA-EMP-NBR)
757800               INTO(WS-MSTR)
757900               LENGTH(MSTRENBR-RLGTH)
758000               RIDFLD(MSTRNBRK)
758100               KEYLENGTH(MSTRENBR-KLGTH)
758200               RESP(WS-RESPONSE)
758300     END-EXEC
758400     MOVE WS-RESPONSE TO FILE-STATUS
758500     IF SUCCESS
758600        PERFORM P8510-READ-MASTER-JOBS
758700     ELSE
758800        MOVE 'P8500' TO ERR-PARAGRAPH
758900        MOVE MSTRNBRK TO ERR-KEY
759000        PERFORM P9999-GOT-PROBLEM
759100     END-IF.
759200******************************************************************
759300 P8510-READ-MASTER-JOBS.
759400******************************************************************
759500     MOVE SPACES                 TO WS-ASGN-FILE
759600     MOVE EMP-NBR OF WS-MSTR     TO WK-ASGN-EMP-NO
759700     PERFORM PXXXX-JOB-OWNED
759800     MOVE ASGN-JOB-TYPE          TO NORMAL-ASGNMT-FLAG
759900     MOVE ASGN-ASSIGNMENT        TO NORMAL-ASGNMT
760000     MOVE SPACES                 TO WS-ASGN-FILE
760100                                    SAVE-TEMP-ASGN-KEY
760200     PERFORM PXXXX-LATEST-TEMP-JOB
760300     MOVE ASGN-JOB-TYPE          TO TEMPORARY-ASGNMT-FLAG
760400     MOVE SPACES                 TO TEMP-ASGN-XB-AUG-FLAG
760500                                    TEMP-ASGN-F-NOT-FLAG
760600     IF ASGN-JOB-TYPE = 'X'
760700        AND AUGMENTED-TO-EXTRA-BOARD
760800        SET TEMP-ASGN-XB-AUG    TO TRUE
760900     END-IF
761000     IF ASGN-DH-F-NOTICE
761100        SET TEMP-ASGN-F-NOT      TO TRUE
761200     END-IF
761300     MOVE ASGN-ASSIGNMENT        TO TEMPORARY-ASGNMT
761400     IF ASGN-ASSIGNMENT > SPACES
761500        MOVE ASGNKEY1            TO SAVE-TEMP-ASGN-KEY
761600     END-IF
761700     MOVE SPACE                  TO WS-ASGN-FILE
761800     PERFORM PXXXX-JOB-ON-DUTY
761900     MOVE ASGN-JOB-TYPE          TO ON-DUTY-ASGNMT-FLAG
762000     MOVE ASGN-ASSIGNMENT        TO ON-DUTY-ASGNMT
762100     MOVE ASGN-ON-DUTY-DATE-TIME TO ON-DUTY-OUT-TOWN-CODE.
762200*CNC0600 - RJA - B
762300******************************************************************
762400 P8515-READ-MASTER.
762500******************************************************************
762600     EXEC CICS READ
762700               DATASET(MSTR-VIA-EMP-NBR)
762800               INTO(WS-MSTR)
762900               LENGTH(MSTRENBR-RLGTH)
763000               RIDFLD(MSTRNBRK)
763100               KEYLENGTH(MSTRENBR-KLGTH)
763200               RESP(WS-RESPONSE)
763300     END-EXEC
763400     MOVE WS-RESPONSE TO FILE-STATUS.
763500*CNC0600 - RJA - E
763600******************************************************************
763700 P8520-READ-MASTER-UPDATE.
763800******************************************************************
763900     EXEC CICS READ
764000               UPDATE
764100               DATASET(MSTR-VIA-EMP-NBR)
764200               INTO(WS-MSTR)
764300               LENGTH(MSTRENBR-RLGTH)
764400               RIDFLD(MSTRNBRK)
764500               KEYLENGTH(MSTRENBR-KLGTH)
764600               RESP(WS-RESPONSE)
764700     END-EXEC
764800     MOVE WS-RESPONSE TO FILE-STATUS.
764900*
765000******************************************************************
765100 P8550-REWRITE-MASTER.
765200******************************************************************
765300*    IF P920-CANCEL-FUNCTION OR
765400*       P920-TIE-UP-FUNCTION
765500*       IF CALL-CANCELLED
765600*          SET NORMAL             TO TRUE
765700*       END-IF
765800*    END-IF
765900
766000     EXEC CICS REWRITE
766100               DATASET(MSTR-VIA-EMP-NBR)
766200               FROM(WS-MSTR)
766300               LENGTH(MSTRENBR-RLGTH)
766400               RESP(WS-RESPONSE)
766500     END-EXEC
766600     MOVE WS-RESPONSE TO FILE-STATUS
766700     IF NOT SUCCESS
766800        MOVE 'P8550'  TO ERR-PARAGRAPH
766900        MOVE MSTRNBRK TO ERR-KEY
767000        PERFORM P9999-GOT-PROBLEM
767100     END-IF.
767200*
767300*CNC0600 - RJA - B
767400******************************************************************
767500 P8560-READ-MSTR3.
767600******************************************************************
767700
767800     EXEC CICS READ
767900               DATASET(MSTR3-VIA-EMP-NBR)
768000               INTO(WS-MSTR3)
768100               LENGTH(MSTR3ENBR-RLGTH)
768200               RIDFLD(MSTR3NBRK)
768300               KEYLENGTH(MSTR3ENBR-KLGTH)
768400               RESP(WS-RESPONSE)
768500     END-EXEC
768600     MOVE WS-RESPONSE                   TO FILE-STATUS.
768700******************************************************************
768800 P8565-READ-UPDATE-MSTR3.
768900******************************************************************
769000     EXEC CICS READ
769100               UPDATE
769200               DATASET(MSTR3-VIA-EMP-NBR)
769300               INTO(WS-MSTR3)
769400               LENGTH(MSTR3ENBR-RLGTH)
769500               RIDFLD(MSTR3NBRK)
769600               KEYLENGTH(MSTR3ENBR-KLGTH)
769700               RESP(WS-RESPONSE)
769800     END-EXEC
769900     MOVE WS-RESPONSE                   TO FILE-STATUS
770000     IF NO-RECORD-FND
770100*       IF WS-CAN-WRR-NEW, MSTR3 WOULD BE WRITTEN AT CALL IF ONE
770200*       IS NOT FOUND. THIS IS TO HANDLE ANY EMPLOYEES WITHOUT
770300*       MSTR3 WHO WERE ON-DUTY BEFORE WS-CAN-WRR-NEW IS TURNED ON
770400*       AND TYING UP AFTER.
770500        MOVE SPACES                     TO WS-MSTR3
770600        MOVE MSTR3NBRK                  TO MSTR3-KEY
770700        EXEC CICS WRITE
770800                  DATASET(MSTR3-VIA-EMP-NBR)
770900                  FROM(WS-MSTR3)
771000                  LENGTH(MSTR3ENBR-RLGTH)
771100                  RIDFLD(MSTR3NBRK)
771200                  RESP(WS-RESPONSE)
771300        END-EXEC
771400        MOVE WS-RESPONSE                TO FILE-STATUS
771500        IF NOT SUCCESS
771600           MOVE 'P8565-1' TO ERR-PARAGRAPH
771700           PERFORM P9999-GOT-PROBLEM
771800        END-IF
771900        EXEC CICS READ
772000                  UPDATE
772100                  DATASET(MSTR3-VIA-EMP-NBR)
772200                  INTO(WS-MSTR3)
772300                  LENGTH(MSTR3ENBR-RLGTH)
772400                  RIDFLD(MSTR3NBRK)
772500                  KEYLENGTH(MSTR3ENBR-KLGTH)
772600                  RESP(WS-RESPONSE)
772700        END-EXEC
772800        MOVE WS-RESPONSE                TO FILE-STATUS
772900     END-IF.
773000******************************************************************
773100 P8570-REWRITE-MSTR3.
773200******************************************************************
773300     EXEC CICS REWRITE
773400               DATASET(MSTR3-VIA-EMP-NBR)
773500               FROM(WS-MSTR3)
773600               LENGTH(MSTR3ENBR-RLGTH)
773700               RESP(WS-RESPONSE)
773800     END-EXEC
773900     MOVE WS-RESPONSE                   TO FILE-STATUS.
774000*
774100*CNC0600 - RJA - E
774200*
774300******************************************************************
774400 P8600-READ-UFPTURN.
774500******************************************************************
774600     EXEC CICS READ
774700               DATASET(UFP-VIA-TURN-NBR)
774800               INTO(WS-UFP)
774900               LENGTH(UFPTURN-RLGTH)
775000               RIDFLD(UFPTURN)
775100               KEYLENGTH(UFPTURN-KLGTH)
775200               RESP(WS-RESPONSE)
775300     END-EXEC
775400     MOVE WS-RESPONSE TO FILE-STATUS.
775500*
775600******************************************************************
775700 P8610-READ-AJJOBKEY.
775800******************************************************************
775900     EXEC CICS READ
776000               DATASET(AJ-VIA-JNAME-JCRAFT)
776100               INTO(WS-ASGNED-JOBS)
776200               LENGTH(AJNAMECR-RLGTH)
776300               RIDFLD(AJJOBKEY)
776400               KEYLENGTH(AJNAMECR-KLGTH)
776500               RESP(WS-RESPONSE)
776600     END-EXEC
776700     MOVE WS-RESPONSE TO FILE-STATUS.
776800*
776900******************************************************************
777000 P8640-READ-CNTLFILE.
777100******************************************************************
777200     MOVE WORK-CNTLKEY TO CNTLKEY
777300     EXEC CICS READ
777400               DATASET(CNTL-FILE-VIA-CNTLKEY)
777500               INTO(WS-CNTL-FILE)
777600               LENGTH(CNTLFILE-RLGTH)
777700               RIDFLD(CNTLKEY)
777800               KEYLENGTH(CNTLFILE-KLGTH)
777900               RESP(WS-RESPONSE)
778000     END-EXEC
778100     MOVE WS-RESPONSE TO FILE-STATUS.
778200*
778300******************************************************************
778400 P8641-STARTBR-CNTLFILE.
778500******************************************************************
778600     MOVE WORK-CNTLKEY TO CNTLKEY
778700     EXEC CICS STARTBR
778800               DATASET(CNTL-FILE-VIA-CNTLKEY)
778900               RIDFLD(CNTLKEY)
779000               GTEQ
779100               RESP(WS-RESPONSE)
779200     END-EXEC
779300     MOVE WS-RESPONSE TO FILE-STATUS.
779400*
779500******************************************************************
779600 P8642-READNEXT-CNTLFILE.
779700******************************************************************
779800     EXEC CICS READNEXT
779900               DATASET(CNTL-FILE-VIA-CNTLKEY)
780000               INTO(WS-CNTL-FILE)
780100               LENGTH(CNTLFILE-RLGTH)
780200               RIDFLD(CNTLKEY)
780300               KEYLENGTH(CNTLFILE-KLGTH)
780400               RESP(WS-RESPONSE)
780500     END-EXEC
780600     MOVE WS-RESPONSE TO FILE-STATUS.
780700*
780800******************************************************************
780900 P8643-ENDBR-CNTLFILE.
781000******************************************************************
781100     EXEC CICS ENDBR
781200               DATASET(CNTL-FILE-VIA-CNTLKEY)
781300               RESP(WS-RESPONSE)
781400     END-EXEC
781500     MOVE WS-RESPONSE TO FILE-STATUS.
781600******************************************************************
781700 P8700-READ-AHIST.
781800******************************************************************
781900     EXEC CICS READ
782000               DATASET(AH-FILE-VIA-K1)
782100               INTO(WS-AHIST)
782200               LENGTH(AH1-RLGTH)
782300               RIDFLD(AH1KEY)
782400               KEYLENGTH(AH1-KLGTH)
782500               RESP(WS-RESPONSE)
782600     END-EXEC
782700     MOVE WS-RESPONSE                 TO FILE-STATUS.
782800*
782900******************************************************************
783000 P8800-LINK-P937-TO-PLACE.
783100******************************************************************
783200*
783300     MOVE SPACES                     TO P937-COMMAREA-PARMS
783400     MOVE P920-ASGN-ON-DUTY-EMP      TO P937-AVL-EMP-NO
783500     SET P937-DISCONNECTED-PROCESS   TO TRUE
783600     MOVE LAYOFF-CODE-1              TO P937-LAYOFF-CODE
783700     MOVE P920-TIME-ZONE             TO P937-TIME-ZONE
783800     IF P920-CANCEL-FUNCTION
783900        MOVE P920-CAN-DATE-TIME      TO P937-CALL-DATE-TIME
784000     ELSE
784100        MOVE P920-EMP-OFFD-DATE-TIME TO P937-CALL-DATE-TIME
784200     END-IF
784300     MOVE WS-SYSTEM-DATE-TIME-CENT   TO P937-EFF-DATE-TIME-CENT
784400     SET P937-TOPLACE                TO TRUE
784500     EXEC CICS LINK
784600               PROGRAM(P937-PGM)
784700               COMMAREA(P937-COMMAREA-PARMS)
784800               LENGTH(P937-LGTH)
784900               RESP(WS-RESPONSE)
785000     END-EXEC
785100     MOVE WS-RESPONSE                   TO FILE-STATUS
785200     IF NOT SUCCESS
785300        MOVE 'P8800-1'                  TO ERR-PARAGRAPH
785400        MOVE P937-AVL-EMP-KEY           TO ERR-KEY
785500        MOVE 'P937LINK'                 TO ERR-KEY
785600        PERFORM P9999-GOT-PROBLEM
785700     END-IF.
785800*
785900* C957-2
786000******************************************************************
786100 P8850-INSERT-LVE.
786200******************************************************************
786300     MOVE P920-AFHT-FACILITY-CD         TO LVE-FCLTY-CD
786400     MOVE P920-FINAL-STATION            TO LVE-LDG-STN
786500     MOVE EMP-NBR OF WS-MSTR            TO LVE-EMP-NBR
786600*
786700     PERFORM PSQL-LVESEL06
786800     IF NO-ROW-FND
786900*C983-BEG
787000        MOVE AHM-KEY                    TO LVE-AHM-KEY
787100*C983-END
787200        PERFORM PSQL-LVEINS01
787300     END-IF
787400*
787500     IF NOT P920-FROM-07B-TO-04L
787600       MOVE SPACES                        TO P943-COMMAREA-PARMS
787700       MOVE EMP-NBR OF WS-MSTR            TO P943-EMP-NBR
787800       MOVE P920-EMP-OFFD-DATE-TIME       TO P943-EFF-DATE-TIME
787900       MOVE P920-TIME-ZONE                TO P943-EMP-TIME-ZONE
788000       MOVE WS-SYSTEM-DATE-TIME(1:14)     TO P943-CLOCK-TIME
788100       MOVE DIST     OF WS-MSTR           TO P943-DIST
788200       MOVE SUB-DIST OF WS-MSTR           TO P943-SDIST
788300       MOVE CRAFT    OF WS-MSTR           TO P943-CRAFT
788400       MOVE LAYOFF-CODE                   TO P943-LO
788500       SET P943-AFHT-FACILITY-CHG-FUN     TO TRUE
788600       SET P943-AFHT-FCLTY-ADD            TO TRUE
788700       SET P943-AFHT-ADD-DESC1            TO TRUE
788800       SET P943-AFHT-SLASH1-VAL           TO TRUE
788900       MOVE LVE-FCLTY-CD                  TO P943-AFHT-FCLTY-OLD
789000       MOVE SPACES                        TO P943-AFHT-ROOM-OLD
789100       PERFORM P8900-WRITE-HISTORY
789200     END-IF
789300     .
789400* C957-2-END
789500******************************************************************
789600 P8900-WRITE-HISTORY.
789700******************************************************************
789800*
789900     SET P943-EMPLOYEE-FUNCTION      TO TRUE
790000     EXEC CICS ASSIGN
790100               USERID(P943-USERID)
790200     END-EXEC
790300
790400     EXEC CICS LINK
790500               PROGRAM(P943-PGM)
790600               COMMAREA(P943-COMMAREA-PARMS)
790700               LENGTH(P943-LGTH)
790800               RESP(WS-RESPONSE)
790900     END-EXEC
791000     MOVE WS-RESPONSE                TO FILE-STATUS
791100     IF NOT SUCCESS
791200        MOVE 'P8900-1'               TO ERR-PARAGRAPH
791300        MOVE 'P943'                  TO ERR-KEY
791400        PERFORM P9999-GOT-PROBLEM
791500     END-IF
791600     IF P943-RETURN-STATUS > ZEROES
791700        MOVE 'P8900-2'               TO ERR-PARAGRAPH
791800        MOVE P943-RETURN-STATUS      TO FILE-STATUS
791900        MOVE 'P943-RETURN'           TO ERR-KEY
792000        PERFORM P9999-GOT-PROBLEM
792100     END-IF.
792200******************************************************************
792300 P8910-CALL-PS93-PROGRAM.
792400******************************************************************
792500     EXEC CICS LINK
792600               PROGRAM  (PS93-PGM)
792700               COMMAREA (PS93-COMMAREA-PARMS)
792800               LENGTH   (PS93-LGTH)
792900               RESP     (WS-RESPONSE)
793000     END-EXEC
793100     MOVE WS-RESPONSE              TO FILE-STATUS
793200     IF NOT SUCCESS
793300        MOVE 'P8910-S93'           TO ERR-PARAGRAPH
793400        PERFORM P9999-GOT-PROBLEM
793500     ELSE
793600        MOVE PS93-FILE-STATUS      TO SQL-RETURN
793700     END-IF
793800     .
793900******************************************************************
794000 P8920-CALL-PS94-PROGRAM.
794100******************************************************************
794200     EXEC CICS LINK
794300               PROGRAM  (PS94-PGM)
794400               COMMAREA (PS94-COMMAREA-PARMS)
794500               LENGTH   (PS94-LGTH)
794600               RESP     (WS-RESPONSE)
794700     END-EXEC
794800
794900     MOVE WS-RESPONSE                   TO FILE-STATUS
795000     IF NOT SUCCESS
795100        MOVE 'P8920-S94'                TO ERR-PARAGRAPH
795200        PERFORM P9999-GOT-PROBLEM
795300     ELSE
795400        MOVE PS94-FILE-STATUS           TO FILE-STATUS
795500                                           SQL-RETURN
795600     END-IF
795700     .
795800******************************************************************
795900 P8993-GET-ASGN-TIMEZONE.
796000******************************************************************
796100     MOVE SPACES                   TO WORK-CNTLKEY
796200     MOVE '02'                     TO WK-CNTL-REC-TYPE
796300     MOVE P943-DIST                TO WK-CNTL-DIST
796400     MOVE P943-SDIST               TO WK-CNTL-SUB-DIST
796500     MOVE WORK-CNTLKEY             TO CNTLKEY
796600     EXEC CICS READ
796700               DATASET(CNTL-FILE-VIA-CNTLKEY)
796800               INTO(WS-CNTL-FILE)
796900               LENGTH(CNTLFILE-RLGTH)
797000               RIDFLD(CNTLKEY)
797100               KEYLENGTH(CNTLFILE-KLGTH)
797200               RESP(WS-RESPONSE)
797300     END-EXEC
797400     MOVE WS-RESPONSE  TO FILE-STATUS
797500     IF NOT SUCCESS
797600        MOVE 'P8994'   TO ERR-PARAGRAPH
797700        MOVE CNTLKEY   TO ERR-KEY
797800        PERFORM P9999-GOT-PROBLEM
797900     END-IF
798000     MOVE CNTL-TIME-ZONE           TO WS-ASG-TIME-ZONE.
798100******************************************************************
798200 P8994-CONVERT-HIST-TIMEZONE.
798300******************************************************************
798400     MOVE SPACES                   TO TZ-PARAMETERS
798500     MOVE WS-ASG-TIME-ZONE         TO TZ-OUT-ZONE
798600     MOVE P920-EMP-OFFD-DATE-TIME  TO TZ-IN-DATE-TIME
798700     MOVE P920-TIME-ZONE           TO TZ-IN-ZONE
798800     PERFORM P8996-TIMEZONE
798900     IF TZ-INVALID-PARAMETERS
799000        MOVE 'P8994TZ'             TO ERR-PARAGRAPH
799100        PERFORM P8996-TZERROR
799200     END-IF
799300     MOVE TZ-OUT-DATE-TIME         TO P943-EFF-DATE-TIME.
799400*
799500     EXEC SQL INCLUDE TIMEZONE END-EXEC.
799600     EXEC SQL INCLUDE TZERROR  END-EXEC.
799700*
799800******************************************************************
799900 PXXXX-JOB-OWNER.
800000******************************************************************
800100     MOVE WORK-ASGNKEY1 TO ASGNKEY1
800200     SET ASGN-OWNER-REC TO TRUE
800300     MOVE ZERO          TO ASGN-DATE-TIME
800400     MOVE ASGNKEY1      TO ASGNJOB
800500     EXEC CICS READ
800600               DATASET(ASGN-VIA-ASGNJOB)
800700               INTO(ASGN-AREA)
800800               LENGTH(ASGNJOB-RLGTH)
800900               RIDFLD(ASGNJOB)
801000               KEYLENGTH(ASGNJOB-KLGTH)
801100               RESP(WS-RESPONSE)
801200     END-EXEC
801300     MOVE WS-RESPONSE TO FILE-STATUS
801400     IF NOT SUCCESS
801500        MOVE ZEROS TO ASGN-EMP-NO
801600     END-IF.
801700*
801800******************************************************************
801900 PXXXX-LATEST-TEMP.
802000******************************************************************
802100     MOVE SPACES                        TO WS-SAVE-ASGN-FILE
802200     MOVE WORK-ASGNKEY1                 TO ASGNKEY1
802300     SET ASGN-TEMP-REC                  TO TRUE
802400     MOVE ZERO                          TO ASGN-DATE-TIME
802500     MOVE ASGNKEY1                      TO ASGNJOB
802600     EXEC CICS STARTBR
802700               DATASET(ASGN-VIA-ASGNJOB)
802800               RIDFLD(ASGNJOB)
802900               GTEQ
803000               RESP(WS-RESPONSE)
803100     END-EXEC
803200     MOVE WS-RESPONSE                   TO FILE-STATUS
803300     IF SUCCESS
803400        MOVE 'N'                        TO WS-ASGN-DONE-CODE
803500        PERFORM UNTIL ASGN-DONE
803600           EXEC CICS READNEXT
803700                     DATASET(ASGN-VIA-ASGNJOB)
803800                     INTO(ASGN-AREA)
803900                     LENGTH(ASGNJOB-RLGTH)
804000                     RIDFLD(ASGNJOB)
804100                     KEYLENGTH(ASGNJOB-KLGTH)
804200                     RESP(WS-RESPONSE)
804300           END-EXEC
804400           MOVE WS-RESPONSE             TO FILE-STATUS
804500           IF SUCCESS
804600              IF WK-ASGN-DIST = ASGN-DIST
804700                 AND WK-ASGN-SUB-DIST    = ASGN-SUB-DIST
804800                 AND WK-ASGN-ASSIGN      = ASGN-AJ-JOB
804900                                           OF ASGN-ASSIGNMENT
805000                 AND ASGN-TEMP-REC
805100                 MOVE ASGN-AREA         TO WS-SAVE-ASGN-FILE
805200              ELSE
805300                 SET ASGN-DONE          TO TRUE
805400              END-IF
805500           ELSE
805600              SET ASGN-DONE             TO TRUE
805700           END-IF
805800        END-PERFORM
805900        EXEC CICS ENDBR
806000                  DATASET(ASGN-VIA-ASGNJOB)
806100                  RESP(WS-RESPONSE)
806200        END-EXEC
806300     END-IF
806400     IF WS-SAVE-ASGN-FILE > SPACE
806500        MOVE WS-SAVE-ASGN-FILE          TO ASGN-AREA
806600     ELSE
806700        MOVE ZEROS                      TO ASGN-EMP-NO
806800     END-IF
806900     .
807000*
807100******************************************************************
807200 PXXXX-ON-DUTY-EMP.
807300******************************************************************
807400     MOVE WORK-ASGNKEY1   TO ASGNKEY1
807500     SET ASGN-ON-DUTY-REC TO TRUE
807600     MOVE ZERO            TO ASGN-DATE-TIME
807700     MOVE ASGNKEY1        TO ASGNJOB
807800     EXEC CICS READ
807900               DATASET(ASGN-VIA-ASGNJOB)
808000               INTO(ASGN-AREA)
808100               LENGTH(ASGNJOB-RLGTH)
808200               RIDFLD(ASGNJOB)
808300               KEYLENGTH(ASGNJOB-KLGTH)
808400               RESP(WS-RESPONSE)
808500     END-EXEC
808600     MOVE WS-RESPONSE TO FILE-STATUS
808700     IF NOT SUCCESS
808800        MOVE ZEROS TO ASGN-EMP-NO
808900     END-IF.
809000*
809100******************************************************************
809200 PXXXX-JOB-OWNED.
809300******************************************************************
809400     MOVE WORK-ASGNKEY2 TO ASGNKEY2
809500     MOVE '1'           TO ASGN-EMP-NO-REC-TYPE
809600     MOVE ZERO          TO ASGN-EMP-DATE-TIME
809700     MOVE ASGNKEY2      TO ASGNEMP
809800     MOVE SPACES        TO SAVE-NORM-ASGN-KEY
809900     EXEC CICS READ
810000               DATASET(ASGN-VIA-ASGNEMP)
810100               INTO(WS-ASGN-FILE)
810200               LENGTH(ASGNEMP-RLGTH)
810300               RIDFLD(ASGNEMP)
810400               KEYLENGTH(ASGNEMP-KLGTH)
810500               RESP(WS-RESPONSE)
810600     END-EXEC
810700     MOVE WS-RESPONSE TO FILE-STATUS
810800     IF SUCCESS
810900        MOVE ASGNKEY1 TO SAVE-NORM-ASGN-KEY
811000     ELSE
811100        MOVE SPACES TO WS-ASGN-FILE
811200     END-IF.
811300*
811400******************************************************************
811500 PXXXX-LATEST-TEMP-JOB.
811600******************************************************************
811700     MOVE WORK-ASGNKEY2                 TO ASGNKEY2
811800     MOVE '2'                           TO ASGN-EMP-NO-REC-TYPE
811900     MOVE ZERO                          TO ASGN-EMP-DATE-TIME
812000     MOVE ASGNKEY2                      TO ASGNEMP
812100     MOVE SPACES                        TO WS-ASGN-FILE
812200                                           WS-SAVE-ASGN-FILE
812300     EXEC CICS STARTBR
812400               DATASET(ASGN-VIA-ASGNEMP)
812500               RIDFLD(ASGNEMP)
812600               GTEQ
812700               RESP(WS-RESPONSE)
812800     END-EXEC
812900     MOVE WS-RESPONSE                   TO FILE-STATUS
813000     IF SUCCESS
813100        MOVE 'N'                        TO WS-ASGN-DONE-CODE
813200        PERFORM UNTIL ASGN-DONE
813300           EXEC CICS READNEXT
813400                     DATASET(ASGN-VIA-ASGNEMP)
813500                     INTO(ASGN-AREA)
813600                     LENGTH(ASGNEMP-RLGTH)
813700                     RIDFLD(ASGNEMP)
813800                     KEYLENGTH(ASGNEMP-KLGTH)
813900                     RESP(WS-RESPONSE)
814000           END-EXEC
814100           MOVE WS-RESPONSE             TO FILE-STATUS
814200           IF SUCCESS
814300              IF ASGN-EMP-NO = WK-ASGN-EMP-NO
814400                 AND ASGN-EMP-NO-REC-TYPE = '2'
814500                 MOVE ASGN-AREA         TO WS-SAVE-ASGN-FILE
814600*
814700*                FURTHER NOTICE TEMPS SHOULD BE CONSIDERED TO BE
814800*                THE EMPLOYEES 'LATEST' TEMP ASGN, SO STOP LOOKING
814900*                FOR MORE TEMPS IF YOU FIND ONE.
815000*
815100                 IF ASGN-DH-F-NOTICE
815200                    SET ASGN-DONE       TO TRUE
815300                 END-IF
815400              ELSE
815500                 SET ASGN-DONE          TO TRUE
815600              END-IF
815700           ELSE
815800              SET ASGN-DONE             TO TRUE
815900           END-IF
816000        END-PERFORM
816100        EXEC CICS ENDBR
816200                  DATASET(ASGN-VIA-ASGNEMP)
816300                  RESP(WS-RESPONSE)
816400        END-EXEC
816500     END-IF
816600     IF WS-SAVE-ASGN-FILE > SPACES
816700        MOVE WS-SAVE-ASGN-FILE          TO WS-ASGN-FILE
816800     ELSE
816900        MOVE SPACES                     TO WS-ASGN-FILE
817000     END-IF
817100     .
817200*
817300******************************************************************
817400 PXXXX-JOB-ON-DUTY.
817500******************************************************************
817600     MOVE WORK-ASGNKEY2 TO ASGNKEY2
817700     MOVE '3' TO ASGN-EMP-NO-REC-TYPE
817800     MOVE ZERO TO ASGN-EMP-DATE-TIME
817900     MOVE ASGNKEY2 TO ASGNEMP
818000     EXEC CICS READ
818100               DATASET(ASGN-VIA-ASGNEMP)
818200               INTO(ASGN-AREA)
818300               LENGTH(ASGNEMP-RLGTH)
818400               RIDFLD(ASGNEMP)
818500               KEYLENGTH(ASGNEMP-KLGTH)
818600               RESP(WS-RESPONSE)
818700     END-EXEC
818800     MOVE WS-RESPONSE TO FILE-STATUS
818900     IF NOT SUCCESS
819000        MOVE SPACES TO WS-ASGN-FILE
819100     END-IF.
819200*
819300******************************************************************
819400 P8990-SEND-TO-EM.
819500******************************************************************
819600     IF EMP-NBR      OF WS-MSTR NUMERIC
819700        MOVE EMP-NBR OF WS-MSTR TO WS-EMP-NBR
819800        MOVE SPACES             TO P929-COMMAREA-PARMS
819900        MOVE WS-EMP-NUM         TO P929-TO-EMP-NUM
820000        SET P929-TO-EM          TO TRUE
820100        EXEC CICS LINK
820200                  PROGRAM(P929-PGM)
820300                  COMMAREA(P929-COMMAREA-PARMS)
820400                  LENGTH(P929-LGTH)
820500                  RESP(WS-RESPONSE)
820600        END-EXEC
820700        MOVE WS-RESPONSE TO FILE-STATUS
820800        IF NOT SUCCESS
820900           MOVE 'P8990-1' TO ERR-PARAGRAPH
821000           PERFORM P9999-GOT-PROBLEM
821100        END-IF
821200     END-IF.
821300
821400*CNC0526-BEG
821500******************************************************************
821600 P8995-CHECK-24HRS-START.
821700******************************************************************
821800* CS RECORD EXIST = NEW START FUCNTIONALITY (BY >24HR DIFFERENCE)
821900* NO CS RECORD    = OLD START FUCNTIONALITY (BY DAY DIFFERENCE)
822000     MOVE SPACES                         TO WS-CNTL-FILE
822100                                            WS-NEW-HOS-FLAG
822200     MOVE 'CS'                           TO CNTL-REC-TYPE
822300     PERFORM P8640-READ-CNTLFILE
822400     IF NOT (SUCCESS OR NO-RECORD-FND)
822500         MOVE SPACES                     TO ERR-KEY
822600         MOVE 'P8995-1'                  TO ERR-PARAGRAPH
822700         PERFORM P9999-GOT-PROBLEM
822800     END-IF
822900     IF SUCCESS
823000        SET WS-NEW-HOS-START             TO TRUE
823100     ELSE
823200        SET WS-OLD-HOS-START             TO TRUE
823300     END-IF.
823400*CNC0526-END
823500
823600     EXEC SQL INCLUDE DATEEDIT END-EXEC.
823700*
823800******************************************************************
823900 P9000-RETURN.
824000******************************************************************
824100     IF MSGLOG-CODE > SPACES
824200         PERFORM P9030-GET-MESSAGE
824300         MOVE MSGLOG-MESSAGE-AREA TO P920-MISC-MESSAGE
824400     END-IF
824500
824600     MOVE P920-COMMAREA-PARMS TO DFHCOMMAREA
824700     EXEC CICS RETURN END-EXEC.
824800*
824900******************************************************************
825000 P9030-GET-MESSAGE.
825100******************************************************************
825200     MOVE P920-SUB-CODE TO MSGLOG-SUB-CODE
825300     EXEC CICS READ
825400               DATASET(MSGLOG-VIA-CODE)
825500               INTO(MSGLOG-AREA)
825600               LENGTH(MSGLOG-RLGTH)
825700               RIDFLD(MSGLOG-KEY)
825800               KEYLENGTH(MSGLOG-KLGTH)
825900               RESP(WS-RESPONSE)
826000     END-EXEC
826100     MOVE WS-RESPONSE TO FILE-STATUS
826200     IF NOT SUCCESS
826300        IF P920-SUB-CODE = 1
826400           MOVE 'NO MESSAGE ON FILE' TO MSGLOG-MESSAGE
826500        ELSE
826600           MOVE 'AUCUN MESSAGE'      TO MSGLOG-MESSAGE
826700        END-IF
826800     END-IF
826900     MOVE MSGLOG-CODE     TO MSGLOG-MSG-CODE
827000     MOVE '-'             TO MSGLOG-MSG-SEP
827100     MOVE MSGLOG-SUB-CODE TO MSGLOG-MSG-SUB-CODE.
827200*
827300******************************************************************
827400 P9100-LINK-TO-931.
827500******************************************************************
827600     EXEC CICS LINK
827700               PROGRAM(P931-PGM)
827800               COMMAREA(P931-COMMAREA-PARMS)
827900               LENGTH(P931-LGTH)
828000               RESP(WS-RESPONSE)
828100     END-EXEC
828200     MOVE WS-RESPONSE TO FILE-STATUS
828300     IF NOT SUCCESS
828400        MOVE 'P9100-1'               TO ERR-PARAGRAPH
828500        MOVE 'P931LINK'              TO ERR-KEY
828600        PERFORM P9999-GOT-PROBLEM
828700     END-IF
828800     .
828900*
829000******************************************************************
829100 P9200-LINK-TO-925.
829200******************************************************************
829300     EXEC CICS LINK
829400               PROGRAM(P925-PGM)
829500               COMMAREA(P925-COMMAREA-PARMS)
829600               LENGTH(P925-LGTH)
829700               RESP(WS-RESPONSE)
829800     END-EXEC
829900     MOVE WS-RESPONSE TO FILE-STATUS
830000     IF NOT SUCCESS
830100        MOVE 'P9200-1'               TO ERR-PARAGRAPH
830200        MOVE 'P925LINK'              TO ERR-KEY
830300        PERFORM P9999-GOT-PROBLEM
830400     END-IF
830500     .
830600*
830700******************************************************************
830800 P9800-GET-TIME-OFFSET.
830900******************************************************************
831000     MOVE SPACES                TO CNTLKEY-AREA
831100     SET DATE-TIME-OFFSET-REC   TO TRUE
831200     EXEC CICS ASSIGN
831300               USERID(CNTL-DT-USERID)
831400     END-EXEC
831500     MOVE CNTLKEY-AREA          TO CNTLKEY
831600     EXEC CICS READ
831700               DATASET(CNTL-FILE-VIA-CNTLKEY)
831800               INTO(WS-CNTL-FILE)
831900               LENGTH(CNTLFILE-RLGTH)
832000               RIDFLD(CNTLKEY)
832100               KEYLENGTH(CNTLFILE-KLGTH)
832200               RESP(WS-RESPONSE)
832300     END-EXEC
832400     MOVE WS-RESPONSE TO FILE-STATUS
832500     IF NOT SUCCESS
832600        IF (NO-RECORD-FND OR END-OF-FILE)
832700           MOVE '********'      TO CNTL-DT-USERID
832800           MOVE CNTLKEY-AREA    TO CNTLKEY
832900           EXEC CICS READ
833000                     DATASET(CNTL-FILE-VIA-CNTLKEY)
833100                     INTO(WS-CNTL-FILE)
833200                     LENGTH(CNTLFILE-RLGTH)
833300                     RIDFLD(CNTLKEY)
833400                     KEYLENGTH(CNTLFILE-KLGTH)
833500                     RESP(WS-RESPONSE)
833600           END-EXEC
833700           MOVE WS-RESPONSE TO FILE-STATUS
833800        ELSE
833900           MOVE 'P9800-1'       TO ERR-PARAGRAPH
834000           MOVE CNTLKEY         TO ERR-KEY
834100           PERFORM P9999-GOT-PROBLEM
834200        END-IF
834300     END-IF
834400     IF SUCCESS
834500        MOVE CNTL-DT-ADD-SUBTRACT
834600                                TO WS-DT-OS-FUN
834700        MOVE CNTL-DT-DAYS-OFFSET
834800                                TO WS-DT-OS-DAYS
834900        MOVE CNTL-DT-HRMN-OFFSET
835000                                TO WS-DT-OS-HRMN
835100     ELSE
835200        MOVE SPACES             TO WS-DATE-TIME-OFFSET
835300        IF NOT (NO-RECORD-FND OR END-OF-FILE)
835400           MOVE 'P9800-2'       TO ERR-PARAGRAPH
835500           MOVE CNTLKEY         TO ERR-KEY
835600           PERFORM P9999-GOT-PROBLEM
835700        END-IF
835800     END-IF.
835900*
836000******************************************************************
836100 P9810-PROCESS-OFFSET.
836200******************************************************************
836300     MOVE WS-DT-OS-FUN          TO PARM-CONV-TYPE
836400     MOVE WS-DT-OS-DAYS         TO PARM-SEC-JULIAN-DAY
836500     MOVE WS-DT-OS-HRMN         TO PARM-SEC-HRMN
836600     EXEC CICS LINK
836700               PROGRAM(P903-PGM)
836800               COMMAREA(DATE-CONVERSION-PARMS)
836900               LENGTH(P903-LGTH)
837000               RESP(WS-RESPONSE)
837100     END-EXEC
837200     MOVE WS-RESPONSE           TO FILE-STATUS
837300     IF NOT SUCCESS
837400        MOVE 'P9810-1'          TO ERR-PARAGRAPH
837500        MOVE 'P903'             TO ERR-KEY
837600        PERFORM P9999-GOT-PROBLEM
837700     END-IF.
837800*
837900 P9820-SNAPSHOT-XB.
838000*
838100     IF TEMP-ASGN-XB
838200        OR (NORM-ASGN-XB AND TEMPORARY-ASGNMT NOT > SPACE)
838300        MOVE SPACES             TO P913-COMMAREA-PARMS
838400        SET P913-SNAPSHOT-FUNCTION
838500                                TO TRUE
838600        IF TEMP-ASGN-XB
838700           MOVE TA-DIST         TO P913-TURN-DIST
838800           MOVE TA-SUB-DIST     TO P913-TURN-SUB-DIST
838900           MOVE TA-CC           TO P913-TURN-CC
839000        ELSE
839100           MOVE NA-DIST         TO P913-TURN-DIST
839200           MOVE NA-SUB-DIST     TO P913-TURN-SUB-DIST
839300           MOVE NA-CC           TO P913-TURN-CC
839400        END-IF
839500        EXEC CICS LINK
839600                  PROGRAM(P913-PGM)
839700                  COMMAREA(P913-COMMAREA-PARMS)
839800                  LENGTH(P913-LGTH)
839900                  RESP(WS-RESPONSE)
840000        END-EXEC
840100        MOVE WS-RESPONSE        TO FILE-STATUS
840200        IF NOT SUCCESS
840300           MOVE 'P9820-1'       TO ERR-PARAGRAPH
840400           MOVE 'P913LINK'      TO ERR-KEY
840500           PERFORM P9999-GOT-PROBLEM
840600        END-IF
840700     END-IF.
840800*
840900*CNC0520-BEG
841000     EXEC SQL INCLUDE CHEKCRFT END-EXEC.
841100*CNC0520-END
841200*
841300     EXEC SQL INCLUDE FRASEL10 END-EXEC.
841400     EXEC SQL INCLUDE FRASHARE END-EXEC.
841500*CNC0570-BEG
841600     EXEC SQL INCLUDE FRAINS   END-EXEC.
841700*CNC0570-END
841800*
841900     EXEC SQL INCLUDE FRDCUR   END-EXEC.
842000*
842100     EXEC SQL INCLUDE TTAINS   END-EXEC.
842200     EXEC SQL INCLUDE TTASHARE END-EXEC.
842300*
842400     EXEC SQL INCLUDE LVEDEL01 END-EXEC.
842500*C957-1
842600     EXEC SQL INCLUDE LVEDEL02 END-EXEC.
842700*C957-1-END
842800     EXEC SQL INCLUDE LVEINS01 END-EXEC.
842900     EXEC SQL INCLUDE LVESEL01 END-EXEC.
843000*C957-2
843100     EXEC SQL INCLUDE LVESEL06 END-EXEC.
843200*C957-2-END
843300     EXEC SQL INCLUDE LVEUPD01 END-EXEC.
843400     EXEC SQL INCLUDE LVECNT01 END-EXEC.
843500     EXEC SQL INCLUDE LVESHARE END-EXEC.
843600
843700     EXEC SQL INCLUDE LVPDEL01 END-EXEC.
843800     EXEC SQL INCLUDE LVPSHARE END-EXEC.
843900*
844000     EXEC SQL INCLUDE HSLSEL   END-EXEC.
844100*CNC0526-BEG
844200     EXEC SQL INCLUDE HSLUPD02 END-EXEC.
844300*CNC0526-END
844400     EXEC SQL INCLUDE HSLSHARE END-EXEC.
844500*
844600     EXEC SQL INCLUDE HSDUPD01 END-EXEC.
844700     EXEC SQL INCLUDE HSDSHARE END-EXEC.
844800*
844900     EXEC SQL INCLUDE IENSEL01 END-EXEC.
845000     EXEC SQL INCLUDE IENSHARE END-EXEC.
845100*
845200*C1176.2-BEG
845300     EXEC SQL INCLUDE AALSEL02 END-EXEC.
845400     EXEC SQL INCLUDE AALSHARE END-EXEC.
845500*C1176.2-END
845600     EXEC SQL INCLUDE GOTPROB  END-EXEC.
